{
    "preguntas": {
        "Elementos Estructurales de la Vía": [
            {
                "pregunta": "¿Qué elemento de la vía férrea se encarga de transmitir las cargas de los carriles al balasto?",
                "opciones": ["A) Carril", "B) Brida", "C) Traviesa", "D) Tirafondo"],
                "respuestaCorrecta": "C",
                "explicacion": "La traviesa (o durmiente) es el elemento transversal que recibe la carga del carril y la distribuye sobre el balasto, manteniendo el ancho de vía.",
                "imagen": "https://via.placeholder.com/400x200?text=Traviesa"
            },
            {
                "pregunta": "¿Cuál es la función principal del balasto en una vía férrea?",
                "opciones": ["A) Conducir electricidad", "B) Proporcionar drenaje y elasticidad", "C) Servir como pasillo para peatones", "D) Reducir el ruido del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "El balasto es la capa de grava o piedra partida que proporciona drenaje, elasticidad y distribuye las cargas de las traviesas al terraplén."
            },
            {
                "pregunta": "¿Qué es la 'superestructura' de la vía?",
                "opciones": ["A) Los puentes y túneles", "B) El conjunto formado por carriles, traviesas, sujeciones y balasto", "C) La catenaria y los postes", "D) Los edificios de las estaciones"],
                "respuestaCorrecta": "B",
                "explicacion": "La superestructura es la parte superior de la vía que soporta directamente el paso de los trenes. La infraestructura es la base sobre la que se asienta (terraplenes, puentes, etc.)."
            },
            {
                "pregunta": "¿Cuál es el propósito de la 'inclinación 1/20' del carril?",
                "opciones": ["A) Para que el agua de lluvia escurra", "B) Para que el tren se incline en las curvas", "C) Para que el contacto con la rueda sea centrado y óptimo", "D) Es un defecto de fabricación"],
                "respuestaCorrecta": "C",
                "explicacion": "Los carriles se montan con una ligera inclinación hacia el interior para que la superficie de contacto con la conicidad de la rueda sea más amplia y centrada."
            },
            {
                "pregunta": "Las 'traviesas polivalentes' o 'mixtas' se caracterizan por:",
                "opciones": ["A) Estar hechas de varios materiales", "B) Servir para dos anchos de vía diferentes (ej. Ibérico y UIC)", "C) Poder usarse en puentes y en tierra", "D) Ser de un color especial"],
                "respuestaCorrecta": "B",
                "explicacion": "Están diseñadas con juegos de sujeciones para dos anchos de vía distintos, facilitando la migración de un ancho a otro en el futuro."
            },
            {
                "pregunta": "¿Qué es una 'Barra Larga Soldada' (BLS)?",
                "opciones": ["A) Una barra de metal para hacer palanca", "B) Un tramo de carril muy largo sin juntas de dilatación convencionales", "C) La barra de un bar en una estación", "D) Una herramienta de soldadura"],
                "respuestaCorrecta": "B",
                "explicacion": "Son carriles de cientos de metros o incluso kilómetros, unidos por soldadura, que eliminan el clásico traqueteo 'ta-ta, ta-ta' y mejoran el confort."
            },
            {
                "pregunta": "¿Para qué sirve la 'capa de subbalasto'?",
                "opciones": ["A) Es una capa de balasto de repuesto", "B) Para separar el balasto de la plataforma y mejorar la distribución de cargas", "C) Para guardar herramientas", "D) Es donde duermen los operarios"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una capa de material granular seleccionada que se coloca entre el balasto y el terraplén para evitar la contaminación del balasto y mejorar el drenaje."
            },
            {
                "pregunta": "El 'corazón' de un desvío es:",
                "opciones": ["A) El motor que lo mueve", "B) La pieza central donde se cruzan los carriles de las dos vías", "C) El operario que lo maneja", "D) La parte más sensible a las averías"],
                "respuestaCorrecta": "B",
                "explicacion": "El corazón es la pieza de acero moldeado que permite a la pestaña de la rueda cruzar el carril de la otra vía de forma continua."
            },
            {
                "pregunta": "¿Qué es la 'vía en placa'?",
                "opciones": ["A) Una vía con placas conmemorativas", "B) Un tipo de vía sin balasto, donde los carriles se fijan a una losa de hormigón", "C) Una vía con traviesas de plata", "D) Una vía de tren de juguete"],
                "respuestaCorrecta": "B",
                "explicacion": "Se usa en túneles y viaductos de alta velocidad. Requiere menos mantenimiento pero es más rígida y costosa de instalar."
            },
            {
                "pregunta": "La 'sujeción elástica' (ej. SKL, Pandrol) tiene la función de:",
                "opciones": ["A) Hacer la vía más flexible", "B) Unir el carril a la traviesa de forma firme pero con elasticidad", "C) Servir de muelle para el tren", "D) Facilitar el robo de carriles"],
                "respuestaCorrecta": "B",
                "explicacion": "Estas grapas elásticas mantienen el carril firmemente sujeto a la traviesa, impidiendo su movimiento pero absorbiendo vibraciones."
            },
            {
                "pregunta": "El 'desgaste ondulatorio' del carril es:",
                "opciones": ["A) Un tipo de óxido", "B) Un desgaste con forma de olas en la superficie de rodadura", "C) Cuando el carril se dobla por el calor", "D) El desgaste en las curvas"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un patrón de desgaste que provoca ruido y vibraciones, y se corrige con trenes amoladores."
            },
            {
                "pregunta": "¿Qué significa 'ancho de vía UIC' o estándar?",
                "opciones": ["A) 1668 mm", "B) 1000 mm", "C) 1435 mm", "D) 1520 mm"],
                "respuestaCorrecta": "C",
                "explicacion": "El ancho de 1435 mm (4 pies y 8.5 pulgadas) es el más extendido en el mundo y el utilizado en todas las líneas de alta velocidad de Europa."
            },
            {
                "pregunta": "Los 'contracarriles' se instalan en desvíos y pasos a nivel para:",
                "opciones": ["A) Servir como carril de repuesto", "B) Guiar la pestaña de la rueda y evitar que se desvíe", "C) Frenar el tren", "D) Decorar la vía"],
                "respuestaCorrecta": "B",
                "explicacion": "Son perfiles de carril que se colocan en paralelo al carril principal para guiar a las ruedas en puntos críticos donde podrían tomar un camino equivocado."
            },
            {
                "pregunta": "El 'alma' de un carril es:",
                "opciones": ["A) Su resistencia espiritual", "B) La parte superior o cabeza", "C) La parte inferior o patín", "D) La parte vertical y delgada que une la cabeza y el patín"],
                "respuestaCorrecta": "D",
                "explicacion": "La sección de un carril se compone de tres partes: cabeza (contacto con la rueda), alma (zona central) y patín (base de apoyo)."
            },
            {
                "pregunta": "¿Qué son las 'juntas de dilatación' en un puente metálico?",
                "opciones": ["A) Reuniones de directivos del puente", "B) Dispositivos especiales que permiten el movimiento del carril debido a la dilatación del puente", "C) Espacios para que los peatones crucen", "D) Un tipo de soldadura especial"],
                "respuestaCorrecta": "B",
                "explicacion": "Los puentes metálicos se expanden y contraen con la temperatura. Estas juntas evitan que esos movimientos transmitan tensiones peligrosas a los carriles."
            },
            {
                "pregunta": "La 'banqueta' de la vía es:",
                "opciones": ["A) Un asiento para esperar el tren", "B) El pasillo lateral de la vía, a veces utilizado por el personal", "C) La parte de la plataforma que se extiende más allá del balasto", "D) Un pequeño banco de trabajo"],
                "respuestaCorrecta": "C",
                "explicacion": "Es la parte del terraplén o plataforma que queda a los lados de la superestructura, proporcionando estabilidad y espacio para el drenaje."
            },
            {
                "pregunta": "Las 'traviesas de madera' se tratan con un producto llamado 'creosota' para:",
                "opciones": ["A) Hacerlas más pesadas", "B) Protegerlas de la putrefacción, los insectos y el agua", "C) Hacerlas brillar", "D) Que huelan mejor"],
                "respuestaCorrecta": "B",
                "explicacion": "La creosota es un derivado del alquitrán que impregna la madera y la protege de los agentes externos, alargando su vida útil durante décadas."
            },
            {
                "pregunta": "El 'patín' de un carril es la parte que:",
                "opciones": ["A) Está en contacto con la rueda", "B) Se apoya sobre la traviesa", "C) Se usa para patinar", "D) Se encuentra en el centro vertical"],
                "respuestaCorrecta": "B",
                "explicacion": "El patín es la base ancha y plana del carril que distribuye la carga sobre la placa de asiento y la traviesa."
            },
            {
                "pregunta": "¿Qué es un 'tope' o 'parachoques' de final de vía?",
                "opciones": ["A) Un dispositivo para detener trenes que no frenan a tiempo", "B) El primer metro de la vía", "C) Un adorno de la estación", "D) Un lugar para aparcar coches"],
                "respuestaCorrecta": "A",
                "explicacion": "Se colocan al final de las vías muertas para detener de forma segura cualquier vehículo que sobrepase el punto final de parada."
            },
            {
                "pregunta": "La 'geometría de la vía' se refiere a:",
                "opciones": ["A) Las formas dibujadas en las traviesas", "B) La posición tridimensional de los carriles en el espacio", "C) El estudio matemático de la vía", "D) El diseño artístico de las estaciones"],
                "respuestaCorrecta": "B",
                "explicacion": "Incluye parámetros como la nivelación (altura), la alineación (trazado en planta), el ancho de vía y el peralte, cruciales para la seguridad y el confort."
            },
            {
                "pregunta": "¿Qué es un 'muro de contención' en el ámbito ferroviario?",
                "opciones": ["A) Un muro para que los trenes no se salgan", "B) Una estructura que sostiene un terraplén o un desmonte", "C) La pared de una estación", "D) Un muro para pintar grafitis"],
                "respuestaCorrecta": "B",
                "explicacion": "Son muros diseñados para contener las tierras y evitar deslizamientos en zonas donde hay grandes diferencias de altura, como en trincheras o laderas."
            },
            {
                "pregunta": "Las 'placas de asiento' se colocan entre:",
                "opciones": ["A) Dos vagones", "B) La rueda y el carril", "C) El carril y la traviesa", "D) Dos traviesas"],
                "respuestaCorrecta": "C",
                "explicacion": "Estas placas, a menudo de caucho o plástico, protegen la traviesa del desgaste, mejoran el reparto de cargas y proporcionan aislamiento eléctrico."
            },
            {
                "pregunta": "¿Por qué el balasto debe ser de 'árido silíceo' o granítico?",
                "opciones": ["A) Porque brilla más", "B) Porque es el más barato", "C) Por su alta dureza, resistencia al desgaste y forma angulosa", "D) Porque es más ligero"],
                "respuestaCorrecta": "C",
                "explicacion": "Se necesitan rocas muy resistentes que no se pulvericen con el paso de los trenes y cuyas aristas se traben entre sí para formar un lecho estable."
            },
            {
                "pregunta": "El 'hilo bajo' en una curva se refiere al:",
                "opciones": ["A) El carril interior de la curva", "B) Un hilo de telaraña", "C) El cable inferior de la catenaria", "D) Un carril de peor calidad"],
                "respuestaCorrecta": "A",
                "explicacion": "Debido al peralte, el carril interior está a una cota más baja que el carril exterior (hilo alto)."
            },
            {
                "pregunta": "¿Qué es la 'cabeza del carril'?",
                "opciones": ["A) La parte delantera del carril", "B) La parte superior que está en contacto con las ruedas", "C) El extremo del carril", "D) Una escultura con forma de cabeza"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la parte superior, más ancha y robusta del perfil del carril, diseñada para soportar el enorme peso y el desgaste del paso de los trenes."
            },
            {
                "pregunta": "Las traviesas 'bibloque' se componen de:",
                "opciones": ["A) Dos bloques de hormigón unidos por una barra de acero", "B) Dos tipos de madera", "C) Un bloque de hormigón y uno de madera", "D) Dos bloques con libros dentro"],
                "respuestaCorrecta": "A",
                "explicacion": "Son un tipo de traviesa de hormigón más ligera que las monobloque, donde dos patines de hormigón están unidos por un perfil de acero."
            },
            {
                "pregunta": "¿Qué son los 'aparatos de dilatación' en una vía con Barra Larga Soldada?",
                "opciones": ["A) Calentadores para dilatar la vía", "B) Dispositivos que permiten los movimientos de la vía por temperatura en puntos concretos", "C) Herramientas para estirar el carril", "D) Gafas para ver la dilatación"],
                "respuestaCorrecta": "B",
                "explicacion": "Se instalan al principio y al final de las BLS, y en puentes, para absorber de forma controlada las grandes tensiones generadas por la temperatura."
            },
            {
                "pregunta": "El 'corazón de punta móvil' es una tecnología de desvíos que:",
                "opciones": ["A) Tiene una punta que se mueve de sitio", "B) Elimina la laguna en el corazón del desvío, permitiendo un paso más suave", "C) Es un corazón artificial para maquinistas", "D) Se usa solo en trenes de mercancías"],
                "respuestaCorrecta": "B",
                "explicacion": "En vez de un hueco fijo, una parte del corazón se mueve para dar continuidad al carril, lo que reduce el impacto y el ruido, esencial en alta velocidad."
            },
            {
                "pregunta": "¿Qué es un 'escape' en la terminología de aparatos de vía?",
                "opciones": ["A) Una fuga en el sistema de aire", "B) Una combinación de dos desvíos que permite pasar de una vía a otra paralela", "C) Una salida de emergencia", "D) El humo de una locomotora diésel"],
                "respuestaCorrecta": "B",
                "explicacion": "Un escape (o 'crossover') conecta dos vías paralelas, permitiendo a los trenes cambiar de una a otra en cualquier dirección."
            },
            {
                "pregunta": "El 'espesor de balasto' se refiere a:",
                "opciones": ["A) El tamaño de cada piedra", "B) El número de piedras por metro cúbico", "C) La altura de la capa de balasto bajo las traviesas", "D) La anchura total de la capa de balasto"],
                "respuestaCorrecta": "C",
                "explicacion": "El espesor de balasto es un parámetro de diseño crítico (normalmente 30-35 cm en alta velocidad) para asegurar una correcta distribución de cargas."
            },
            {
                "pregunta": "¿Qué problema resuelve la 'geosintéticos' (geotextiles, geomallas) bajo la vía?",
                "opciones": ["A) El aburrimiento de los pasajeros", "B) La falta de vegetación", "C) La contaminación del balasto por el barro de la plataforma", "D) La mala cobertura GPS"],
                "respuestaCorrecta": "C",
                "explicacion": "Actúan como una barrera separadora y de refuerzo, impidiendo que los finos del terraplén asciendan y contaminen el balasto, lo que mantendría sus propiedades de drenaje."
            },
            {
                "pregunta": "Las 'agujas' de un desvío son:",
                "opciones": ["A) Las piezas móviles del carril que guían al tren hacia una u otra vía", "B) Agujas de coser para reparar uniformes", "C) Las manecillas del reloj de la estación", "D) Un tipo de pez que vive bajo las vías"],
                "respuestaCorrecta": "A",
                "explicacion": "Las agujas son los carriles mecanizados y móviles que, al cambiar de posición, determinan la ruta que seguirá el tren a través del desvío."
            }
        ],
        "Sistemas y Tecnologías": [
            {
                "pregunta": "¿Qué sistema de señalización se utiliza en las líneas de alta velocidad europeas?",
                "opciones": ["A) ASFA", "B) LZB", "C) ERTMS", "D) ATP"],
                "respuestaCorrecta": "C",
                "explicacion": "El ERTMS (European Rail Traffic Management System) es el estándar europeo que permite la interoperabilidad entre redes ferroviarias de diferentes países.",
                "imagen": "https://via.placeholder.com/400x200?text=ERTMS"
            },
            {
                "pregunta": "La 'catenaria' es el sistema que provee a los trenes de:",
                "opciones": ["A) Agua potable", "B) Conexión a internet", "C) Energía eléctrica", "D) Señales de radio"],
                "respuestaCorrecta": "C",
                "explicacion": "La catenaria es el sistema de cables aéreos que suministra energía eléctrica a las locomotoras a través del pantógrafo."
            },
            {
                "pregunta": "¿Qué significa que el sistema ERTMS Nivel 1 utiliza 'Eurobalizas'?",
                "opciones": ["A) Que las balizas están fabricadas en Europa", "B) Que transmite información de forma continua al tren", "C) Que las balizas transmiten información puntual al tren al pasar sobre ellas", "D) Que las balizas funcionan con euros"],
                "respuestaCorrecta": "C",
                "explicacion": "En Nivel 1, la información de la vía (estado de señales, etc.) se carga en las balizas y el tren la lee al pasar, actualizando las órdenes en cabina."
            },
            {
                "pregunta": "El 'CTC' (Control de Tráfico Centralizado) permite:",
                "opciones": ["A) Comprar billetes desde una app", "B) Controlar las señales y desvíos de una gran área desde un único puesto de mando", "C) Calcular el peso de los trenes", "D) Controlar la temperatura de los vagones"],
                "respuestaCorrecta": "B",
                "explicacion": "El CTC es el 'cerebro' de la gestión del tráfico, permitiendo a los Responsables de Circulación visualizar y operar la red de forma remota y segura."
            },
            {
                "pregunta": "¿Cuál es el voltaje estándar de la catenaria en las líneas de alta velocidad de España y gran parte de Europa?",
                "opciones": ["A) 3.000 V en corriente continua", "B) 1.500 V en corriente continua", "C) 220 V en corriente alterna", "D) 25.000 V en corriente alterna"],
                "respuestaCorrecta": "D",
                "explicacion": "La alta velocidad utiliza 25 kV (25.000 V) en corriente alterna (50 Hz), ya que permite transmitir grandes potencias a largas distancias con menores pérdidas."
            },
            {
                "pregunta": "En el sistema de electrificación, ¿qué es una 'subestación'?",
                "opciones": ["A) Una estación de metro pequeña", "B) Una instalación que transforma la alta tensión de la red eléctrica general a la tensión de la catenaria", "C) Un taller para reparar subwoofers", "D) El sótano de una estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Las subestaciones reciben energía de la red de transporte (ej. 400 kV) y la transforman y adecuan para alimentar los tramos de catenaria."
            },
            {
                "pregunta": "El sistema 'LZB' (Linienzugbeeinflussung), precursor del ERTMS, se caracteriza por:",
                "opciones": ["A) Usar señales de humo", "B) Transmitir información continua al tren a través de un cable en la vía", "C) Funcionar solo de noche", "D) Ser un sistema de radioaficionados"],
                "respuestaCorrecta": "B",
                "explicacion": "El LZB, de origen alemán, utiliza un cable-antena entre los carriles para mantener una comunicación continua con el tren, permitiendo una conducción de alta precisión."
            },
            {
                "pregunta": "¿Qué es un 'enclavamiento electrónico'?",
                "opciones": ["A) Un candado digital para las puertas del tren", "B) Un sistema informático que garantiza la seguridad impidiendo órdenes contradictorias", "C) Un dispositivo para que los trenes no se muevan", "D) Una reunión de ingenieros"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el sistema de seguridad que comprueba que una orden (ej. mover un desvío) es segura y no entra en conflicto con otras rutas, actuando como un 'notario' electrónico."
            },
            {
                "pregunta": "La tecnología 'ATP' (Automatic Train Protection) engloba sistemas como:",
                "opciones": ["A) El aire acondicionado", "B) El piloto automático de un avión", "C) ASFA, ERTMS, y otros que supervisan la actuación del maquinista", "D) El sistema de venta de billetes"],
                "respuestaCorrecta": "C",
                "explicacion": "ATP es el término genérico para cualquier sistema que ayuda a prevenir accidentes supervisando la velocidad y la autoridad de movimiento del tren."
            },
            {
                "pregunta": "El 'pantógrafo' de un tren eléctrico sirve para:",
                "opciones": ["A) Dibujar la ruta en un mapa", "B) Captar la corriente eléctrica de la catenaria", "C) Medir la velocidad del viento", "D) Comunicarse con la estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el brazo articulado en el techo del tren que, mediante una regleta de carbono, hace contacto con el hilo de la catenaria para tomar energía."
            },
            {
                "pregunta": "Un 'circuito de vía' es un sistema que se utiliza fundamentalmente para:",
                "opciones": ["A) Crear un circuito para carreras de trenes", "B) Cargar los móviles de los pasajeros", "C) Detectar la presencia de un tren en un tramo de vía", "D) Iluminar la vía por la noche"],
                "respuestaCorrecta": "C",
                "explicacion": "Aplica una pequeña tensión entre los dos carriles. Cuando un tren pasa, sus ejes metálicos cortocircuitan el sistema, señalando que el tramo está ocupado."
            },
            {
                "pregunta": "¿Qué es la 'zona neutra' o 'zona de transición de fase' en una catenaria?",
                "opciones": ["A) Un área de descanso sin electricidad", "B) Un tramo corto de catenaria sin tensión para separar fases eléctricas distintas", "C) Una zona donde los trenes no pueden hacer ruido", "D) Un lugar donde el pH es 7"],
                "respuestaCorrecta": "B",
                "explicacion": "Separa sectores alimentados por distintas fases de la corriente alterna. Los trenes deben pasarla con el disyuntor abierto (por inercia) para no causar un cortocircuito."
            },
            {
                "pregunta": "La tecnología 'GSM-R' es un estándar de comunicación móvil usado para:",
                "opciones": ["A) El Wi-Fi de los pasajeros", "B) La comunicación por voz y datos entre el tren y el centro de control", "C) Vender billetes", "D) Un tipo de GPS"],
                "respuestaCorrecta": "B",
                "explicacion": "GSM-R (GSM-Railway) es una versión del GSM adaptada para las necesidades ferroviarias, siendo el pilar de las comunicaciones en ERTMS."
            },
            {
                "pregunta": "¿Qué es un 'detector de cajas calientes'?",
                "opciones": ["A) Un termómetro para el café", "B) Un sensor en la vía que mide la temperatura de los ejes y frenos del tren al pasar", "C) Un sistema para calentar la comida de los pasajeros", "D) Un detector de incendios en la estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Detecta rodamientos o frenos sobrecalentados (cajas calientes), una avería grave que podría causar un descarrilamiento, y alerta al centro de control."
            },
            {
                "pregunta": "El 'acceso estándar' en un tren de alta velocidad se refiere a:",
                "opciones": ["A) El tipo de billete más común", "B) La capacidad de una persona en silla de ruedas para acceder y moverse por el tren", "C) La puerta principal del tren", "D) Una contraseña de Wi-Fi"],
                "respuestaCorrecta": "B",
                "explicacion": "Las normativas de interoperabilidad exigen que los trenes sean accesibles, con espacios reservados, rampas y aseos adaptados para PMR (Personas de Movilidad Reducida)."
            },
            {
                "pregunta": "La tecnología de 'freno regenerativo' en los trenes modernos permite:",
                "opciones": ["A) Frenar más rápido que cualquier otro sistema", "B) Convertir la energía cinética del frenado en energía eléctrica y devolverla a la catenaria", "C) Regenerar las pastillas de freno", "D) Frenar sin hacer ruido"],
                "respuestaCorrecta": "B",
                "explicacion": "En lugar de disipar la energía como calor, los motores eléctricos actúan como generadores al frenar, lo que supone un gran ahorro energético."
            },
            {
                "pregunta": "¿Qué es un 'contador de ejes'?",
                "opciones": ["A) Una persona que cuenta los ejes que pasan", "B) Un sistema electrónico que cuenta los ejes que entran y salen de un tramo para saber si está ocupado", "C) Una herramienta para medir el diámetro de un eje", "D) El cuentakilómetros del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una alternativa al circuito de vía. Si el número de ejes que entra en un cantón es igual al que sale, el sistema declara el tramo libre."
            },
            {
                "pregunta": "En un tren, el 'convertidor estático' o 'SIV' (Static Inverter) se encarga de:",
                "opciones": ["A) Convertir a los pasajeros en estatuas", "B) Transformar la alta tensión de la catenaria en baja tensión para los servicios auxiliares", "C) Cambiar el ancho de vía", "D) Medir la velocidad"],
                "respuestaCorrecta": "B",
                "explicacion": "Proporciona la energía para la iluminación, climatización, enchufes, etc., a partir de la tensión que toma el transformador principal."
            },
            {
                "pregunta": "¿Qué es el 'acoplamiento automático' (tipo Scharfenberg)?",
                "opciones": ["A) Una pareja que se conoce en el tren", "B) Un sistema que permite unir dos unidades de tren de forma mecánica, neumática y eléctrica a la vez", "C) Un sistema para aparcar el tren", "D) Un tipo de nudo marinero"],
                "respuestaCorrecta": "B",
                "explicacion": "Este tipo de enganche permite acoplar y desacoplar trenes en 'mando múltiple' de forma rápida y segura, uniendo todas las conexiones necesarias."
            },
            {
                "pregunta": "El 'ancho de vía variable' o 'cambiador de ancho' es una tecnología que:",
                "opciones": ["A) Permite a la vía cambiar su ancho", "B) Permite a un tren cambiar el ancho de sus ejes para pasar de una red a otra", "C) Es una herramienta para ajustar el ancho de vía", "D) Es un tipo de billete flexible"],
                "respuestaCorrecta": "B",
                "explicacion": "Sistemas como los de Talgo permiten que un tren pase por una instalación especial que ajusta la distancia entre sus ruedas, permitiendo circular por redes de ancho ibérico y UIC."
            },
            {
                "pregunta": "La 'suspensión secundaria' de un tren, normalmente neumática, tiene como objetivo:",
                "opciones": ["A) Sostener el techo del vagón", "B) Aislar la caja del vagón de las vibraciones del bogie, proporcionando confort", "C) Suspender el servicio cuando hay averías", "D) Frenar el tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la suspensión que se encuentra entre el bogie (el 'carrito' con las ruedas) y la caja del vagón, y es la principal responsable del confort de los pasajeros."
            },
            {
                "pregunta": "¿Qué es la 'Telemática' ferroviaria?",
                "opciones": ["A) El estudio de las matemáticas a distancia", "B) El uso de tecnologías de la información para la gestión y seguimiento en tiempo real de los trenes", "C) La venta de billetes por TV", "D) Un canal de teletienda ferroviaria"],
                "respuestaCorrecta": "B",
                "explicacion": "Engloba GPS, sensores, comunicaciones y software para monitorizar la posición, el estado y las averías de la flota, optimizando la operación y el mantenimiento."
            },
            {
                "pregunta": "Un 'motor de accionamiento de aguja' es:",
                "opciones": ["A) El motor principal de la locomotora", "B) Un motor eléctrico o hidráulico que mueve físicamente las agujas de un desvío", "C) Un motor para máquinas de coser", "D) El motor de arranque del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Recibe la orden del enclavamiento y realiza el movimiento mecánico de las agujas, asegurando su correcta posición y acerrojamiento."
            },
            {
                "pregunta": "El 'mando múltiple' se refiere a la capacidad de:",
                "opciones": ["A) Varios maquinistas conduciendo a la vez", "B) Un solo maquinista para controlar varias unidades de tren acopladas entre sí", "C) Un tren con múltiples pantallas de control", "D) Un billete que sirve para varios viajes"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite aumentar la capacidad de un tren uniendo varias unidades autopropulsadas (ej. dos trenes AVE) que se controlan sincronizadamente desde la cabina de cabeza."
            },
            {
                "pregunta": "La 'videovigilancia embarcada' en un tren sirve para:",
                "opciones": ["A) Grabar películas durante el viaje", "B) Aumentar la seguridad de los pasajeros y del personal, y esclarecer incidentes", "C) Que los pasajeros vean el paisaje", "D) Controlar si los pasajeros pagan el billete"],
                "respuestaCorrecta": "B",
                "explicacion": "Las cámaras en el interior y exterior de los trenes son una herramienta de seguridad disuasoria y de gran utilidad para investigar cualquier tipo de suceso."
            },
            {
                "pregunta": "¿Qué es la 'carga por eje'?",
                "opciones": ["A) Lo que un operario puede cargar en su espalda", "B) El peso que cada eje de un vehículo transmite a la vía", "C) El número de maletas por pasajero", "D) La potencia del motor"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un parámetro fundamental en el diseño de la infraestructura. Las líneas de alta velocidad suelen tener una limitación de carga por eje más baja que las de mercancías."
            },
            {
                "pregunta": "El sistema 'ERTMS Nivel 3' representa una evolución en la que:",
                "opciones": ["A) Los trenes pueden volar", "B) Los cantones fijos desaparecen y se crean 'cantones móviles' basados en la posición del tren", "C) Se añade una tercera vía a las líneas", "D) Los maquinistas son reemplazados por robots"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el futuro del ERTMS, donde la propia integridad del tren garantiza su posición, permitiendo optimizar al máximo la distancia entre trenes y aumentar la capacidad de la línea."
            },
            {
                "pregunta": "El 'bucle inductivo' es una tecnología a veces usada para:",
                "opciones": ["A) Hacer lazos en los cordones de los zapatos", "B) Transmitir información al tren de forma similar a como funciona el pago 'contactless'", "C) Crear un campo magnético para levitar el tren", "D) Recoger objetos metálicos de la vía"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un sistema de transmisión de datos a corta distancia que puede usarse para complementar la información de las balizas en puntos específicos."
            },
            {
                "pregunta": "Un 'calefactor de agujas' es un sistema que:",
                "opciones": ["A) Calienta el café en la cabina", "B) Evita que la nieve y el hielo bloqueen el movimiento de los desvíos", "C) Calienta los asientos de los pasajeros", "D) Precalienta el motor del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "En zonas de clima frío, se instalan resistencias eléctricas o sistemas de gas en los desvíos para derretir la nieve y asegurar su correcto funcionamiento."
            },
            {
                "pregunta": "¿Qué es un 'Bogie'?",
                "opciones": ["A) Un tipo de baile popular en las estaciones", "B) La estructura giratoria bajo el vagón que alberga las ruedas, ejes y suspensión", "C) El apodo del inspector de seguridad", "D) Un fantasma que habita en los túneles"],
                "respuestaCorrecta": "B",
                "explicacion": "El bogie es un componente esencial que permite al tren inscribirse en las curvas y que soporta toda la carga del vehículo, además de alojar los motores en los trenes autopropulsados."
            },
            {
                "pregunta": "La 'redundancia' en un sistema de seguridad como un enclavamiento significa que:",
                "opciones": ["A) El sistema dice cosas obvias", "B) Hay componentes duplicados o triplicados para que el sistema siga funcionando si uno falla", "C) El sistema es muy antiguo", "D) El sistema habla demasiado"],
                "respuestaCorrecta": "B",
                "explicacion": "La redundancia es un principio clave de la seguridad. Se usan arquitecturas '2 de 2' o '2 de 3' para que un fallo simple nunca comprometa la seguridad."
            },
            {
                "pregunta": "El 'sistema de información al viajero' (SIV) incluye:",
                "opciones": ["A) Las novelas disponibles en el tren", "B) Los mapas de la ruta", "C) Las pantallas, megafonía y teleindicadores que informan de paradas, destino y avisos", "D) Guías turísticos a bordo"],
                "respuestaCorrecta": "C",
                "explicacion": "Es el conjunto de tecnologías destinadas a proporcionar información útil y en tiempo real a los pasajeros antes y durante su viaje."
            }
        ],
        "Historia Ferroviaria": [
            {
                "pregunta": "¿En qué país se inauguró la primera línea de ferrocarril pública del mundo en 1825?",
                "opciones": ["A) Estados Unidos", "B) Francia", "C) Alemania", "D) Reino Unido"],
                "respuestaCorrecta": "D",
                "explicacion": "La línea Stockton-Darlington en Inglaterra, diseñada por George Stephenson, fue la primera línea de ferrocarril pública en utilizar locomotoras de vapor."
            },
            {
                "pregunta": "La primera línea de alta velocidad del mundo, el Shinkansen, se inauguró en 1964 en...",
                "opciones": ["A) China", "B) Japón", "C) Francia", "D) España"],
                "respuestaCorrecta": "B",
                "explicacion": "El Shinkansen, también conocido como 'tren bala', se inauguró en Japón para los Juegos Olímpicos de Tokio 1964, revolucionando el transporte de pasajeros."
            },
            {
                "pregunta": "¿Quién es considerado el 'Padre del Ferrocarril' por su trabajo pionero con las locomotoras de vapor?",
                "opciones": ["A) James Watt", "B) Isambard Kingdom Brunel", "C) George Stephenson", "D) Thomas Edison"],
                "respuestaCorrecta": "C",
                "explicacion": "George Stephenson diseñó la famosa locomotora 'Rocket' y la línea Stockton-Darlington, sentando las bases del ferrocarril moderno."
            },
            {
                "pregunta": "La locomotora 'The Rocket' de Stephenson ganó las Pruebas de Rainhill en 1829 por ser:",
                "opciones": ["A) La más rápida y fiable", "B) La más grande", "C) La única que funcionó con carbón", "D) La más bonita"],
                "respuestaCorrecta": "A",
                "explicacion": "Su diseño, con caldera multitubular, demostró una velocidad y fiabilidad muy superiores a las de sus competidoras, marcando un antes y un después."
            },
            {
                "pregunta": "La construcción del Primer Ferrocarril Transcontinental en Estados Unidos finalizó en 1869 con la ceremonia del...",
                "opciones": ["A) 'Clavo de Oro' (Golden Spike)", "B) 'Riel de Plata'", "C) 'Puente de la Unión'", "D) 'Tratado del Ferrocarril'"],
                "respuestaCorrecta": "A",
                "explicacion": "La unión de las líneas de Union Pacific y Central Pacific en Promontory, Utah, se simbolizó clavando un último clavo de oro."
            },
            {
                "pregunta": "El 'ancho ibérico' (1668 mm) se adoptó en España en el siglo XIX, según una de las teorías, para:",
                "opciones": ["A) Soportar trenes más pesados", "B) Dificultar una posible invasión militar desde Francia", "C) Ahorrar costes en material", "D) Fue un error de cálculo"],
                "respuestaCorrecta": "B",
                "explicacion": "Aunque debatido, un informe de 1844 recomendó un ancho mayor que el europeo para que una orografía complicada permitiera locomotoras más potentes y, de paso, obstaculizar la logística militar."
            },
            {
                "pregunta": "¿Qué famosa novela de Agatha Christie tiene lugar casi íntegramente en un tren de lujo?",
                "opciones": ["A) Muerte en el Nilo", "B) Asesinato en el Orient Express", "C) Diez Negritos", "D) El misterio del tren azul"],
                "respuestaCorrecta": "B",
                "explicacion": "Esta obra inmortalizó al Orient Express como un escenario de misterio y glamour, contribuyendo a su leyenda."
            },
            {
                "pregunta": "El 'Metro de Londres', inaugurado en 1863, fue el primer sistema de ferrocarril...",
                "opciones": ["A) Eléctrico del mundo", "B) Subterráneo del mundo", "C) De alta velocidad", "D) Totalmente automatizado"],
                "respuestaCorrecta": "B",
                "explicacion": "Conocido como 'The Tube', fue el pionero en construir líneas subterráneas para el transporte urbano, inicialmente con locomotoras de vapor."
            },
            {
                "pregunta": "¿Qué hito representa el tren Talgo en la historia ferroviaria española?",
                "opciones": ["A) Ser el primer tren de alta velocidad", "B) Su innovador sistema de rodadura independiente y pendulación", "C) Ser el primer tren eléctrico", "D) Funcionar con energía solar"],
                "respuestaCorrecta": "B",
                "explicacion": "Desde los años 40, Talgo (Tren Articulado Ligero Goicoechea Oriol) introdujo conceptos revolucionarios como sus ruedas independientes y el centro de gravedad bajo."
            },
            {
                "pregunta": "La línea de alta velocidad Madrid-Sevilla se inauguró en 1992 con motivo de:",
                "opciones": ["A) Los Juegos Olímpicos de Barcelona", "B) La Exposición Universal de Sevilla (EXPO '92)", "C) El V Centenario del Descubrimiento de América", "D) Todas las anteriores"],
                "respuestaCorrecta": "B",
                "explicacion": "La EXPO '92 fue el catalizador para la construcción de la primera línea de alta velocidad en España, que transformó el transporte en el país."
            },
            {
                "pregunta": "¿Qué es el 'Transiberiano'?",
                "opciones": ["A) Un famoso plato de comida rusa", "B) La red ferroviaria que conecta la Rusia europea con el extremo oriente ruso", "C) Un tipo de locomotora de vapor", "D) Una marca de vodka"],
                "respuestaCorrecta": "B",
                "explicacion": "Con más de 9.000 km, es la línea de ferrocarril más larga del mundo, una obra de ingeniería monumental que atraviesa Siberia."
            },
            {
                "pregunta": "La 'fiebre del ferrocarril' (Railway Mania) fue un período de especulación intensa en la construcción de vías férreas en:",
                "opciones": ["A) Estados Unidos en los 1870s", "B) China en los 2000s", "C) Reino Unido en los 1840s", "D) España en los 1960s"],
                "respuestaCorrecta": "C",
                "explicacion": "Fue una burbuja especulativa en la que se propusieron miles de kilómetros de líneas, muchas de las cuales nunca se construyeron."
            },
            {
                "pregunta": "El 'Flying Scotsman' es una famosa locomotora de vapor británica, la primera en...",
                "opciones": ["A) Alcanzar oficialmente las 100 millas por hora (160 km/h)", "B) Cruzar el Canal de la Mancha", "C) Funcionar sin carbón", "D) Tener Wi-Fi"],
                "respuestaCorrecta": "A",
                "explicacion": "En 1934, el Flying Scotsman se convirtió en la primera locomotora de vapor en alcanzar oficialmente esta mítica barrera de velocidad."
            },
            {
                "pregunta": "¿Qué compañía japonesa opera la famosa línea de alta velocidad 'Tokaido Shinkansen' entre Tokio y Osaka?",
                "opciones": ["A) Japan Railways (JR) Central", "B) Sony", "C) Mitsubishi", "D) Nintendo"],
                "respuestaCorrecta": "A",
                "explicacion": "JR Central es una de las compañías del grupo Japan Railways y la operadora de la primera y más transitada línea de alta velocidad del mundo."
            },
            {
                "pregunta": "El 'Ferrocarril de Flåm' (Flåmsbana) en Noruega es famoso por ser:",
                "opciones": ["A) El más rápido del mundo", "B) El más largo de Europa", "C) Uno de los ferrocarriles con mayor pendiente del mundo con adherencia normal", "D) Totalmente subterráneo"],
                "respuestaCorrecta": "C",
                "explicacion": "Desciende 867 metros en solo 20 km, ofreciendo vistas espectaculares y siendo una obra maestra de la ingeniería en un terreno muy adverso."
            },
            {
                "pregunta": "¿Qué innovación introdujeron los trenes 'Pioneer Zephyr' en Estados Unidos en los años 30?",
                "opciones": ["A) El uso de acero inoxidable y motores diésel-eléctricos", "B) La tracción a vapor", "C) Los vagones de dos pisos", "D) La conducción automática"],
                "respuestaCorrecta": "A",
                "explicacion": "Su diseño aerodinámico, construcción ligera en acero inoxidable y propulsión diésel-eléctrica marcaron el inicio de la era de los trenes de pasajeros modernos y veloces."
            },
            {
                "pregunta": "El término 'Gandy Dancer' en la jerga ferroviaria estadounidense se refería a:",
                "opciones": ["A) Los maquinistas de trenes de pasajeros", "B) Los trabajadores que construían y mantenían las vías", "C) Los revisores de billetes", "D) Los bailarines en las estaciones"],
                "respuestaCorrecta": "B",
                "explicacion": "Se cree que el nombre proviene de los movimientos sincronizados que hacían al alinear los carriles con sus herramientas, fabricadas por la Gandy Manufacturing Company."
            },
            {
                "pregunta": "El tren 'Mallard' ostenta desde 1938 el récord de velocidad para una locomotora de vapor, con:",
                "opciones": ["A) 150 km/h", "B) 202.6 km/h (126 mph)", "C) 250 km/h", "D) 180 km/h"],
                "respuestaCorrecta": "B",
                "explicacion": "Esta locomotora aerodinámica británica estableció un récord de velocidad para la tracción a vapor que permanece imbatido hasta hoy."
            },
            {
                "pregunta": "¿Qué fue el 'Plan de Acondicionamiento Ferroviario Nacional' (RENFE) en la España de posguerra?",
                "opciones": ["A) Un plan para construir nuevas líneas", "B) La nacionalización de las compañías ferroviarias privadas en una sola empresa estatal", "C) Un plan para introducir la alta velocidad", "D) Un programa para electrificar todas las líneas"],
                "respuestaCorrecta": "B",
                "explicacion": "En 1941, el Estado español agrupó las diversas compañías privadas de ancho ibérico, a menudo en quiebra, en la Red Nacional de los Ferrocarriles Españoles (RENFE)."
            },
            {
                "pregunta": "¿Qué es un 'ferrocarril de cremallera'?",
                "opciones": ["A) Un tren con cremalleras en las puertas", "B) Un sistema con un tercer carril dentado para superar grandes pendientes", "C) Un tren que transporta ropa", "D) Un modelo de tren de juguete"],
                "respuestaCorrecta": "B",
                "explicacion": "Un piñón dentado en la locomotora engrana con el carril de cremallera, permitiendo a los trenes subir pendientes imposibles para la adherencia normal rueda-carril."
            },
            {
                "pregunta": "El Eurotúnel, que conecta Reino Unido y Francia, es un túnel ferroviario que se caracteriza por:",
                "opciones": ["A) Ser el más largo del mundo", "B) Tener el tramo submarino más largo del mundo", "C) Ser de uso exclusivo para trenes de mercancías", "D) Haber sido construido por los romanos"],
                "respuestaCorrecta": "B",
                "explicacion": "Aunque el túnel de base de San Gotardo es más largo en total, el Eurotúnel (Channel Tunnel) tiene el tramo bajo el mar más largo, con 37.9 km."
            },
            {
                "pregunta": "¿Qué particularidad tenía el 'ancho de vía ruso' (1520 mm)?",
                "opciones": ["A) Era más estrecho que el europeo", "B) Fue diseñado para ser compatible con el ancho ibérico", "C) Es muy similar al ancho finlandés, lo que facilita las conexiones", "D) Se mide desde el centro del carril"],
                "respuestaCorrecta": "C",
                "explicacion": "El ancho ruso es casi idéntico al de Finlandia (1524 mm), lo que ha permitido una fácil comunicación ferroviaria entre ambos países."
            },
            {
                "pregunta": "El 'Pullman Car' fue un tipo de vagón de lujo famoso en el siglo XIX en Estados Unidos por introducir:",
                "opciones": ["A) La televisión a bordo", "B) Comodidades como camas, restaurante y lujo extremo", "C) El aire acondicionado", "D) El motor diésel"],
                "respuestaCorrecta": "B",
                "explicacion": "George Pullman revolucionó el viaje en tren al crear 'hoteles sobre ruedas', haciendo los largos viajes transcontinentales mucho más cómodos y lujosos."
            },
            {
                "pregunta": "¿Qué evento histórico impulsó masivamente el uso del ferrocarril para el transporte de tropas y material?",
                "opciones": ["A) La Revolución Francesa", "B) La Guerra de Secesión estadounidense", "C) La Primera Guerra Mundial", "D) La Guerra Fría"],
                "respuestaCorrecta": "B",
                "explicacion": "La Guerra Civil (1861-1865) fue el primer gran conflicto donde el ferrocarril jugó un papel estratégico decisivo en la movilización de ejércitos y suministros."
            },
            {
                "pregunta": "La primera línea electrificada en España (Gergal-Santa Fe, Almería) se construyó en 1911 para:",
                "opciones": ["A) Transportar pasajeros a la playa", "B) El tranvía de la ciudad", "C) Transportar mineral de hierro desde las minas al puerto", "D) Probar la tecnología eléctrica"],
                "respuestaCorrecta": "C",
                "explicacion": "Fue una línea minera la que estrenó la tracción eléctrica en España, demostrando su eficacia para arrastrar cargas pesadas en pendientes."
            },
            {
                "pregunta": "¿Qué es un 'tren pendular'?",
                "opciones": ["A) Un tren que nunca llega a su destino", "B) Un tren con un sistema que inclina la caja de los vagones en las curvas", "C) Un tren que se mueve como un péndulo", "D) Un tren que funciona con un reloj de péndulo"],
                "respuestaCorrecta": "B",
                "explicacion": "La pendulación (activa o pasiva) permite al tren tomar las curvas a mayor velocidad en líneas convencionales, reduciendo la fuerza centrífuga sentida por el pasajero."
            },
            {
                "pregunta": "El 'Great Train Robbery' (El gran robo al tren) de 1963 fue un famoso asalto a un tren correo en:",
                "opciones": ["A) Estados Unidos", "B) Reino Unido", "C) Francia", "D) Australia"],
                "respuestaCorrecta": "B",
                "explicacion": "Fue uno de los robos más famosos de la historia, en el que una banda asaltó el tren correo de Royal Mail que iba de Glasgow a Londres."
            },
            {
                "pregunta": "El fin de la tracción a vapor de forma oficial en la RENFE española se produjo en:",
                "opciones": ["A) 1955", "B) 1992", "C) 1975", "D) 2005"],
                "respuestaCorrecta": "C",
                "explicacion": "En 1975, la última locomotora de vapor de servicio regular fue retirada, dando paso a la hegemonía de la tracción diésel y eléctrica."
            },
            {
                "pregunta": "El 'Maglev de Shanghai' es un tren comercial famoso por usar la tecnología de:",
                "opciones": ["A) Levitación magnética", "B) Motores de vapor de última generación", "C) Ruedas de goma", "D) Propulsión a reacción"],
                "respuestaCorrecta": "A",
                "explicacion": "Es el primer tren de levitación magnética (Maglev) de alta velocidad comercial del mundo, conectando el aeropuerto con la ciudad sin contacto físico con la vía."
            },
            {
                "pregunta": "¿Por qué el ferrocarril fue crucial para la colonización del Oeste Americano?",
                "opciones": ["A) Porque llevaba turistas", "B) Porque permitía el transporte rápido de colonos, mercancías y ganado", "C) Porque los indios no podían atacarlo", "D) Porque servía de guía para los caballos"],
                "respuestaCorrecta": "B",
                "explicacion": "El tren redujo viajes de meses a días, conectando el Este con el Oeste y permitiendo el desarrollo económico y la creación de nuevos asentamientos."
            },
            {
                "pregunta": "La estación de St. Pancras en Londres es un icono de la arquitectura ferroviaria de la época:",
                "opciones": ["A) Romana", "B) Gótica victoriana", "C) Barroca", "D) Art Decó"],
                "respuestaCorrecta": "B",
                "explicacion": "Su impresionante fachada de ladrillo rojo del Midland Grand Hotel y su enorme cubierta de hierro y cristal son un magnífico ejemplo del neogótico victoriano."
            },
            {
                "pregunta": "¿Qué significó la 'Batalla del Ancho de Vía' (Gauge War) en el Reino Unido del s. XIX?",
                "opciones": ["A) Una guerra civil por el control de los trenes", "B) La competencia entre el ancho estándar de Stephenson y el ancho grande de Brunel", "C) Un debate sobre el color de los trenes", "D) Una pelea entre dos maquinistas"],
                "respuestaCorrecta": "B",
                "explicacion": "Fue una intensa rivalidad técnica y comercial entre los partidarios del ancho de 1435 mm y los del 'broad gauge' de 2140 mm de Isambard Kingdom Brunel, ganando finalmente el estándar."
            }
        ],
        "Infraestructura y Vía de Alta Velocidad": [
            {
                "pregunta": "¿Qué tipo de carril (según su peso por metro) es común en las líneas de alta velocidad?",
                "opciones": ["A) 45 kg/m", "B) 54 kg/m", "C) 60 kg/m (UIC 60)", "D) 30 kg/m"],
                "respuestaCorrecta": "C",
                "explicacion": "El perfil UIC 60 (60 kg/m) es el estándar en alta velocidad por su gran rigidez y resistencia, necesarias para soportar las altas cargas y velocidades.",
                "imagen": "https://via.placeholder.com/400x200?text=Via+Alta+Velocidad"
            },
            {
                "pregunta": "¿Por qué es crucial la 'liberación de tensiones' antes de soldar el carril en una Barra Larga Soldada?",
                "opciones": ["A) Para que los operarios se relajen", "B) Para asegurar que el carril se sujete a una 'temperatura neutra' y evitar pandeo o rotura", "C) Para facilitar el corte del carril", "D) Para alinear el carril"],
                "respuestaCorrecta": "B",
                "explicacion": "Se calienta el carril a una temperatura neutra (20-30°C) para que las tensiones de compresión (verano) y tracción (invierno) se mantengan en rangos seguros."
            },
            {
                "pregunta": "La 'soldadura aluminotérmica' es el método más común para unir carriles en campo porque:",
                "opciones": ["A) Es el más barato", "B) No requiere maquinaria pesada", "C) Es un proceso portátil que ofrece una soldadura de alta calidad in situ", "D) Es la más rápida de todas"],
                "respuestaCorrecta": "C",
                "explicacion": "Permite realizar una soldadura por fusión de calidad directamente en la vía, sin necesidad de transportar equipos gigantescos, ideal para unir las barras largas."
            },
            {
                "pregunta": "En alta velocidad, el 'esmerilado' o amolado del carril se realiza de forma preventiva para:",
                "opciones": ["A) Hacer brillar el carril", "B) Eliminar la fatiga superficial y mantener el perfil óptimo de la rueda y el carril", "C) Enfriar el carril", "D) Medir el desgaste"],
                "respuestaCorrecta": "B",
                "explicacion": "El amolado preventivo controla micro-fisuras y el desgaste, asegurando un contacto rueda-carril perfecto, lo que es vital para la seguridad y el confort a 300 km/h."
            },
            {
                "pregunta": "Las sujeciones elásticas tipo VOSSLOH o PANDROL son vitales en alta velocidad para:",
                "opciones": ["A) Permitir que el carril se mueva libremente", "B) Mantener el carril firmemente sujeto pero absorbiendo vibraciones de alta frecuencia", "C) Facilitar el cambio rápido de carril", "D) Decorar la traviesa"],
                "respuestaCorrecta": "B",
                "explicacion": "Proporcionan una alta fuerza de apriete para evitar el deslizamiento del carril, pero su elasticidad es clave para atenuar las vibraciones y proteger el balasto."
            },
            {
                "pregunta": "¿Qué característica debe tener el balasto para líneas de alta velocidad?",
                "opciones": ["A) Ser de canto rodado (redondo)", "B) Ser de origen volcánico, muy duro y con forma cúbica (poliedro)", "C) Ser de un color claro para reflejar el sol", "D) Ser muy poroso y ligero"],
                "respuestaCorrecta": "B",
                "explicacion": "Se exige roca de muy alta calidad (granito, basalto) con un alto coeficiente de Los Ángeles para resistir la fragmentación y con aristas que garanticen la trabazón."
            },
            {
                "pregunta": "En las líneas de alta velocidad, las 'traviesas monobloque' de hormigón pretensado son el estándar por su:",
                "opciones": ["A) Bajo coste", "B) Ligereza", "C) Gran peso, durabilidad y mantenimiento de la geometría", "D) Flexibilidad"],
                "respuestaCorrecta": "C",
                "explicacion": "Su gran peso y rigidez son fundamentales para mantener el ancho de vía y la geometría con las tolerancias mínimas que exige la alta velocidad."
            },
            {
                "pregunta": "¿Por qué en la alta velocidad se usan desvíos con 'corazón de punta móvil'?",
                "opciones": ["A) Porque son más baratos", "B) Para eliminar la discontinuidad en el camino de rodadura y permitir un paso suave y seguro", "C) Porque se mueven más rápido", "D) Es una cuestión estética"],
                "respuestaCorrecta": "B",
                "explicacion": "Al eliminar el 'gap' del corazón fijo, se evita el impacto y la vibración, algo intolerable a alta velocidad, garantizando seguridad y confort."
            },
            {
                "pregunta": "La 'auscultación geométrica' en alta velocidad se realiza con una frecuencia muy alta para detectar:",
                "opciones": ["A) Pasajeros sin billete", "B) Desperfectos en la pintura del tren", "C) Mínimas desviaciones en la alineación, nivelación y ancho de vía", "D) Animales en la vía"],
                "respuestaCorrecta": "C",
                "explicacion": "A 300 km/h, desviaciones milimétricas pueden afectar gravemente a la seguridad y al confort, por lo que se miden y corrigen constantemente."
            },
            {
                "pregunta": "Una 'brida' o 'eclisa' en una línea de alta velocidad se considera:",
                "opciones": ["A) El método de unión estándar", "B) Un punto débil a evitar, usándose solo para reparaciones provisionales", "C) Un elemento decorativo", "D) Un refuerzo para la soldadura"],
                "respuestaCorrecta": "B",
                "explicacion": "La vía de alta velocidad se basa en la continuidad de la Barra Larga Soldada. Las bridas, al ser uniones atornilladas, introducen una discontinuidad y se usan solo temporalmente."
            },
            {
                "pregunta": "El 'ancho de vía' en líneas de alta velocidad (1435 mm) requiere tolerancias de mantenimiento:",
                "opciones": ["A) De varios centímetros", "B) Muy estrictas, del orden de unos pocos milímetros", "C) No requiere mantenimiento", "D) Se ajusta automáticamente"],
                "respuestaCorrecta": "B",
                "explicacion": "La estabilidad del tren a alta velocidad depende de que el ancho de vía se mantenga dentro de un rango de tolerancia muy estrecho."
            },
            {
                "pregunta": "¿Qué es la 'plataforma' de la vía?",
                "opciones": ["A) La capa de balasto", "B) El terreno compactado (terraplén o desmonte) sobre el que se asienta toda la superestructura", "C) El andén de la estación", "D) Una app para comprar billetes"],
                "respuestaCorrecta": "B",
                "explicacion": "La calidad y estabilidad de la plataforma es la base de todo. Debe tener una gran capacidad portante y un drenaje perfecto."
            },
            {
                "pregunta": "En las losas de 'vía en placa', ¿qué elemento sustituye a la traviesa y el balasto?",
                "opciones": ["A) Arena de playa", "B) Soportes de hormigón o elastómeros fijados directamente a la losa", "C) Vigas de madera", "D) Nada, el carril va pegado directamente"],
                "respuestaCorrecta": "B",
                "explicacion": "Se usan sistemas de apoyos directos o 'bloques embebidos' que se fijan a la losa de hormigón, garantizando una geometría extremadamente estable."
            },
            {
            "pregunta": "La 'Estabilidad Dinámica', conseguida con estabilizadores tras el bateo, es crucial para:",
                "opciones": ["A) Permitir la circulación a alta velocidad inmediatamente después del mantenimiento", "B) Asustar a los animales", "C) Limpiar la vía", "D) Pintar las traviesas"],
                "respuestaCorrecta": "A",
                "explicacion": "El bateo 'afloja' la vía. El estabilizador la asienta de forma controlada, evitando tener que imponer limitaciones de velocidad durante días."
            },
            {
                "pregunta": "¿Qué es el 'pandeo' de la vía?",
                "opciones": ["A) La rotura del carril por el frío", "B) La deformación lateral de la vía por una fuerte compresión debida al calor", "C) El desgaste de la cabeza del carril", "D) La inclinación en una curva"],
                "respuestaCorrecta": "B",
                "explicacion": "Es uno de los mayores riesgos en vías con Barra Larga Soldada. Una correcta liberación de tensiones y un buen lecho de balasto lo previenen."
            },
            {
                "pregunta": "La 'transición' entre vía sobre balasto y vía en placa (ej. entrada a un túnel) requiere:",
                "opciones": ["A) Una parada del tren", "B) Un diseño especial con losas de transición para evitar un cambio brusco de rigidez", "C) Un cambio de maquinista", "D) No requiere nada especial"],
                "respuestaCorrecta": "B",
                "explicacion": "Se construyen losas de hormigón de rigidez progresivamente mayor para que el cambio de una estructura 'blanda' (balasto) a una 'dura' (placa) sea suave."
            },
            {
                "pregunta": "La 'fatiga de contacto por rodadura' (RCF) es un problema que se manifiesta en los carriles como:",
                "opciones": ["A) Óxido", "B) Microfisuras, desconchones y 'head checks'", "C) Cambio de color", "D) Pérdida de magnetismo"],
                "respuestaCorrecta": "B",
                "explicacion": "Son daños superficiales causados por los ciclos de carga y descarga de las ruedas. El amolado es la principal herramienta para combatirlos."
            },
            {
                "pregunta": "En alta velocidad, las 'juntas de dilatación' de los carriles son dispositivos:",
                "opciones": ["A) Muy simples, como las de vía convencional", "B) Muy complejos, con agujas móviles que aseguran la continuidad del carril", "C) Inexistentes, están prohibidas", "D) Hechos de madera"],
                "respuestaCorrecta": "B",
                "explicacion": "Permiten grandes movimientos por la dilatación de estructuras (puentes) manteniendo un guiado perfecto y sin huecos para la rueda."
            },
            {
                "pregunta": "El 'peralte' de una curva en alta velocidad se calcula para una 'velocidad de equilibrio' que:",
                "opciones": ["A) Es la máxima velocidad permitida", "B) Es la mínima velocidad permitida", "C) Anula la fuerza centrífuga no compensada, maximizando el confort", "D) Es la velocidad del viento"],
                "respuestaCorrecta": "C",
                "explicacion": "El peralte se diseña para que, a una cierta velocidad, el pasajero no sienta ninguna aceleración lateral, como si el tren fuera en recta."
            },
            {
                "pregunta": "La 'flecha' de una curva es:",
                "opciones": ["A) Una señal que indica la dirección", "B) La distancia entre el centro de una cuerda y el arco de la curva, usada para medir su radio", "C) Un arma usada por los antiguos ferroviarios", "D) La inclinación de la curva"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un parámetro fundamental que se mide durante la auscultación para verificar que la alineación de la curva es correcta."
            },
            {
                "pregunta": "La 'auscultación ultrasónica' de carriles es vital para detectar:",
                "opciones": ["A) El desgaste superficial", "B) Fisuras internas en el carril antes de que provoquen una rotura", "C) La temperatura del carril", "D) El grado de magnetismo"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite 'ver' el interior del acero del carril para encontrar defectos que son invisibles desde fuera, previniendo roturas frágiles."
            },
            {
                "pregunta": "Una 'placa de asiento' con almohadilla elastomérica bajo el carril sirve para:",
                "opciones": ["A) Elevar la altura del carril", "B) Proteger a la traviesa, atenuar vibraciones y proporcionar aislamiento eléctrico", "C) Enfriar la traviesa", "D) Pegar el carril a la traviesa"],
                "respuestaCorrecta": "B",
                "explicacion": "Este componente es multifuncional: protege el hormigón, filtra vibraciones, aísla eléctricamente el carril para los circuitos de vía y reparte la carga."
            },
            {
                "pregunta": "¿Qué es un 'desvío o cambio tangente-cero'?",
                "opciones": ["A) Un desvío que no se puede usar", "B) Un desvío de alta gama donde la vía desviada sale tangencialmente a la directa, sin ángulo inicial", "C) Un desvío que no necesita motor", "D) Un desvío con un radio muy pequeño"],
                "respuestaCorrecta": "B",
                "explicacion": "Su diseño geométrico es extremadamente suave, eliminando la discontinuidad angular de los desvíos convencionales, lo que permite pasar por la vía desviada a alta velocidad."
            },
            {
                "pregunta": "La 'compactación' del balasto en los 'hombros' de la vía es especialmente importante para:",
                "opciones": ["A) Hacer la vía más bonita", "B) Mejorar el drenaje", "C) Aumentar la resistencia de la vía al pandeo por calor", "D) Facilitar el paso de los operarios"],
                "respuestaCorrecta": "C",
                "explicacion": "Un hombro de balasto bien compactado proporciona un 'confinamiento' lateral a la estructura de la vía, crucial para resistir las fuerzas de compresión del verano."
            },
            {
                "pregunta": "¿Por qué el 'drenaje' de la plataforma y el balasto es tan importante?",
                "opciones": ["A) Para tener agua para limpiar los trenes", "B) Para evitar que el agua ablande la plataforma y contamine el balasto, perdiendo sus propiedades", "C) Para crear ríos artificiales", "D) No es importante"],
                "respuestaCorrecta": "B",
                "explicacion": "La presencia de agua es el mayor enemigo de la vía. Un buen drenaje asegura que la plataforma se mantenga seca y estable, y el balasto limpio."
            },
            {
                "pregunta": "El 'desgaste vertical' y el 'desgaste lateral' del carril son medidos para:",
                "opciones": ["A) Saber cuánto pesa el carril", "B) Determinar si el carril ha llegado al final de su vida útil y necesita ser reemplazado", "C) Calcular el número de trenes que han pasado", "D) Ajustar el precio del billete"],
                "respuestaCorrecta": "B",
                "explicacion": "Existen límites normativos para ambos tipos de desgaste. Superarlos compromete la seguridad y obliga a la sustitución del carril."
            },
            {
                "pregunta": "El 'perfilado de balasto' con una reguladora se realiza para:",
                "opciones": ["A) Dejar el balasto completamente plano", "B) Crear un perfil geométrico específico que garantice la estabilidad y el correcto drenaje", "C) Juntar el balasto en el centro", "D) Separar las piedras por tamaño"],
                "respuestaCorrecta": "B",
                "explicacion": "La reguladora da al lecho de balasto su forma final, con la inclinación correcta en los hombros y la caja de la vía, esencial para su buen comportamiento."
            },
            {
                "pregunta": "El 'tensor hidráulico' es una herramienta usada durante la liberación de tensiones para:",
                "opciones": ["A) Estirar o comprimir el carril para facilitar el corte y la soldadura", "B) Medir la tensión arterial de los operarios", "C) Apretar las sujeciones", "D) Levantar el carril"],
                "respuestaCorrecta": "A",
                "explicacion": "Estos potentes gatos hidráulicos se fijan al carril y permiten neutralizar las tensiones, sujetando el carril en la posición correcta para trabajar en él."
            },
            {
                "pregunta": "La 'continuidad eléctrica' de la Barra Larga Soldada es importante para:",
                "opciones": ["A) El Wi-Fi del tren", "B) El correcto funcionamiento de los circuitos de vía y la corriente de retorno de tracción", "C) Evitar que los trenes se queden pegados", "D) Cargar los teléfonos móviles"],
                "respuestaCorrecta": "B",
                "explicacion": "El carril se usa como conductor para los sistemas de señalización y para que la corriente de tracción vuelva a la subestación. Las soldaduras deben garantizar esta continuidad."
            },
            {
                "pregunta": "¿Qué es la 'zona de respiración' de una Barra Larga Soldada?",
                "opciones": ["A) Un lugar donde los operarios descansan", "B) Los extremos de la barra donde se producen los mayores movimientos por la temperatura", "C) Una zona con mucha ventilación", "D) El centro de la barra"],
                "respuestaCorrecta": "B",
                "explicacion": "Mientras el centro de una BLS apenas se mueve, sus extremos se alargan y acortan. Estos movimientos son absorbidos por los aparatos de dilatación."
            }
        ],
        "Seguridad y Normativa": [
            {
                "pregunta": "¿Qué significa la señal de 'vía libre' en la señalización ferroviaria luminosa?",
                "opciones": ["A) Luz roja", "B) Luz amarilla", "C) Luz verde", "D) Luz blanca"],
                "respuestaCorrecta": "C",
                "explicacion": "La luz verde (vía libre) indica al maquinista que puede circular a la velocidad máxima permitida por la línea."
            },
            {
                "pregunta": "El 'gálibo' en el ferrocarril se refiere a:",
                "opciones": ["A) El peso máximo por eje", "B) La distancia entre ejes de un vagón", "C) El contorno máximo que puede tener un vehículo para no chocar con túneles o puentes", "D) La velocidad máxima en una curva"],
                "respuestaCorrecta": "C",
                "explicacion": "El gálibo define el espacio libre que debe quedar a los lados y por encima de la vía para que los trenes pasen sin riesgo de colisión con la infraestructura."
            },
            {
                "pregunta": "¿Qué indica una señal de 'Anuncio de Parada Diferida' (dos luces amarillas en vertical)?",
                "opciones": ["A) Parar inmediatamente", "B) Vía libre con limitación de velocidad", "C) Circular con precaución, la siguiente señal estará en Anuncio de Parada", "D) Fallo en el sistema de señalización"],
                "respuestaCorrecta": "C",
                "explicacion": "Indica que la siguiente señal se encontrará en 'Anuncio de Parada' (amarillo), por lo que el tren no necesita frenar de inmediato pero sí estar preparado para hacerlo pronto."
            },
            {
                "pregunta": "En el sistema ERTMS Nivel 2, ¿dónde recibe el maquinista las indicaciones de la vía?",
                "opciones": ["A) En señales luminosas laterales", "B) A través de la radio del tren", "C) Directamente en una pantalla en la cabina (DMI)", "D) Mediante balizas sonoras"],
                "respuestaCorrecta": "C",
                "explicacion": "En ERTMS Nivel 2, las señales físicas son en gran parte eliminadas y toda la información de autorización de movimiento se muestra en la pantalla DMI (Driver Machine Interface)."
            },
            {
                "pregunta": "¿Qué es el 'Pleno Ocupado' en una estación?",
                "opciones": ["A) Cuando todos los billetes están vendidos", "B) Un procedimiento para autorizar un movimiento hacia una vía ya ocupada", "C) Cuando la cafetería de la estación está llena", "D) Un día festivo para los ferroviarios"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una orden del Responsable de Circulación que autoriza, bajo estrictas condiciones de seguridad, que un tren entre en una vía donde ya se encuentra otro vehículo."
            },
            {
                "pregunta": "La 'distancia de frenado' de un tren depende principalmente de:",
                "opciones": ["A) El color del tren", "B) La velocidad, el peso y la pendiente de la vía", "C) La hora del día", "D) El número de pasajeros"],
                "respuestaCorrecta": "B",
                "explicacion": "A mayor velocidad y peso, y en pendiente descendente, la distancia necesaria para detener un tren aumenta considerablemente."
            },
            {
                "pregunta": "El 'Reglamento General de Circulación' (RGC) es el documento que:",
                "opciones": ["A) Fija el precio de los billetes", "B) Establece las normas y procedimientos para la circulación de trenes", "C) Regula el uniforme del personal", "D) Define los horarios de los trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "El RGC es la 'biblia' de la circulación ferroviaria, detallando el significado de las señales, las responsabilidades y cómo actuar en cada situación."
            },
            {
                "pregunta": "¿Qué significa la orden de 'Marche a la Vista'?",
                "opciones": ["A) Conducir a la máxima velocidad posible", "B) Detenerse y esperar a que mejore la visibilidad", "C) Circular con extrema precaución, preparado para parar ante cualquier obstáculo", "D) Encender las luces de largo alcance"],
                "respuestaCorrecta": "C",
                "explicacion": "Se ordena cuando hay dudas sobre si la vía está libre. El maquinista debe poder detener el tren en la mitad del espacio que ve libre por delante."
            },
            {
                "pregunta": "¿Qué es una 'Baliza' en el contexto de sistemas de seguridad como ERTMS o ASFA?",
                "opciones": ["A) Una luz de emergencia", "B) Un dispositivo pasivo en la vía que transmite información al tren cuando pasa sobre él", "C) Un tipo de traviesa especial", "D) El silbato del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Las balizas son como 'telegramas' electrónicos colocados en la vía que envían información puntual al equipo de a bordo del tren (siguiente señal, limitaciones, etc.)."
            },
            {
                "pregunta": "El 'Hombre Muerto' (o vigilante) es un sistema de seguridad que:",
                "opciones": ["A) Detecta obstáculos en la vía", "B) Asegura que el maquinista está consciente y atento", "C) Llama a emergencias automáticamente", "D) Pesa al maquinista antes de iniciar el servicio"],
                "respuestaCorrecta": "B",
                "explicacion": "Obliga al maquinista a realizar una acción repetitiva (pulsar un pedal, un botón). Si no lo hace, el sistema asume una incapacidad y frena el tren."
            },
            {
                "pregunta": "¿Para qué sirve una 'Junta de Aislamiento' en la vía?",
                "opciones": ["A) Para aislar el ruido", "B) Para crear una separación eléctrica entre dos circuitos de vía", "C) Para evitar que la vía se caliente", "D) Para unir dos tipos de carril diferentes"],
                "respuestaCorrecta": "B",
                "explicacion": "Se utilizan para delimitar los 'circuitos de vía', un sistema que detecta la presencia de un tren al cortocircuitar los carriles con sus ejes."
            },
            {
                "pregunta": "¿Qué es un 'Bloqueo Telefónico'?",
                "opciones": ["A) Un sistema para reservar billetes por teléfono", "B) Un sistema de seguridad basado en la comunicación verbal entre estaciones", "C) Una app para bloquear llamadas spam", "D) El teléfono de emergencias de la estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un modo de circulación degradado donde la seguridad se basa en la comunicación y registro de órdenes telefónicas entre Responsables de Circulación."
            },
            {
                "pregunta": "La 'carta de porte' es un documento que acompaña a:",
                "opciones": ["A) Los trenes de pasajeros", "B) Las locomotoras en pruebas", "C) Los trenes de mercancías", "D) El personal de mantenimiento"],
                "respuestaCorrecta": "C",
                "explicacion": "Detalla la naturaleza, cantidad y destino de la mercancía transportada, siendo un documento legal y logístico fundamental."
            },
            {
                "pregunta": "Una señal con una letra 'P' iluminada indica:",
                "opciones": ["A) Prohibido el paso", "B) Paso autorizado por un desvío", "C) Próxima estación", "D) Peligro inminente"],
                "respuestaCorrecta": "B",
                "explicacion": "La 'P' (de Paso) en una señal de salida indica que la ruta está establecida pero que la siguiente señal principal se encuentra en parada."
            },
            {
                "pregunta": "El término 'pantógrafo trabado' se refiere a una avería en la que:",
                "opciones": ["A) El pantógrafo no sube", "B) El pantógrafo se engancha con la catenaria, pudiendo arrancarla", "C) El pantógrafo no conduce electricidad", "D) El pantógrafo se pliega demasiado rápido"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una de las incidencias más graves en la línea aérea de contacto, ya que puede causar daños kilométricos en la catenaria."
            },
            {
                "pregunta": "¿Qué es la 'zona de protección de trabajos'?",
                "opciones": ["A) Un área donde los trabajadores tienen taquillas", "B) Un tramo de vía donde se prohíbe la circulación para realizar trabajos de forma segura", "C) Una sala de descanso", "D) El taller de soldadura"],
                "respuestaCorrecta": "B",
                "explicacion": "Se delimita con señales de protección y se corta la tensión de catenaria para que las brigadas de mantenimiento puedan trabajar sin riesgo."
            },
            {
                "pregunta": "La 'Prueba de Freno' es un procedimiento obligatorio que se realiza:",
                "opciones": ["A) Solo en trenes nuevos", "B) Cada 10 años", "C) Antes de iniciar el servicio y al modificar la composición del tren", "D) Solo si llueve"],
                "respuestaCorrecta": "C",
                "explicacion": "Asegura que el sistema de freno de todo el tren funciona correctamente y que la capacidad de frenado es la adecuada para su peso y longitud."
            },
            {
                "pregunta": "¿Qué indica un 'poste kilométrico' en la vía?",
                "opciones": ["A) El número de postes de catenaria", "B) La distancia desde el origen de la línea", "C) La velocidad máxima", "D) El límite de peso"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite localizar cualquier punto de la línea de forma inequívoca, fundamental para la gestión de la circulación y el mantenimiento."
            },
            {
                "pregunta": "El 'arenero' de una locomotora se utiliza para:",
                "opciones": ["A) Limpiar la vía", "B) Depositar arena sobre el carril para mejorar la adherencia", "C) Nivelar el balasto", "D) Hacer un castillo de arena"],
                "respuestaCorrecta": "B",
                "explicacion": "En condiciones de baja adherencia (lluvia, hojas), el arenero mejora el contacto rueda-carril para evitar patinajes al arrancar o frenar."
            },
            {
                "pregunta": "Una señal que muestra una 'X' blanca sobre fondo negro o una señal apagada debe considerarse:",
                "opciones": ["A) Como si estuviera en vía libre", "B) Como si estuviera en anuncio de precaución", "C) Como una orden de parada inmediata", "D) Se puede ignorar"],
                "respuestaCorrecta": "C",
                "explicacion": "Ante la duda o fallo de una señal, la norma de seguridad fundamental es considerarla en su estado más restrictivo, es decir, en parada."
            },
            {
                "pregunta": "¿Qué es el 'deslizamiento' (patinaje) de una rueda?",
                "opciones": ["A) Cuando la rueda gira más rápido que la velocidad de avance del tren", "B) Cuando la rueda se sale del carril", "C) Cuando la rueda se bloquea pero el tren sigue avanzando", "D) Un movimiento lateral de la rueda"],
                "respuestaCorrecta": "A",
                "explicacion": "Ocurre al acelerar con baja adherencia. El fenómeno contrario, el 'bloqueo' al frenar, se llama 'deslizamiento'."
            },
            {
                "pregunta": "La 'Declaración sobre la Red' es un documento publicado por el ADIF que contiene:",
                "opciones": ["A) Noticias sobre la red ferroviaria", "B) Las características técnicas y condiciones de acceso a la red para las empresas ferroviarias", "C) Un listado de objetos perdidos", "D) La historia de la red ferroviaria"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el manual de instrucciones para que cualquier empresa que quiera operar trenes en la red española conozca las reglas del juego."
            },
            {
                "pregunta": "La 'velocidad de liberación' en un enclavamiento se refiere a:",
                "opciones": ["A) La velocidad a la que el maquinista se siente libre", "B) La velocidad máxima permitida en un tramo", "C) La velocidad por debajo de la cual un circuito de vía libera la ruta tras el paso del tren", "D) La velocidad de escape en caso de emergencia"],
                "respuestaCorrecta": "C",
                "explicacion": "Es un parámetro de seguridad para que el sistema no deshaga una ruta hasta que esté seguro de que el tren la ha abandonado por completo."
            },
            {
                "pregunta": "Una 'banda de parada' es una señal portátil que consiste en:",
                "opciones": ["A) Una banda de música que toca para detener los trenes", "B) Una bandera roja que indica parada inmediata", "C) Una aplicación de móvil", "D) Un dispositivo sonoro"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una señal de mano o colocada en un poste temporal que los agentes de circulación o mantenimiento usan para ordenar la parada a un tren."
            },
            {
                "pregunta": "¿Qué es la 'interoperabilidad' ferroviaria?",
                "opciones": ["A) La capacidad de un tren para hablar con otro", "B) La capacidad de trenes y sistemas de diferentes países para operar en una misma red", "C) Una operación matemática compleja", "D) El intercambio de maquinistas entre países"],
                "respuestaCorrecta": "B",
                "explicacion": "La interoperabilidad, impulsada por sistemas como el ERTMS, es clave para crear un espacio ferroviario europeo único sin fronteras técnicas."
            },
            {
                "pregunta": "Las 'agujas talonables' son un tipo de desvío que:",
                "opciones": ["A) Solo se pueden tomar por el talón", "B) Se rompen si se toman por el talón", "C) Permiten ser tomadas por el talón (sentido divergente) sin romperse, aunque no esté en la posición correcta", "D) Tienen un talón de Aquiles"],
                "respuestaCorrecta": "C",
                "explicacion": "Están diseñadas para que las ruedas del tren las 'abran' al pasar por el lado incorrecto sin dañar el mecanismo, una medida de seguridad."
            },
            {
                "pregunta": "El 'Coeficiente de Freno' de un tren indica:",
                "opciones": ["A) Cuántos frenos tiene", "B) El porcentaje de peso del tren que es frenado eficazmente", "C) La habilidad del maquinista para frenar", "D) El coste de las pastillas de freno"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un cálculo crucial que determina si la capacidad de frenado del tren es suficiente para las pendientes y velocidades de la línea que va a recorrer."
            },
            {
                "pregunta": "La 'bifurcación' en términos ferroviarios es:",
                "opciones": ["A) Un tenedor para comer en el tren", "B) El punto donde una línea se divide en dos o más rutas distintas", "C) Un tipo de túnel", "D) Una discusión entre dos maquinistas"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un punto clave en la red donde los trenes pueden tomar diferentes caminos, gestionado por desvíos y señales."
            },
            {
                "pregunta": "El 'Conductor de Seguridad' es una figura que puede ir en cabina para:",
                "opciones": ["A) Contar chistes al maquinista", "B) Vigilar al maquinista en líneas o con vehículos que no conoce bien", "C) Vender bebidas", "D) Sustituir al maquinista si se cansa"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un maquinista experimentado que acompaña a otro como medida de seguridad adicional durante un periodo de aprendizaje o en una nueva línea (conocimiento de línea)."
            },
            {
                "pregunta": "¿Qué es una 'parada accidental'?",
                "opciones": ["A) Una parada programada para recoger a un amigo", "B) Una parada no prevista en el horario, debida a una incidencia o señal de parada", "C) Una parada en un área de descanso", "D) Cuando el tren se para por accidente"],
                "respuestaCorrecta": "B",
                "explicacion": "Cualquier detención no contemplada en la marcha normal del tren, que requiere comunicación con el Puesto de Mando para reanudar la marcha."
            },
            {
                "pregunta": "El 'documento de expedición' de un tren, como el 'Boletín de Órdenes e Informaciones', contiene:",
                "opciones": ["A) El menú del día", "B) Prescripciones e información relevante para la circulación de ese tren en concreto", "C) Publicidad", "D) El parte meteorológico"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un documento que el Responsable de Circulación entrega al maquinista con información vital que no está en el reglamento o libro de horarios (limitaciones, trabajos, etc.)."
            },
            {
                "pregunta": "¿Qué significa 'circular a contravía'?",
                "opciones": ["A) Circular en sentido contrario al habitual en una vía doble banalizada", "B) Circular marcha atrás", "C) Circular por una vía que no es la tuya", "D) Circular en contra de las normas"],
                "respuestaCorrecta": "A",
                "explicacion": "En vías dobles preparadas (banalizadas), se puede circular por la vía izquierda en sentido de la marcha por necesidades de la explotación, siempre bajo la protección de señales."
            }
        ],
        "Maquinaria Pesada de Vía": [
            {
                "pregunta": "La 'Bateadora' es una máquina fundamental para:",
                "opciones": ["A) Soldar carriles", "B) Nivelar y alinear la vía compactando el balasto", "C) Limpiar los túneles", "D) Transportar traviesas nuevas"],
                "respuestaCorrecta": "B",
                "explicacion": "La bateadora introduce sus 'bates' en el balasto para levantarlo, nivelarlo y compactarlo bajo las traviesas, corrigiendo la geometría de la vía."
            },
            {
                "pregunta": "¿Qué función específica tiene una 'Desguarnecedora'?",
                "opciones": ["A) Aprieta los tornillos de la vía", "B) Pinta las líneas de la estación", "C) Excava, limpia y recicla el balasto viejo", "D) Revisa el estado de la catenaria"],
                "respuestaCorrecta": "C",
                "explicacion": "La desguarnecedora elimina el balasto contaminado, lo criba para separar la piedra útil de los finos (tierra, polvo) y lo devuelve a la vía."
            },
            {
                "pregunta": "Los vagones 'Tolva' se utilizan principalmente para:",
                "opciones": ["A) Transportar pasajeros", "B) Llevar contenedores", "C) Transportar y descargar balasto nuevo", "D) Servir como taller móvil"],
                "respuestaCorrecta": "C",
                "explicacion": "Las tolvas de balasto están diseñadas para transportar grandes cantidades de piedra y descargarla de forma controlada sobre la vía."
            },
            {
                "pregunta": "¿Qué máquina sigue a la bateadora para dar la forma correcta al lecho de balasto?",
                "opciones": ["A) La dresina", "B) La perfiladora/reguladora de balasto", "C) El tren de soldadura", "D) El vehículo de auscultación"],
                "respuestaCorrecta": "B",
                "explicacion": "La perfiladora o reguladora de balasto utiliza arados y cepillos para distribuir uniformemente el balasto, creando el perfil de vía especificado."
            },
            {
                "pregunta": "El 'Estabilizador Dinámico de Vía' (DTS) simula:",
                "opciones": ["A) El paso de un terremoto", "B) La lluvia intensa", "C) El paso de trenes para asentar la vía", "D) El desgaste de los carriles"],
                "respuestaCorrecta": "C",
                "explicacion": "El DTS aplica vibraciones y una carga vertical para simular el paso de miles de toneladas, asentando la vía de forma controlada tras un bateo."
            },
            {
                "pregunta": "Una 'Dresina' es un vehículo ferroviario ligero usado para:",
                "opciones": ["A) Transporte de personal y herramientas", "B) Desguarnecer la vía", "C) Transportar locomotoras averiadas", "D) Apagar incendios"],
                "respuestaCorrecta": "A",
                "explicacion": "Las dresinas son vehículos autopropulsados, a menudo equipados con grúas o plataformas, para el transporte rápido de brigadas y material."
            },
            {
                "pregunta": "¿Qué es un 'tren de renovación de vía'?",
                "opciones": ["A) Un tren que limpia grafitis", "B) Un tren que vende billetes nuevos", "C) Un complejo sistema que cambia carriles y traviesas viejas por nuevas en una sola pasada", "D) Un tren turístico histórico"],
                "respuestaCorrecta": "C",
                "explicacion": "Estos trenes son 'fábricas sobre raíles' que levantan la vía vieja por delante y colocan la nueva por detrás de forma continua y mecanizada."
            },
            {
                "pregunta": "La 'Amoladora de carril' se utiliza para:",
                "opciones": ["A) Cortar los carriles", "B) Enfriar los carriles en verano", "C) Corregir el perfil del carril y eliminar defectos superficiales", "D) Medir la distancia entre carriles"],
                "respuestaCorrecta": "C",
                "explicacion": "Las amoladoras utilizan muelas abrasivas para eliminar el desgaste ondulatorio y otros defectos, alargando la vida útil del carril y mejorando el confort."
            },
            {
                "pregunta": "¿Qué vehículo se usa para la 'auscultación ultrasónica' de carriles?",
                "opciones": ["A) Una bateadora", "B) Un tren de mercancías", "C) Un vehículo especializado con sondas de ultrasonidos", "D) Una locomotora de vapor"],
                "respuestaCorrecta": "C",
                "explicacion": "Estos vehículos de auscultación emiten ultrasonidos en el carril para detectar fisuras internas invisibles a simple vista, previniendo roturas."
            },
            {
                "pregunta": "El 'Pórtico de colocación de traviesas' es una máquina que:",
                "opciones": ["A) Pinta las traviesas", "B) Se desplaza sobre carriles auxiliares para colocar traviesas nuevas con precisión", "C) Tritura traviesas viejas", "D) Mide la temperatura de las traviesas"],
                "respuestaCorrecta": "B",
                "explicacion": "Los pórticos son grúas móviles que recogen traviesas de vagones plataforma y las depositan en la vía con la separación correcta."
            },
            {
                "pregunta": "¿Cuál es la función de un 'Tren Taller' o 'Vehículo de Socorro'?",
                "opciones": ["A) Vender souvenirs", "B) Atender incidencias y encarrilar trenes descarrilados", "C) Repartir correo", "D) Regar las plantas de la estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Equipados con grúas potentes y herramientas, estos trenes son cruciales para resolver incidencias graves como descarrilamientos."
            },
            {
                "pregunta": "La 'Soldadura Eléctrica por Resistencia' (Flash-Butt Welding) se utiliza para:",
                "opciones": ["A) Unir carriles en un taller fijo para crear barras largas", "B) Soldar en medio de la vía", "C) Reparar la catenaria", "D) Unir los vagones entre sí"],
                "respuestaCorrecta": "A",
                "explicacion": "Es un método de soldadura de alta calidad realizado en instalaciones fijas para fabricar las Barras Largas Soldadas (BLS) que luego se transportan a la vía."
            },
            {
                "pregunta": "¿Qué máquina realiza la 'limpieza de cunetas' en la zona de la vía?",
                "opciones": ["A) Una bateadora", "B) Una locomotora de pasajeros", "C) Una excavadora de cadenas o un vehículo especializado con brazos aspiradores", "D) Una dresina"],
                "respuestaCorrecta": "C",
                "explicacion": "Mantener las cunetas limpias es vital para el drenaje. Se usan excavadoras o equipos específicos para retirar tierra, vegetación y escombros."
            },
            {
                "pregunta": "Un 'Castillete de Catenaria' es un vehículo especializado para:",
                "opciones": ["A) Medir la altura de los puentes", "B) Inspeccionar y reparar la línea aérea de contacto (catenaria)", "C) Colocar balizas de señalización", "D) Nivelar andenes"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos vehículos tienen plataformas elevadoras y giratorias que permiten a los operarios trabajar en altura de forma segura en la catenaria."
            },
            {
                "pregunta": "¿Para qué sirve un 'vehículo de auscultación geométrica' de vía?",
                "opciones": ["A) Para medir la cantidad de pasajeros", "B) Para medir con alta precisión los parámetros de la vía (nivel, alineación, ancho, etc.)", "C) Para detectar metales preciosos bajo la vía", "D) Para comprobar la cobertura móvil"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos trenes-laboratorio miden la geometría de la vía a velocidad de línea, detectando defectos que afectan a la seguridad y el confort."
            },
            {
                "pregunta": "El 'Robot de Soldadura de Carril' (Multiporpose Welder) es una innovación que:",
                "opciones": ["A) Sirve café a los maquinistas", "B) Automatiza el proceso de soldadura aluminotérmica", "C) Conduce el tren de forma autónoma", "D) Limpia las ventanas del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos sistemas robotizados automatizan tareas como el corte, precalentamiento y la propia soldadura, aumentando la calidad y seguridad del proceso."
            },
            {
                "pregunta": "¿Qué es un 'Tren de Esmerilado de Aparatos de Vía'?",
                "opciones": ["A) Un tren que pule los cristales de las señales", "B) Una máquina que afila las herramientas de los operarios", "C) Una amoladora especializada para desvíos y cruzamientos", "D) Un tren que limpia el interior de los vagones"],
                "respuestaCorrecta": "C",
                "explicacion": "Los desvíos tienen una geometría compleja. Estas máquinas usan muelas pequeñas y orientables para amolar los carriles en estas zonas críticas."
            },
            {
                "pregunta": "Una 'Compactadora de Hombros de Balasto' se usa para:",
                "opciones": ["A) Aplanar los andenes", "B) Dar mayor estabilidad lateral a la vía", "C) Hacer más cómodos los asientos del tren", "D) Romper piedras grandes"],
                "respuestaCorrecta": "B",
                "explicacion": "Compacta el balasto en los laterales (hombros) de la vía, aumentando la resistencia al pandeo y al desplazamiento lateral, crucial en alta velocidad."
            },
            {
                "pregunta": "¿Qué función tiene una 'grúa de pórtico' en un parque de maquinaria?",
                "opciones": ["A) Elevar a los operarios para que vean lejos", "B) Mover tramos de vía, desvíos y maquinaria pesada", "C) Generar electricidad para la estación", "D) Servir como arco de bienvenida"],
                "respuestaCorrecta": "B",
                "explicacion": "Son grúas gigantes que se mueven sobre raíles y se usan en las bases de montaje para cargar y descargar componentes de vía muy pesados."
            },
            {
                "pregunta": "¿Qué tipo de máquina se utiliza para realizar la 'inyección de resina' bajo placas de asiento en túneles?",
                "opciones": ["A) Una tolva de balasto", "B) Un equipo de inyección especializado", "C) Una desguarnecedora", "D) Una locomotora diésel"],
                "respuestaCorrecta": "B",
                "explicacion": "En vías en placa (sin balasto), se usan resinas especiales para rellenar huecos y asentar las sujeciones, y se aplican con equipos de bombeo e inyección."
            },
            {
                "pregunta": "Un 'vehículo bivial' (o ferrovial) es aquel que:",
                "opciones": ["A) Puede funcionar con dos tipos de combustible", "B) Tiene dos cabinas de conducción", "C) Puede circular tanto por carretera como por vía férrea", "D) Es propiedad de dos empresas"],
                "respuestaCorrecta": "C",
                "explicacion": "Estos vehículos (camiones, excavadoras) tienen ruedas de carretera y un sistema de ruedas guía retráctiles para circular por la vía, lo que les da gran versatilidad."
            },
            {
                "pregunta": "¿Qué es un 'tren herbicida'?",
                "opciones": ["A) Un tren que promueve la jardinería", "B) Un tren que transporta hierbas aromáticas", "C) Un vehículo que fumiga la vía para controlar la vegetación", "D) Un tren pintado de verde"],
                "respuestaCorrecta": "C",
                "explicacion": "La vegetación puede afectar al drenaje y la estabilidad de la vía. Estos trenes aplican herbicidas de forma controlada para mantenerla a raya."
            },
            {
                "pregunta": "La 'Tirafonadora' es una máquina o herramienta manual que sirve para:",
                "opciones": ["A) Estirar los cables de la catenaria", "B) Apretar y aflojar los tirafondos que sujetan el carril", "C) Hacer agujeros en las traviesas", "D) Fondear los barcos en el puerto"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una potente llave de impacto, manual o montada en un carro, diseñada específicamente para atornillar los tirafondos de la vía."
            },
            {
                "pregunta": "¿Qué mide un 'pantógrafo de auscultación' en un vehículo de diagnóstico de catenaria?",
                "opciones": ["A) La temperatura del aire", "B) La altura y el descentramiento del hilo de contacto", "C) El número de aves en los postes", "D) La velocidad del viento"],
                "respuestaCorrecta": "B",
                "explicacion": "Mide parámetros geométricos clave de la catenaria para asegurar un contacto perfecto con los pantógrafos de los trenes en circulación."
            },
            {
                "pregunta": "El 'Coche de Medidas Dinámicas' (como el Séneca en España) se usa para:",
                "opciones": ["A) Medir la satisfacción de los pasajeros", "B) Probar la aceleración y frenado de nuevos trenes", "C) Auscultar la vía y la catenaria a muy alta velocidad", "D) Realizar estudios de mercado"],
                "respuestaCorrecta": "C",
                "explicacion": "Son trenes-laboratorio de alta velocidad que realizan una auscultación completa de la infraestructura para certificarla y planificar mantenimientos."
            },
            {
                "pregunta": "¿Qué es una 'bateadora de aparatos de vía'?",
                "opciones": ["A) Una máquina que limpia los teléfonos de la estación", "B) Una bateadora con cabezales orientables para tratar desvíos", "C) Una máquina que bate récords de velocidad", "D) Un tipo de electrodoméstico ferroviario"],
                "respuestaCorrecta": "B",
                "explicacion": "A diferencia de las de vía general, estas bateadoras tienen bates que pueden moverse y girar para adaptarse a la compleja geometría de los desvíos."
            },
            {
                "pregunta": "Los 'vagones plataforma' son esenciales en trabajos de vía para:",
                "opciones": ["A) Organizar conciertos", "B) Transportar carriles, traviesas, maquinaria y otros materiales", "C) Servir de puente provisional", "D) Crear una zona de descanso"],
                "respuestaCorrecta": "B",
                "explicacion": "Son vagones planos y resistentes que forman la base del transporte de casi todos los materiales necesarios para la construcción y renovación de vías."
            },
            {
                "pregunta": "¿Qué función cumple el 'cepillo' de una Perfiladora/Reguladora de balasto?",
                "opciones": ["A) Limpiar los zapatos de los operarios", "B) Barrer el balasto sobrante de la cabeza de las traviesas", "C) Pintar las traviesas de colores", "D) Pulir la superficie del carril"],
                "respuestaCorrecta": "B",
                "explicacion": "El gran cepillo giratorio es el último elemento en actuar, dejando la superficie de las traviesas limpia de piedras para evitar daños y facilitar la inspección."
            },
            {
                "pregunta": "Una 'Cortadora de carril' de disco abrasivo es una herramienta para:",
                "opciones": ["A) Alargar los carriles", "B) Realizar cortes precisos y limpios en el carril", "C) Limpiar el óxido de la superficie", "D) Medir la longitud del carril"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una herramienta manual (aunque pesada) fundamental para seccionar carriles, ya sea para reparaciones o para colocar juntas de aislamiento."
            },
            {
                "pregunta": "¿Qué es una 'Unidad de Mantenimiento de Infraestructura' (UMI)?",
                "opciones": ["A) Un sindicato de trabajadores", "B) Un tren autopropulsado con talleres y grúas para mantenimiento ligero", "C) Una aplicación móvil para reportar incidencias", "D) La oficina central de mantenimiento"],
                "respuestaCorrecta": "B",
                "explicacion": "Son trenes versátiles que combinan capacidad de transporte de personal con talleres, grúas y plataformas para realizar diversas tareas de mantenimiento."
            }
        ],
        "Energía y Catenaria": [
            {
                "pregunta": "¿Cuál es la función principal de una Subestación Eléctrica de Tracción?",
                "opciones": ["A) Generar la electricidad para los trenes", "B) Conectar la red eléctrica de alta tensión general con el sistema ferroviario, transformando el voltaje", "C) Servir como garaje para los trenes de mantenimiento", "D) Controlar el tráfico de trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "Las subestaciones reciben energía a muy alta tensión (ej. 220 kV o 400 kV) y la transforman a la tensión de la catenaria (ej. 25 kV)."
            },
            {
                "pregunta": "El sistema de alimentación 2x25 kV AC utiliza un 'feeder' o alimentador. ¿Qué es este cable?",
                "opciones": ["A) Un cable de fibra óptica", "B) El cable que sostiene la catenaria (sustentador)", "C) Un cable que va por los postes con una tensión opuesta a la catenaria para crear 50 kV", "D) El cable de toma de tierra"],
                "respuestaCorrecta": "C",
                "explicacion": "El feeder lleva una tensión de -25 kV. Junto a los +25 kV de la catenaria, permite transportar la energía a 50 kV, reduciendo las pérdidas a larga distancia."
            },
            {
                "pregunta": "¿Qué es un 'Autotransformador' (AT) en el sistema 2x25 kV?",
                "opciones": ["A) Un transformador que se mueve solo", "B) Un transformador en la locomotora", "C) Un transformador en la vía que reduce los 50 kV del sistema de transporte a los 25 kV que usa el tren", "D) Un robot transformer"],
                "respuestaCorrecta": "C",
                "explicacion": "Los AT se colocan cada 10-15 km y se conectan entre el feeder y la catenaria, permitiendo que el tren siempre se alimente a 25 kV."
            },
            {
                "pregunta": "La catenaria tiene un trazado en 'zigzag'. ¿Por qué motivo?",
                "opciones": ["A) Para hacerla más resistente al viento", "B) Es un efecto estético", "C) Para que el hilo de contacto se desgaste de forma uniforme a lo ancho de la pletina del pantógrafo", "D) Para que sea más flexible"],
                "respuestaCorrecta": "C",
                "explicacion": "Si el contacto fuera siempre en el mismo punto, se crearía un surco en el carbón del pantógrafo. El zigzag distribuye el desgaste."
            },
            {
                "pregunta": "¿Qué es una 'péndola' en el conjunto de la catenaria?",
                "opciones": ["A) Un reloj de péndulo en un poste", "B) El contrapeso que tensa los cables", "C) El cable vertical que une el hilo de contacto con el cable sustentador", "D) Un tipo de aislador"],
                "respuestaCorrecta": "C",
                "explicacion": "Las péndolas, de diferentes longitudes, mantienen el hilo de contacto a una altura constante y horizontal respecto a la vía."
            },
            {
                "pregunta": "¿Qué función tienen los 'equipos de regulación de tensión' con contrapesos en la catenaria?",
                "opciones": ["A) Regular el voltaje", "B) Mantener la tensión mecánica del cableado constante a pesar de los cambios de temperatura", "C) Pesar los trenes que pasan", "D) Servir de anclaje fijo"],
                "respuestaCorrecta": "B",
                "explicacion": "Los cables se dilatan o contraen con la temperatura. Los contrapesos suben o bajan para mantener la tensión mecánica siempre en su valor óptimo."
            },
            {
                "pregunta": "Una 'Zona Neutra' o de transición de fase obliga al maquinista a:",
                "opciones": ["A) Acelerar a fondo", "B) Abrir el disyuntor principal del tren para pasar por inercia", "C) Tocar el silbato", "D) Frenar y detener el tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Estas zonas separan sectores alimentados por fases eléctricas diferentes. Cruzarlas con el disyuntor cerrado provocaría un cortocircuito masivo."
            },
            {
                "pregunta": "¿Qué es un 'seccionador' en el sistema de electrificación?",
                "opciones": ["A) Una herramienta para cortar carriles", "B) Un interruptor de alta tensión que permite aislar tramos de catenaria", "C) Un operario que divide los trenes", "D) Una sección de la vía sin balasto"],
                "respuestaCorrecta": "B",
                "explicacion": "Los seccionadores son como interruptores que permiten al personal de telemando de energía aislar eléctricamente un tramo para mantenimiento o en caso de avería."
            },
            {
                "pregunta": "El 'Telemando de Energía' es un centro de control que permite:",
                "opciones": ["A) Conducir los trenes a distancia", "B) Operar de forma remota todos los seccionadores y disyuntores de la red de electrificación", "C) Vender billetes de forma telemática", "D) Medir la energía consumida por los pasajeros"],
                "respuestaCorrecta": "B",
                "explicacion": "Desde este centro se supervisa y controla todo el sistema de energía, garantizando la seguridad y la continuidad del suministro eléctrico."
            },
            {
                "pregunta": "El 'hilo de contacto' de la catenaria está hecho de una aleación de cobre y otro metal (estaño, magnesio) para:",
                "opciones": ["A) Hacerlo más barato", "B) Aumentar su resistencia mecánica y al desgaste sin perder mucha conductividad", "C) Que sea más ligero", "D) Cambiar su color"],
                "respuestaCorrecta": "B",
                "explicacion": "El cobre puro es muy buen conductor pero blando. La aleación mejora sus propiedades mecánicas para soportar la tensión y el paso del pantógrafo."
            },
            {
                "pregunta": "¿Qué es el 'cable sustentador'?",
                "opciones": ["A) Es otro nombre para el hilo de contacto", "B) El cable superior de la catenaria del que cuelgan las péndolas", "C) El cable de toma de tierra", "D) Un cable de seguridad para los operarios"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el cable que soporta el peso principal del sistema y tiene una forma de catenaria (curva), de la cual se suspende el hilo de contacto para mantenerlo recto."
            },
            {
                "pregunta": "La 'ménsula' de un poste de catenaria es:",
                "opciones": ["A) La base de hormigón del poste", "B) El propio poste vertical", "C) La estructura de brazo o escuadra que sale del poste y soporta la catenaria", "D) Un tipo de señal luminosa"],
                "respuestaCorrecta": "C",
                "explicacion": "La ménsula es el conjunto de perfiles y aisladores que posiciona el sustentador y el hilo de contacto a la altura y descentramiento correctos."
            },
            {
                "pregunta": "¿Qué es la 'corriente de retorno'?",
                "opciones": ["A) La energía que devuelve el tren al frenar", "B) La corriente eléctrica que vuelve a la subestación a través de los carriles", "C) Una corriente de aire en los túneles", "D) El dinero que te devuelven si anulas un billete"],
                "respuestaCorrecta": "B",
                "explicacion": "Para que un circuito funcione, la corriente debe volver. En los trenes, la electricidad vuelve a la subestación usando los carriles como conductor de retorno."
            },
            {
                "pregunta": "Un 'aislador' en un poste de catenaria, hecho de cerámica o polímero, sirve para:",
                "opciones": ["A) Decorar el poste", "B) Evitar que la alta tensión de la catenaria se fugue a tierra a través del poste", "C) Servir de fusible", "D) Sujetar los cables"],
                "respuestaCorrecta": "B",
                "explicacion": "Son elementos con muy baja conductividad eléctrica que se interponen entre los cables con tensión y las estructuras metálicas puestas a tierra."
            },
            {
                "pregunta": "¿Qué es una 'catenaria rígida' y dónde se usa principalmente?",
                "opciones": ["A) Una catenaria que no se puede mover; se usa en campo abierto", "B) Un perfil de aluminio en vez de cables; se usa en túneles y talleres", "C) Un tipo de catenaria para trenes de juguete", "D) Una catenaria muy tensada"],
                "respuestaCorrecta": "B",
                "explicacion": "Sustituye los cables por un raíl rígido de aluminio. Es ideal para túneles por su menor altura y necesidad de mantenimiento."
            },
            {
                "pregunta": "El 'disyuntor' de una subestación es:",
                "opciones": ["A) Un transformador pequeño", "B) Un interruptor automático de gran potencia que protege la línea de cortocircuitos", "C) El edificio de la subestación", "D) El operario jefe"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el elemento de protección principal. Si detecta un cortocircuito en la catenaria, se abre en milisegundos para cortar la alimentación."
            },
            {
                "pregunta": "¿Qué significa 'poner a tierra' un tramo de catenaria?",
                "opciones": ["A) Bajarla hasta el suelo", "B) Conectar eléctricamente la catenaria a tierra para poder trabajar en ella sin tensión", "C) Enterrar los cables sobrantes", "D) Medir la distancia al suelo"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una medida de seguridad CRUCIAL. Antes de cualquier trabajo, se verifica la ausencia de tensión y se conecta a tierra para descargarla y proteger al personal."
            },
            {
                "pregunta": "Un 'pórtico funicular' en electrificación es:",
                "opciones": ["A) Un teleférico para operarios", "B) Una estructura que cruza varias vías, soportando todas sus catenarias", "C) La puerta de entrada a una subestación", "D) Un tipo de puente"],
                "respuestaCorrecta": "B",
                "explicacion": "En playas de vías de estaciones, donde no se pueden poner postes intermedios, se usan estos grandes pórticos para sostener todos los sistemas de catenaria."
            },
            {
                "pregunta": "La 'altura del hilo de contacto' es un parámetro que:",
                "opciones": ["A) Es siempre la misma en toda la red", "B) Varía y debe mantenerse dentro de un rango estricto para asegurar el contacto con el pantógrafo", "C) Se ajusta según el tipo de tren", "D) No tiene importancia"],
                "respuestaCorrecta": "B",
                "explicacion": "Debe ser muy constante para evitar que el pantógrafo dé saltos o se enganche, pero puede variar ligeramente en túneles o pasos inferiores."
            },
            {
                "pregunta": "¿Qué es un 'seccionamiento' en la catenaria?",
                "opciones": ["A) Un corte físico en el cable", "B) Un punto donde dos catenarias se solapan para permitir el paso del pantógrafo sin perder contacto", "C) Una sección de repuesto", "D) El final de la catenaria"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite separar eléctricamente dos tramos. El pantógrafo deja un hilo de contacto y empieza a tocar el siguiente antes de abandonar por completo el primero."
            },
            {
                "pregunta": "¿Por qué la corriente alterna (AC) es preferible a la continua (DC) para la alta velocidad?",
                "opciones": ["A) Porque es más segura", "B) Porque es más barata de generar", "C) Porque permite elevar el voltaje fácilmente, transmitir la energía a largas distancias con pocas pérdidas", "D) Porque los trenes de AC corren más"],
                "respuestaCorrecta": "C",
                "explicacion": "La gran ventaja de la AC es que su voltaje se puede transformar fácilmente. Transportar a alto voltaje y bajo amperaje minimiza las pérdidas por efecto Joule."
            },
            {
                "pregunta": "El 'arco eléctrico' es un fenómeno peligroso que ocurre cuando:",
                "opciones": ["A) El pantógrafo se ilumina con luces de colores", "B) La electricidad salta por el aire entre la catenaria y el pantógrafo si hay un mal contacto", "C) El tren pasa bajo un arcoíris", "D) El pantógrafo toma una forma de arco"],
                "respuestaCorrecta": "B",
                "explicacion": "Un mal contacto a alta velocidad puede generar arcos eléctricos que dañan tanto el hilo de contacto como la pletina del pantógrafo."
            },
            {
                "pregunta": "El 'feeder de retorno' es un cable que a veces se usa para:",
                "opciones": ["A) Mejorar la conductividad del circuito de retorno cuando los carriles no son suficientes", "B) Devolver la energía regenerada", "C) Alimentar las estaciones", "D) Enviar señales de radio"],
                "respuestaCorrecta": "A",
                "explicacion": "En zonas de mucho tráfico o con túneles largos, un cable de retorno conectado a los carriles ayuda a que la corriente vuelva a la subestación de forma más eficiente."
            },
            {
                "pregunta": "¿Qué es una 'toma de tierra' en un poste metálico?",
                "opciones": ["A) Una maceta con tierra", "B) Un cable que conecta el poste directamente a una pica clavada en el suelo", "C) Una muestra de tierra para analizar", "D) El color del poste"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una medida de seguridad para que, si un aislador falla y el poste se pone en tensión, la corriente se derive a tierra y no electrocute a nadie."
            },
            {
                "pregunta": "El concepto de 'elasticidad' de la catenaria se refiere a:",
                "opciones": ["A) Lo mucho que se puede estirar antes de romperse", "B) Su capacidad para devolver al pantógrafo una fuerza de reacción uniforme", "C) Que está hecha de goma", "D) Su capacidad para doblarse con el viento"],
                "respuestaCorrecta": "B",
                "explicacion": "Una buena elasticidad significa que la catenaria 'cede' de forma homogénea al paso del pantógrafo, evitando puntos duros que provoquen rebotes."
            },
            {
                "pregunta": "¿Qué son los 'cables de guarda' que a veces van por encima de toda la catenaria?",
                "opciones": ["A) Cables de repuesto", "B) Cables destinados a proteger la instalación de las descargas atmosféricas (rayos)", "C) Cables para colgar ropa", "D) Antenas de radio"],
                "respuestaCorrecta": "B",
                "explicacion": "Actúan como pararrayos, interceptando los rayos y derivando su corriente a tierra de forma segura a través de los postes."
            },
            {
                "pregunta": "Una 'avería de catenaria' es una incidencia muy grave porque:",
                "opciones": ["A) Requiere que los pasajeros empujen el tren", "B) Suele afectar a un tramo largo e interrumpe la circulación en ambas vías durante horas", "C) Hace mucho ruido", "D) Gasta mucha electricidad"],
                "respuestaCorrecta": "B",
                "explicacion": "Un enganchón puede arrancar cientos de metros de cableado, dejando la línea inutilizada y requiriendo una reparación compleja y lenta."
            },
            {
                "pregunta": "El 'descentramiento' del hilo de contacto es:",
                "opciones": ["A) Que el hilo no está centrado en el país", "B) La distancia horizontal del hilo de contacto respecto al eje de la vía", "C) Un defecto de fabricación", "D) El movimiento del hilo con el viento"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el parámetro que define el 'zigzag' de la catenaria. Se mide y mantiene para asegurar el desgaste uniforme del pantógrafo."
            },
            {
                "pregunta": "La 'compensación' en una curva se refiere a:",
                "opciones": ["A) Pagar más a los operarios que trabajan en curvas", "B) Añadir postes y ménsulas adicionales en las curvas para contrarrestar la fuerza centrífuga de la catenaria", "C) Reducir la velocidad en las curvas", "D) Enderezar la curva"],
                "respuestaCorrecta": "B",
                "explicacion": "En las curvas, la tensión de los cables tiende a tirar de la catenaria hacia el interior. Se necesitan anclajes y postes extra para mantenerla en su sitio."
            },
            {
                "pregunta": "¿Qué vehículo se utiliza para la auscultación y mantenimiento de la catenaria?",
                "opciones": ["A) Un tren de pasajeros normal", "B) Un helicóptero", "C) Una dresina o castillete de catenaria con plataforma elevadora", "D) Un dron"],
                "respuestaCorrecta": "C",
                "explicacion": "Estos vehículos especializados permiten a los operarios elevarse hasta la altura de la catenaria para inspeccionarla y repararla de forma segura."
            }
        ],
        "Comunicaciones": [
            {
                "pregunta": "En un sistema de alimentación de -48V DC, ¿qué indica una alarma de 'Tensión Baja' en el rectificador?",
                "opciones": ["A) Que la tensión es superior a -56V", "B) Que hay un cortocircuito en la red", "C) Que la tensión ha caído por debajo del umbral seguro (ej. -47.5V), posiblemente por un fallo de red", "D) Que el equipo está funcionando con normalidad"],
                "respuestaCorrecta": "C",
                "explicacion": "Una alarma de tensión baja se activa cuando la salida del rectificador cae por debajo del nivel preestablecido, lo que pone en riesgo la alimentación de los equipos si las baterías se agotan."
            },
            {
                "pregunta": "Durante el mantenimiento preventivo de un rack de equipos, ¿cuál es la primera medida de seguridad a tomar antes de manipular cualquier componente?",
                "opciones": ["A) Medir la potencia óptica", "B) Reiniciar todos los equipos", "C) Utilizar una pulsera antiestática (ESD) para proteger los equipos y a uno mismo", "D) Verificar la velocidad de los ventiladores"],
                "respuestaCorrecta": "C",
                "explicacion": "El uso de protección contra descargas electrostáticas (ESD) es fundamental para evitar daños irreparables en los componentes electrónicos sensibles."
            },
            {
                "pregunta": "¿Qué equipo se utiliza para medir la atenuación y localizar fallos (cortes, empalmes defectuosos) en un cable de fibra óptica?",
                "opciones": ["A) Un multímetro", "B) Un OTDR (Reflectómetro Óptico en el Dominio del Tiempo)", "C) Un certificador de red Ethernet", "D) Un medidor de campo GSM-R"],
                "respuestaCorrecta": "B",
                "explicacion": "El OTDR es la herramienta esencial para caracterizar un enlace de fibra, ya que envía pulsos de luz y analiza los reflejos para crear un mapa de eventos y pérdidas."
            },
            {
                "pregunta": "En una red de transporte SDH, ¿qué significa el término 'conmutación a protección'?",
                "opciones": ["A) Apagar el equipo para protegerlo", "B) El cambio automático de la señal a una ruta de respaldo (anillo) cuando la ruta principal falla", "C) Activar el firewall de la red", "D) Cambiar la contraseña de acceso"],
                "respuestaCorrecta": "B",
                "explicacion": "Las redes SDH se diseñan con anillos redundantes. La conmutación a protección es el mecanismo que garantiza la continuidad del servicio en menos de 50 ms."
            },
            {
                "pregunta": "El protocolo OSPF (Open Shortest Path First) se utiliza en la red IP/MPLS para:",
                "opciones": ["A) Sincronizar la hora de los equipos", "B) Encriptar las comunicaciones", "C) Permitir que los routers intercambien información y calculen la ruta más eficiente de forma dinámica", "D) Asignar direcciones IP"],
                "respuestaCorrecta": "C",
                "explicacion": "OSPF es un protocolo de enrutamiento dinámico que permite a la red adaptarse automáticamente a cambios o caídas de enlaces, recalculando siempre el mejor camino."
            },
            {
                "pregunta": "Según la documentación, la limpieza de los conectores de fibra óptica (pigtails, latiguillos) es crucial. ¿Qué herramienta se debe usar?",
                "opciones": ["A) Un paño con alcohol isopropílico", "B) La manga de la camisa", "C) Limpiadores de un solo 'clic' o toallitas especiales sin pelusa", "D) Aire comprimido a alta presión"],
                "respuestaCorrecta": "C",
                "explicacion": "La suciedad es la principal causa de fallos en enlaces de fibra. Se deben usar herramientas específicas que no dejen residuos ni rayen la férula del conector."
            },
            {
                "pregunta": "Un módem Westermo DDW-142 se utiliza comúnmente para extender redes Ethernet sobre:",
                "opciones": ["A) Fibra óptica monomodo", "B) El par de cobre tradicional (tecnología SHDSL)", "C) Un enlace de radio", "D) Cable coaxial"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos módems industriales aprovechan el cableado de cobre existente para crear enlaces Ethernet de varios megabits, una solución común para conectar equipos en campo."
            },
            {
                "pregunta": "¿Qué indica un LED de 'alarma' de color rojo fijo en un multiplexor óptico de Huawei?",
                "opciones": ["A) Que el equipo está arrancando", "B) Que existe un fallo crítico que interrumpe el servicio (ej. 'Loss of Signal')", "C) Que hay una alarma menor o una advertencia", "D) Que el equipo está en modo de bajo consumo"],
                "respuestaCorrecta": "B",
                "explicacion": "Los códigos de colores de los LEDs son estándar: el rojo indica una alarma crítica; el amarillo, una advertencia no crítica; y el verde, un funcionamiento normal."
            },
            {
                "pregunta": "En un sistema de gestión de red (NMS), ¿qué es un 'trap SNMP'?",
                "opciones": ["A) Una trampa para hackers", "B) Un mensaje de alarma no solicitado que un equipo envía al gestor cuando detecta un evento anómalo", "C) Una consulta que el gestor hace al equipo", "D) Un tipo de virus de red"],
                "respuestaCorrecta": "B",
                "explicacion": "En lugar de que el NMS esté preguntando constantemente ('polling'), los equipos envían 'traps' para notificar proactivamente sobre fallos, optimizando la comunicación."
            },
            {
                "pregunta": "La 'última milla' en la red de acceso de telecomunicaciones se refiere a:",
                "opciones": ["A) El cable más largo de la red", "B) El tramo final de la red que conecta directamente con el equipo del abonado o instalación final", "C) La conexión entre dos países", "D) El núcleo de la red de transporte"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la parte capilar de la red, que puede estar basada en tecnologías como fibra (FTTH), cobre (xDSL) o radio."
            },
            {
                "pregunta": "¿Cuál es el propósito de realizar una 'copia de seguridad' (backup) de la configuración de un router o switch?",
                "opciones": ["A) Para que el equipo funcione más rápido", "B) Para poder restaurar rápidamente el servicio en caso de un fallo de hardware o un error de configuración", "C) Es un requisito legal sin utilidad técnica", "D) Para liberar memoria en el equipo"],
                "respuestaCorrecta": "B",
                "explicacion": "El backup de la configuración es una tarea de mantenimiento esencial que permite una recuperación rápida y fiable del servicio ante cualquier incidencia grave."
            },
            {
                "pregunta": "La tecnología DWDM (Dense Wavelength Division Multiplexing) permite:",
                "opciones": ["A) Enviar datos por el cable de tierra", "B) Transmitir múltiples señales de datos sobre una única fibra óptica, cada una en una longitud de onda (color) diferente", "C) Aumentar el voltaje de la fibra", "D) Crear una red Wi-Fi a través de la fibra"],
                "respuestaCorrecta": "B",
                "explicacion": "DWDM es la tecnología clave que permite capacidades de transmisión de Terabits/segundo en las redes de transporte, multiplicando la capacidad de la fibra."
            },
            {
                "pregunta": "Un 'switch de Nivel 2' (L2) toma decisiones de reenvío de paquetes basándose en:",
                "opciones": ["A) La dirección IP de destino", "B) La dirección MAC de destino", "C) El puerto de origen", "D) El tipo de aplicación"],
                "respuestaCorrecta": "B",
                "explicacion": "Los switches L2 operan en la capa de enlace de datos y utilizan las direcciones físicas (MAC) para conmutar el tráfico dentro de una misma red local (LAN)."
            },
            {
                "pregunta": "Al inspeccionar una sala de equipos, se detecta que la temperatura ambiente es de 45°C. ¿Qué acción se debe tomar?",
                "opciones": ["A) Es una temperatura normal, no hacer nada", "B) Apagar todos los equipos inmediatamente", "C) Generar una alarma por fallo del sistema de climatización, ya que esa temperatura puede causar averías", "D) Abrir las ventanas para que entre aire fresco"],
                "respuestaCorrecta": "C",
                "explicacion": "Los equipos de telecomunicaciones deben operar en un rango de temperatura controlado (normalmente 18-27°C). Una temperatura elevada indica un fallo en la climatización y es un riesgo grave."
            },
            {
                "pregunta": "¿Qué es un 'ber-test' o prueba de Bit Error Rate?",
                "opciones": ["A) Una prueba de resistencia del cable", "B) Una prueba que transmite un patrón de datos conocido por un enlace y cuenta cuántos bits llegan con errores", "C) Un test de velocidad de internet", "D) Una prueba de seguridad de la red"],
                "respuestaCorrecta": "B",
                "explicacion": "El BER es un indicador clave de la calidad de un enlace de transmisión. Un BER alto (muchos errores) indica problemas en el medio físico o en los equipos."
            },
            {
                "pregunta": "En el contexto de la ciberseguridad, un 'puerto de gestión' de un equipo (como el puerto de consola o un puerto Ethernet de gestión) debe estar:",
                "opciones": ["A) Conectado directamente a la red de pasajeros", "B) Abierto a Internet para facilitar el acceso remoto", "C) En una red separada y segura (VLAN de gestión) para evitar accesos no autorizados", "D) Desactivado permanentemente"],
                "respuestaCorrecta": "C",
                "explicacion": "La segregación de la red de gestión es una medida de seguridad básica para proteger la configuración y el control de los equipos de red."
            },
            {
                "pregunta": "¿Qué es un 'SFP' (Small Form-factor Pluggable)?",
                "opciones": ["A) El software principal de un router", "B) Un módulo transceptor compacto y extraíble que convierte señales eléctricas en ópticas (y viceversa)", "C) El ventilador de un switch", "D) Un tipo de tornillo especial"],
                "respuestaCorrecta": "B",
                "explicacion": "Los módulos SFP (o sus variantes SFP+, QSFP) dan flexibilidad a los equipos, permitiendo usar diferentes tipos de fibra o distancias simplemente cambiando el módulo."
            },
            {
                "pregunta": "La 'sincronización' en una red de telecomunicaciones (ej. SyncE) es fundamental para:",
                "opciones": ["A) Que todos los equipos muestren la misma hora al usuario", "B) Asegurar que los flujos de datos se transmitan sin errores ni deslizamientos (slips)", "C) Ahorrar energía", "D) Cumplir con la normativa de colores"],
                "respuestaCorrecta": "B",
                "explicacion": "Una sincronización precisa es vital para las redes TDM como SDH y para el correcto funcionamiento de interfaces de alta velocidad, evitando la pérdida de datos."
            },
            {
                "pregunta": "Un 'inventario de red' actualizado es una herramienta de mantenimiento importante porque:",
                "opciones": ["A) Sirve para decorar la oficina del jefe", "B) Permite conocer qué equipos, versiones de software y conexiones existen, facilitando la gestión y resolución de averías", "C) Es necesario para calcular los impuestos", "D) No tiene ninguna utilidad real"],
                "respuestaCorrecta": "B",
                "explicacion": "Saber exactamente qué hay en la red es el primer paso para una gestión eficiente, la planificación de actualizaciones y una rápida actuación ante incidencias."
            },
            {
                "pregunta": "¿Para qué sirve un 'latiguillo de medida' o 'bobina de lanzamiento' cuando se usa un OTDR?",
                "opciones": ["A) Para alargar la fibra que se quiere medir", "B) Para crear una sección de fibra antes del enlace a medir y así poder caracterizar el primer conector", "C) Para limpiar el conector del OTDR", "D) Para atenuar la señal"],
                "respuestaCorrecta": "B",
                "explicacion": "El OTDR tiene una 'zona muerta' inicial. La bobina de lanzamiento permite que la medida se estabilice para poder ver y medir correctamente el evento del primer conector del enlace."
            },
            {
                "pregunta": "Un 'grupo electrógeno' en una sala de comunicaciones tiene la misión de:",
                "opciones": ["A) Sustituir a los rectificadores en el día a día", "B) Proporcionar energía de larga duración cuando hay un corte de la red eléctrica general, una vez que las baterías del SAI se agotan", "C) Climatizar la sala", "D) Reducir el ruido de los equipos"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el último respaldo de energía. El SAI cubre los primeros minutos y el grupo electrógeno arranca para proporcionar autonomía durante horas o días."
            },
            {
                "pregunta": "El protocolo 'Telnet' para la gestión remota de equipos está en desuso y se sustituye por 'SSH' porque:",
                "opciones": ["A) SSH es más rápido", "B) Telnet solo funciona en equipos antiguos", "C) SSH encripta la comunicación, mientras que Telnet envía usuarios y contraseñas en texto plano", "D) SSH permite conectar más usuarios a la vez"],
                "respuestaCorrecta": "C",
                "explicacion": "Por seguridad, todo el acceso a la línea de comandos de los equipos de red debe hacerse a través de SSH para proteger las credenciales y los datos de la sesión."
            },
            {
                "pregunta": "Si un switch Nokia 7210 presenta un LED de estado (Status) parpadeando en verde, indica que:",
                "opciones": ["A) El equipo tiene un fallo crítico", "B) El equipo está operativo pero con una condición menor que requiere atención", "C) El equipo está arrancando su software o realizando un autotest", "D) El equipo está completamente apagado"],
                "respuestaCorrecta": "C",
                "explicacion": "Un parpadeo verde durante el arranque es normal. Si se queda fijo, indica operación correcta. Un parpadeo ámbar o rojo señalaría un problema."
            },
            {
                "pregunta": "¿Qué es un 'PoE' (Power over Ethernet) Switch?",
                "opciones": ["A) Un switch que funciona sin electricidad", "B) Un switch que puede alimentar eléctricamente a dispositivos conectados a él (cámaras IP, teléfonos) a través del propio cable de red", "C) Un switch de color verde", "D) Un switch exclusivo para poesía"],
                "respuestaCorrecta": "B",
                "explicacion": "La tecnología PoE simplifica las instalaciones al eliminar la necesidad de un punto de alimentación eléctrica para cada dispositivo final."
            },
            {
                "pregunta": "El 'enfriamiento' en un centro de datos o sala técnica se realiza a menudo mediante un sistema de:",
                "opciones": ["A) Pasillos de aire frío y pasillos de aire caliente", "B) Sumergir los equipos en aceite", "C) Grandes bloques de hielo", "D) Abrir las puertas en invierno"],
                "respuestaCorrecta": "A",
                "explicacion": "Se ordena la sala para que los equipos tomen aire frío por delante y expulsen el caliente por detrás, optimizando la eficiencia de los climatizadores."
            },
            {
                "pregunta": "La 'documentación de una incidencia' (trouble ticket) debe contener, como mínimo:",
                "opciones": ["A) El nombre del técnico y la hora", "B) Una descripción clara del problema, los equipos afectados, las pruebas realizadas y la solución aplicada", "C) Solo un número de referencia", "D) La predicción meteorológica para ese día"],
                "respuestaCorrecta": "B",
                "explicacion": "Una correcta documentación es vital para crear una base de conocimiento, analizar tendencias de fallos y facilitar la resolución de problemas futuros."
            },
            {
                "pregunta": "¿Qué es una 'sala de Meet-Me' o 'MMR' (Meet-Me Room) en un centro de datos?",
                "opciones": ["A) Una sala de reuniones para el personal", "B) Un espacio físico seguro donde diferentes proveedores de telecomunicaciones interconectan sus redes", "C) El comedor del personal técnico", "D) Un almacén de equipos viejos"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el punto neurálgico de interconexión, donde se realizan los 'cruces' de fibra entre las distintas redes que llegan al edificio."
            },
            {
                "pregunta": "Al crimpar un conector RJ-45 en un cable Ethernet, ¿por qué es importante seguir una norma de cableado como la T568A o T568B?",
                "opciones": ["A) Por razones estéticas, para que los colores se vean ordenados", "B) Para asegurar que los pares de hilos coinciden en ambos extremos, garantizando la comunicación y evitando la diafonía", "C) Es una recomendación, pero no afecta al funcionamiento", "D) Para que el cable sea más resistente"],
                "respuestaCorrecta": "B",
                "explicacion": "Seguir la norma de pines es absolutamente necesario para que el enlace funcione, especialmente a altas velocidades como Gigabit Ethernet."
            },
            {
                "pregunta": "¿Qué significa que un servicio de red tiene una disponibilidad del 'cinco nueves' (99,999%)?",
                "opciones": ["A) Que puede estar caído 99.999% del tiempo", "B) Que solo puede estar interrumpido un máximo de aproximadamente 5 minutos al año", "C) Que el 99% de los clientes están contentos", "D) Que cuesta 99.999 euros"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un estándar de alta disponibilidad para servicios críticos, que exige una fiabilidad y redundancia extremas en todos los componentes de la red."
            },
            {
                "pregunta": "Un 'analizador de protocolos' (como Wireshark) es una herramienta de software que permite:",
                "opciones": ["A) Traducir protocolos de un idioma a otro", "B) Capturar y examinar en detalle cada paquete de datos que circula por una red", "C) Medir la longitud de un cable", "D) Instalar protocolos nuevos en un ordenador"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una herramienta de diagnóstico muy potente para analizar problemas de comunicación, seguridad y rendimiento a nivel de paquete."
            },
            {
                "pregunta": "¿Qué es un 'firewall' (cortafuegos) en una red de telecomunicaciones?",
                "opciones": ["A) Un muro de fuego para proteger los equipos", "B) Un dispositivo o software que filtra el tráfico de red, permitiendo o bloqueando paquetes según reglas de seguridad predefinidas", "C) Un sistema de refrigeración", "D) Un tipo de cable especial"],
                "respuestaCorrecta": "B",
                "explicacion": "Los firewalls son esenciales para proteger las redes contra accesos no autorizados y ataques cibernéticos, actuando como la primera línea de defensa."
            },
            {
                "pregunta": "¿Qué es una PDU (Power Distribution Unit) en un rack de telecomunicaciones?",
                "opciones": ["A) El procesador principal del rack", "B) Un dispositivo de diagnóstico de protocolos", "C) Una regleta de enchufes gestionable que distribuye la energía a los equipos", "D) Una unidad de almacenamiento de datos"],
                "respuestaCorrecta": "C",
                "explicacion": "La PDU toma la alimentación principal del SAI o de la red y la distribuye de forma segura y organizada a los múltiples equipos instalados en el bastidor o rack."
            },
            {
                "pregunta": "Para una conexión de fibra óptica de 20 km entre dos edificios, ¿qué tipo de fibra se debe utilizar?",
                "opciones": ["A) Multimodo (OM3)", "B) Monomodo (OS2)", "C) Cable de par de cobre", "D) Plástica (POF)"],
                "respuestaCorrecta": "B",
                "explicacion": "La fibra monomodo está diseñada para largas distancias debido a su baja atenuación, mientras que la multimodo se usa para enlaces cortos dentro de un mismo edificio."
            },
            {
                "pregunta": "El protocolo NTP (Network Time Protocol) es crítico en una red para:",
                "opciones": ["A) Transferir archivos de gran tamaño", "B) Mantener todos los equipos sincronizados con una hora exacta y coherente", "C) Asignar prioridades al tráfico de vídeo", "D) Proteger la red contra virus"],
                "respuestaCorrecta": "B",
                "explicacion": "Una hora sincronizada es fundamental para poder correlacionar los registros (logs) de diferentes equipos y diagnosticar correctamente las incidencias en la red."
            },
            {
                "pregunta": "¿Cuál es la principal ventaja de utilizar rutas dinámicas (con OSPF) en lugar de rutas estáticas?",
                "opciones": ["A) Son más seguras", "B) Son más fáciles de configurar en redes pequeñas", "C) La red se adapta y redirige el tráfico automáticamente si un enlace falla", "D) Consumen menos CPU en los routers"],
                "respuestaCorrecta": "C",
                "explicacion": "La gran ventaja del enrutamiento dinámico es la resiliencia; la red aprende y se reconfigura sola, mientras que las rutas estáticas deben ser modificadas manualmente por un técnico."
            },
            {
                "pregunta": "En el mantenimiento de un rack, ¿por qué es importante una correcta gestión del cableado (cable management)?",
                "opciones": ["A) Solo por motivos estéticos", "B) Para mejorar el flujo de aire, evitar daños en los cables y facilitar futuras intervenciones", "C) Para que los cables transmitan datos más rápido", "D) Para cumplir una norma sobre colores"],
                "respuestaCorrecta": "B",
                "explicacion": "Un cableado ordenado previene el sobrecalentamiento al no obstruir la ventilación, evita la tensión mecánica en los conectores y ahorra mucho tiempo en la localización de averías."
            },
            {
                "pregunta": "¿Qué es un 'plan de rollback' en el contexto de una intervención de mantenimiento?",
                "opciones": ["A) Un plan para desplegar una nueva versión de software", "B) Un procedimiento detallado para deshacer los cambios y volver al estado anterior si la intervención falla", "C) Un plan de evacuación del edificio", "D) El esquema de cableado de la sala"],
                "respuestaCorrecta": "B",
                "explicacion": "Ninguna intervención crítica debe empezar sin un plan de rollback probado, ya que garantiza que se puede recuperar el servicio rápidamente en caso de problemas."
            },
            {
                "pregunta": "Un sistema de alimentación ininterrumpida (SAI/UPS) online de doble conversión se caracteriza por:",
                "opciones": ["A) Alimentar los equipos desde la batería solo cuando falla la red", "B) Proporcionar siempre energía regenerada desde la batería, aislando completamente los equipos de la red eléctrica", "C) Tener dos baterías por si una falla", "D) Funcionar solo con corriente continua"],
                "respuestaCorrecta": "B",
                "explicacion": "La doble conversión (AC->DC->AC) ofrece la máxima protección, ya que la salida está permanentemente aislada de las perturbaciones de la red de entrada."
            },
            {
                "pregunta": "Sistemas como TACACS+ o RADIUS se implementan en una red para proporcionar:",
                "opciones": ["A) Acceso Wi-Fi a los pasajeros", "B) Un sistema centralizado de Autenticación, Autorización y Auditoría (AAA) para el acceso de los técnicos a los equipos", "C) Un servicio de correo electrónico seguro", "D) La hora oficial de la red"],
                "respuestaCorrecta": "B",
                "explicacion": "AAA permite gestionar los permisos de todos los administradores de red desde un punto central, mejorando drásticamente la seguridad y el control de acceso."
            },
            {
                "pregunta": "¿Qué es una 'VLAN de gestión'?",
                "opciones": ["A) La red Wi-Fi para los gerentes de la empresa", "B) Una red virtual aislada y dedicada exclusivamente al acceso y la gestión de los equipos de red", "C) Una VLAN que se gestiona a sí misma", "D) La VLAN por defecto de un switch"],
                "respuestaCorrecta": "B",
                "explicacion": "Separar el tráfico de gestión del tráfico de datos de usuario es una práctica de seguridad fundamental para proteger la infraestructura de red."
            },
            {
                "pregunta": "En un OTDR, un 'evento reflectivo' con un pico hacia arriba suele corresponder a:",
                "opciones": ["A) Una fusión de fibra", "B) Una macrocurvatura en el cable", "C) Un conector o un corte en la fibra", "D) El final de la fibra sin conector"],
                "respuestaCorrecta": "C",
                "explicacion": "Las conexiones mecánicas (conectores) o las roturas provocan un reflejo de la luz (reflexión de Fresnel) que el OTDR representa como un pico."
            },
            {
                "pregunta": "¿Qué es una 'ventana de mantenimiento'?",
                "opciones": ["A) La ventana física de una sala de equipos", "B) Un período de tiempo planificado, normalmente de noche o en fin de semana, para realizar trabajos que pueden afectar al servicio", "C) Una aplicación de software para mantenimiento", "D) El tiempo que dura la garantía de un equipo"],
                "respuestaCorrecta": "B",
                "explicacion": "Las ventanas de mantenimiento se programan para minimizar el impacto en los usuarios, realizando las tareas más críticas cuando el uso de la red es menor."
            },
            {
                "pregunta": "La dirección MAC de un dispositivo de red es:",
                "opciones": ["A) Una dirección lógica que se puede cambiar fácilmente", "B) Una dirección física única de 48 bits, grabada de fábrica en la tarjeta de red", "C) La dirección postal de la fábrica del equipo", "D) Un código que indica la antigüedad del equipo"],
                "respuestaCorrecta": "B",
                "explicacion": "La dirección MAC (Media Access Control) es el identificador único a nivel de capa 2. Los switches la usan para saber a qué puerto enviar los datos."
            },
            {
                "pregunta": "Un 'firewall de red' funciona principalmente como:",
                "opciones": ["A) Un antivirus para los ordenadores", "B) Una barrera que filtra el tráfico entre redes, permitiendo o bloqueando las comunicaciones según unas reglas de seguridad", "C) Un optimizador de velocidad de la red", "D) Un sistema de copias de seguridad"],
                "respuestaCorrecta": "B",
                "explicacion": "El firewall es el elemento de seguridad perimetral por excelencia, que protege la red interna de posibles amenazas de redes externas."
            },
            {
                "pregunta": "¿Cuál es la función del 'subsuelo técnico' o 'suelo falso' en una sala de comunicaciones?",
                "opciones": ["A) Guardar equipos viejos", "B) Permitir el paso ordenado de cables de datos y de alimentación, así como la canalización de aire frío", "C) Esconder la suciedad", "D) Aislar de las vibraciones del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "El suelo técnico crea una cámara inferior (plenum) que oculta y protege todo el cableado, además de ser una parte integral del sistema de climatización."
            },
            {
                "pregunta": "Si un técnico necesita conectar un portátil al puerto de consola de un router, ¿qué tipo de cable suele necesitar?",
                "opciones": ["A) Un cable de red Ethernet estándar", "B) Un cable de consola (cable rollover, a menudo de color azul claro) con un adaptador USB a serie", "C) Un cable de fibra óptica", "D) Un cable de alimentación"],
                "respuestaCorrecta": "B",
                "explicacion": "El puerto de consola proporciona un acceso directo de bajo nivel al sistema operativo del equipo y requiere un cableado y configuración serie específicos."
            },
            {
                "pregunta": "El término 'provisionar un servicio' en telecomunicaciones se refiere a:",
                "opciones": ["A) Reparar un servicio que ha fallado", "B) El proceso de configurar la red y los equipos para dar de alta un nuevo servicio a un cliente", "C) Facturar el servicio al cliente", "D) Vender un servicio"],
                "respuestaCorrecta": "B",
                "explicacion": "La provisión implica todas las acciones técnicas (configurar VLANs, rutas, calidad de servicio, etc.) necesarias para que un servicio empiece a funcionar."
            },
            {
                "pregunta": "¿Qué es un 'punto de acceso' (AP) en una red Wi-Fi?",
                "opciones": ["A) El router principal de la compañía", "B) El dispositivo que crea la red inalámbrica (SSID) y sirve de puente entre los dispositivos inalámbricos y la red cableada", "C) La antena del teléfono móvil", "D) Un software de seguridad"],
                "respuestaCorrecta": "B",
                "explicacion": "Los APs son los dispositivos que emiten la señal Wi-Fi a la que se conectan los ordenadores portátiles, teléfonos y otros dispositivos."
            },
            {
                "pregunta": "La 'diafonía' (crosstalk) en un cable de par de cobre es:",
                "opciones": ["A) Una conversación entre dos técnicos", "B) La interferencia que la señal de un par de hilos induce en un par adyacente dentro del mismo cable", "C) Un fallo en el software de comunicación", "D) El eco en una llamada de voz"],
                "respuestaCorrecta": "B",
                "explicacion": "El trenzado de los pares en los cables Ethernet está diseñado precisamente para minimizar la diafonía y permitir transmisiones a alta velocidad sin errores."
            },
            {
                "pregunta": "En un sistema de monitorización, ¿qué diferencia hay entre un evento de 'Warning' (amarillo) y uno de 'Critical' (rojo)?",
                "opciones": ["A) Ninguna, ambos son igual de graves", "B) El 'Warning' es una advertencia que no afecta al servicio, mientras que 'Critical' indica un fallo que sí lo interrumpe", "C) El 'Warning' lo resuelve un técnico junior y el 'Critical' uno senior", "D) El 'Warning' es de software y el 'Critical' es de hardware"],
                "respuestaCorrecta": "B",
                "explicacion": "Esta jerarquía de alarmas permite al personal de operación priorizar su trabajo, atendiendo primero los fallos que tienen un impacto real en los usuarios."
            },
            {
                "pregunta": "El comando 'ping' es una herramienta de diagnóstico básica que sirve para:",
                "opciones": ["A) Medir el ancho de banda de una red", "B) Comprobar la conectividad y medir el tiempo de respuesta (latencia) con otro equipo en la red", "C) Ver las páginas web visitadas", "D) Reiniciar un equipo de forma remota"],
                "respuestaCorrecta": "B",
                "explicacion": "El 'ping' envía un pequeño paquete de datos (ICMP) y espera una respuesta, siendo el primer paso para determinar si un equipo es accesible a través de la red."
            },
            {
                "pregunta": "La 'topología física' de una red se refiere a:",
                "opciones": ["A) Cómo fluyen los datos lógicamente", "B) La disposición real de los cables, equipos y la ubicación física de los componentes", "C) La velocidad de la red", "D) El tipo de datos que se transmiten"],
                "respuestaCorrecta": "B",
                "explicacion": "La topología física es el mapa real de la infraestructura (ej. topología en estrella, en anillo o en bus), en contraposición a la topología lógica, que describe cómo se comunican los datos."
            },
            {
                "pregunta": "Un 'Certificador de red' para cableado Ethernet es un equipo que:",
                "opciones": ["A) Imprime un certificado de que la red es segura", "B) Realiza una serie de pruebas exhaustivas (longitud, atenuación, diafonía) para garantizar que un cable cumple con los estándares de una categoría (ej. Cat 6A)", "C) Solo comprueba que los hilos están conectados", "D) Mide el consumo eléctrico de la red"],
                "respuestaCorrecta": "B",
                "explicacion": "A diferencia de un simple 'tester', un certificador garantiza que el enlace de cableado soportará las velocidades para las que ha sido diseñado, siendo una prueba indispensable en instalaciones profesionales."
            },
            {
                "pregunta": "¿Por qué se utiliza -48V DC como estándar de alimentación en telecomunicaciones?",
                "opciones": ["A) Porque es el voltaje que dan las pilas comunes", "B) Por seguridad (es un voltaje no peligroso) y porque reduce la corrosión galvánica en los cables en caso de humedad", "C) Porque permite usar cables más finos", "D) Es una elección arbitraria sin motivo técnico"],
                "respuestaCorrecta": "B",
                "explicacion": "La tensión negativa con positivo a tierra es un estándar histórico que ha demostrado ser muy fiable y seguro para los equipos y el personal."
            },
            {
                "pregunta": "Cuando un equipo de red se describe como 'rugerizado' (rugged), significa que:",
                "opciones": ["A) Tiene un software muy complejo", "B) Está diseñado para soportar condiciones ambientales adversas (temperatura, vibración, humedad)", "C) Es muy barato", "D) Es un modelo muy antiguo"],
                "respuestaCorrecta": "B",
                "explicacion": "Los equipos rugerizados se instalan en entornos no controlados, como armarios de exterior o junto a la vía, donde la electrónica estándar no sobreviviría."
            },
            {
                "pregunta": "¿Qué es la 'zona desmilitarizada' (DMZ) en una arquitectura de red?",
                "opciones": ["A) Un área donde no hay personal militar", "B) Una red perimetral que aísla los servidores que necesitan acceso desde Internet (ej. web) de la red interna segura", "C) La red Wi-Fi de invitados", "D) Un almacén de equipos dados de baja"],
                "respuestaCorrecta": "B",
                "explicacion": "La DMZ actúa como una zona de contención. Si un servidor en la DMZ es comprometido, el atacante no tiene acceso directo a la red corporativa interna."
            },
            {
                "pregunta": "Una 'Jumper' en un repartidor de pares de cobre (MDF) es:",
                "opciones": ["A) Una herramienta para saltar de un rack a otro", "B) El cable de par de cobre que conecta físicamente el puerto de un equipo con la línea exterior de un abonado", "C) Un tipo de fusible", "D) Un software de diagnóstico"],
                "respuestaCorrecta": "B",
                "explicacion": "El 'jumpeado' es la acción de realizar estas conexiones cruzadas en el repartidor, que es el corazón físico de las redes basadas en cobre."
            },
            {
                "pregunta": "El comando 'traceroute' (o 'tracert') se utiliza para:",
                "opciones": ["A) Dibujar un mapa de la red", "B) Descubrir la ruta (los saltos o routers intermedios) que siguen los paquetes de datos hasta un destino", "C) Medir la temperatura de un router", "D) Borrar la ruta de un paquete"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una herramienta de diagnóstico fundamental para localizar en qué punto de la red se está perdiendo la conectividad o dónde se está introduciendo una alta latencia."
            },
            {
                "pregunta": "¿Qué es un 'enlace troncal' (trunk link) entre dos switches?",
                "opciones": ["A) Un enlace que solo transporta datos de una VLAN", "B) Un enlace de alta velocidad que está configurado para transportar el tráfico de múltiples VLANs a la vez", "C) Un enlace de respaldo que solo se usa si falla el principal", "D) El cable de alimentación de los switches"],
                "respuestaCorrecta": "B",
                "explicacion": "Los enlaces troncales son las 'autopistas' que interconectan los switches, utilizando un etiquetado especial (protocolo 802.1Q) para identificar a qué VLAN pertenece cada paquete."
            },
            {
                "pregunta": "La 'Gestión del Cambio' (Change Management) en un entorno de TI es un proceso para:",
                "opciones": ["A) Cambiar de puesto a los técnicos", "B) Asegurar que los cambios en la red se realizan de forma controlada, minimizando el riesgo y el impacto en el servicio", "C) Cambiar las contraseñas cada mes", "D) Renovar los equipos cada año"],
                "respuestaCorrecta": "B",
                "explicacion": "Implica planificar, aprobar, comunicar, ejecutar y revisar cualquier modificación en la infraestructura para evitar introducir nuevos problemas."
            },
            {
                "pregunta": "Si al medir un latiguillo de fibra con un medidor de potencia se obtiene una pérdida de 1.5 dB, ¿qué indica este valor?",
                "opciones": ["A) Que el latiguillo está en perfectas condiciones", "B) Que el valor es inaceptablemente alto y el latiguillo o sus conectores están sucios o dañados", "C) Que la potencia es demasiado alta", "D) Que la medida es errónea, la pérdida no puede ser tan alta"],
                "respuestaCorrecta": "B",
                "explicacion": "Una pérdida normal en un latiguillo con dos conectores limpios debería ser inferior a 0.5 dB. Un valor de 1.5 dB indica un problema claro que debe ser solucionado."
            },
            {
                "pregunta": "La 'fibra óptica' es el medio de transmisión principal en alta velocidad por su gran ancho de banda y por ser inmune a:",
                "opciones": ["A) La lluvia", "B) Las interferencias electromagnéticas", "C) Los terremotos", "D) Las altas temperaturas"],
                "respuestaCorrecta": "B",
                "explicacion": "Al transmitir datos mediante pulsos de luz, la fibra óptica es inmune al 'ruido' eléctrico generado por la catenaria y los motores, garantizando una comunicación fiable."
            },
            {
                "pregunta": "¿Qué es el sistema 'GSM-R'?",
                "opciones": ["A) Un sistema de GPS mejorado para trenes", "B) Un estándar de telefonía móvil global para pasajeros", "C) Un sistema de comunicaciones móviles profesional para el ferrocarril", "D) Un radar para detectar obstáculos"],
                "respuestaCorrecta": "C",
                "explicacion": "GSM-R (Railway) es el estándar europeo para la comunicación por voz (maquinista-control) y datos (ERTMS Nivel 2) en el entorno ferroviario."
            },
            {
                "pregunta": "En la infraestructura de comunicaciones, ¿qué es una 'arqueta'?",
                "opciones": ["A) Un pequeño arquitecto", "B) Una cámara de registro subterránea que da acceso a las canalizaciones de cables", "C) La base de una torre de comunicaciones", "D) Un tipo de conector de fibra"],
                "respuestaCorrecta": "B",
                "explicacion": "Las arquetas son puntos de acceso esenciales para instalar, empalmar y mantener los cables de fibra óptica y de energía que discurren bajo tierra."
            },
            {
                "pregunta": "Una 'BTS' (Base Transceiver Station) en la red GSM-R es, en esencia:",
                "opciones": ["A) Un billete de tren especial", "B) El teléfono del maquinista", "C) La antena y el equipo de radio que da cobertura a un tramo de vía", "D) El centro de control de comunicaciones"],
                "respuestaCorrecta": "C",
                "explicacion": "La BTS, o 'estación base', es el equivalente a la antena de telefonía móvil de nuestro día a día, pero dedicada exclusivamente a la red ferroviaria."
            },
            {
                "pregunta": "Un 'torpedo' o 'caja de empalme' de fibra óptica sirve para:",
                "opciones": ["A) Lanzar cables a larga distancia", "B) Alojar y proteger las fusiones (empalmes) entre diferentes cables de fibra", "C) Conectar un router a la red", "D) Medir la potencia de la señal óptica"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un cierre hermético que protege las delicadas fusiones de fibra de la humedad y los esfuerzos mecánicos, normalmente ubicado dentro de las arquetas."
            },
            {
                "pregunta": "La 'segregación de redes' en el ferrocarril consiste en:",
                "opciones": ["A) Separar a los pasajeros por tipo de billete", "B) Utilizar redes físicas o lógicas diferentes para servicios críticos (señalización) y no críticos (ofimática)", "C) Poner vallas para separar las vías", "D) Usar diferentes marcas de cables"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un principio de ciberseguridad y fiabilidad. La red de señalización debe estar completamente aislada para garantizar su integridad y disponibilidad."
            },
            {
                "pregunta": "Una 'topología en anillo' para la red de fibra óptica se usa para:",
                "opciones": ["A) Ahorrar cable", "B) Crear un círculo decorativo", "C) Proporcionar redundancia: si el anillo se corta en un punto, la comunicación sigue fluyendo por el otro lado", "D) Facilitar la conexión de nuevos puntos"],
                "respuestaCorrecta": "C",
                "explicacion": "Los anillos de fibra son fundamentales para la alta disponibilidad. Permiten que la red se 'autocure' ante un corte de cable, manteniendo los servicios activos."
            },
            {
                "pregunta": "En una red de datos, un 'router' tiene la función principal de:",
                "opciones": ["A) Dar cobertura Wi-Fi", "B) Interconectar diferentes redes y dirigir los paquetes de datos a su destino correcto", "C) Empalmar fibras ópticas", "D) Alimentar de energía a otros equipos"],
                "respuestaCorrecta": "B",
                "explicacion": "El router es el 'director de tráfico' de las redes IP, tomando decisiones sobre la mejor ruta para enviar la información entre distintos segmentos de red."
            },
            {
                "pregunta": "¿Qué son las 'canalizaciones' en el contexto de la infraestructura ferroviaria?",
                "opciones": ["A) Canales de televisión para trenes", "B) Los tubos y conductos, normalmente de hormigón o PVC, por donde discurren los cables bajo tierra", "C) Canales para el drenaje de agua", "D) El proceso de instalar un canal"],
                "respuestaCorrecta": "B",
                "explicacion": "Son las 'tuberías' que protegen los cables de fibra y energía a lo largo de la traza ferroviaria."
            },
            {
                "pregunta": "Una 'llamada de grupo' es una funcionalidad clave de GSM-R que permite:",
                "opciones": ["A) Que un grupo de amigos hable a la vez", "B) Al centro de control comunicarse simultáneamente con todos los trenes de una zona", "C) Reservar billetes para un grupo", "D) Crear un grupo de WhatsApp de maquinistas"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite difundir información importante (ej. meteorología adversa, incidencias) a múltiples trenes de forma instantánea, como si fuera un walkie-talkie avanzado."
            },
            {
                "pregunta": "Un 'radioenlace' (o enlace por microondas) se utiliza en comunicaciones ferroviarias como:",
                "opciones": ["A) El sistema principal de comunicación", "B) Un sistema de respaldo (backup) o para llegar a zonas donde no se puede tender fibra", "C) Una radio para escuchar música", "D) Un enlace para la venta de billetes"],
                "respuestaCorrecta": "B",
                "explicacion": "Mediante antenas parabólicas, los radioenlaces ofrecen conexiones de alta capacidad y son una solución excelente para salvar valles u obstáculos."
            },
            {
                "pregunta": "La 'fusión de fibra óptica' es el proceso de:",
                "opciones": ["A) Derretir la fibra para reciclarla", "B) Unir dos hilos de fibra mediante un arco eléctrico que los funde, creando una conexión casi perfecta", "C) Pegar dos fibras con un pegamento especial", "D) Trenzar las fibras"],
                "respuestaCorrecta": "B",
                "explicacion": "Una fusionadora de fibra alinea los núcleos de las fibras (de 9 micras) y los suelda, consiguiendo una pérdida de señal mínima en el empalme."
            },
            {
                "pregunta": "Un 'switch' o conmutador de red en una caseta técnica sirve para:",
                "opciones": ["A) Encender y apagar las luces", "B) Interconectar múltiples equipos (cámaras, sensores, etc.) dentro de una misma red local (LAN)", "C) Cambiar la ruta de los trenes", "D) Conmutar la corriente eléctrica"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el punto central que conecta todos los dispositivos de una red local, permitiendo que se comuniquen entre sí."
            },
            {
                "pregunta": "¿Por qué las torres de telecomunicaciones se sitúan a una distancia regular a lo largo de la vía?",
                "opciones": ["A) Por estética", "B) Para asegurar una cobertura continua de GSM-R, sin 'sombras' o zonas sin señal", "C) Para que sirvan de puntos kilométricos", "D) Es una coincidencia"],
                "respuestaCorrecta": "B",
                "explicacion": "El diseño de la red GSM-R se basa en crear células de cobertura solapadas para que el tren nunca pierda la comunicación con la red."
            },
            {
                "pregunta": "Las 'casetas técnicas' o 'shelters' a lo largo de la línea albergan:",
                "opciones": ["A) Material de limpieza", "B) Los equipos de energía, señalización y telecomunicaciones", "C) Una zona de descanso para operarios", "D) Repuestos para los trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "Son salas seguras y climatizadas que protegen los equipos electrónicos críticos del entorno exterior."
            },
            {
                "pregunta": "¿Qué es una 'VLAN' (Virtual LAN)?",
                "opciones": ["A) Un tipo de cable de red", "B) Un método para crear múltiples redes lógicas independientes sobre una misma infraestructura de red física", "C) La red Wi-Fi de los pasajeros", "D) Una red de realidad virtual"],
                "respuestaCorrecta": "B",
                "explicacion": "Las VLANs son una forma de 'segregación lógica'. Permiten, por ejemplo, que el tráfico de videovigilancia y el de señalización usen los mismos switches sin interferir entre sí."
            },
            {
                "pregunta": "La 'telefonía de explotación' o 'telefonía de emergencia' en postes SOS se conecta a través de:",
                "opciones": ["A) La red de telefonía pública normal", "B) La red de comunicaciones de fibra óptica del ferrocarril", "C) Satélite", "D) Señales de humo"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos teléfonos utilizan la red IP propia del ferrocarril para establecer una comunicación directa y prioritaria con el centro de control."
            },
            {
                "pregunta": "Un 'NMS' (Network Management System) es un software que permite:",
                "opciones": ["A) Navegar por internet", "B) Monitorizar en tiempo real el estado de toda la red de comunicaciones y sus equipos", "C) Diseñar nuevas redes", "D) Gestionar el personal de mantenimiento"],
                "respuestaCorrecta": "B",
                "explicacion": "Desde el NMS, los operadores pueden ver alarmas, el rendimiento de los equipos y diagnosticar problemas en la red de forma centralizada."
            },
            {
                "pregunta": "¿Qué es un 'SAI' (Sistema de Alimentación Ininterrumpida) o UPS?",
                "opciones": ["A) Un sistema de ahorro de energía", "B) Un sistema de baterías que mantiene los equipos de comunicaciones funcionando si falla la red eléctrica", "C) Un tipo de panel solar", "D) El enchufe principal"],
                "respuestaCorrecta": "B",
                "explicacion": "Es vital para la fiabilidad. Un SAI proporciona autonomía durante los cortes de luz, asegurando que los sistemas críticos como la señalización no se apaguen."
            },
            {
                "pregunta": "Un cable de fibra óptica se identifica por su 'designación', que indica el número de fibras que contiene (ej. 12, 24, 48...).",
                "opciones": ["A) Verdadero", "B) Falso"],
                "respuestaCorrecta": "A",
                "explicacion": "La designación del cable es fundamental para saber su capacidad. En líneas principales se usan cables con un alto número de fibras para cubrir todos los servicios."
            },
            {
                "pregunta": "El 'cable de tierra' que a menudo acompaña a la fibra en las canalizaciones sirve para:",
                "opciones": ["A) Detectar la posición del cable con un localizador", "B) Dar rigidez al conjunto de cables", "C) Conectar a tierra todos los equipos", "D) Es un cable de repuesto"],
                "respuestaCorrecta": "A",
                "explicacion": "Al ser la fibra dieléctrica (no conduce), se suele tender junto a ella un cable de cobre que permite a los operarios localizar la traza exacta de la canalización desde la superficie."
            },
            {
                "pregunta": "El 'OTDR' (Reflectómetro Óptico en el Dominio del Tiempo) es un equipo que:",
                "opciones": ["A) Mide el tiempo que tarda el tren en llegar", "B) Lanza pulsos de luz en una fibra para medir su longitud, atenuación y localizar averías", "C) Es un tipo de radar", "D) Traduce el código óptico"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la herramienta de diagnóstico más importante para la fibra óptica, permitiendo 'ver' la línea y localizar con precisión un corte o un empalme defectuoso."
            },
            {
                "pregunta": "El protocolo 'IP' (Internet Protocol) en el ferrocarril se usa para:",
                "opciones": ["A) Limpiar los trenes", "B) Dar una dirección única a cada equipo (cámara, teléfono, servidor) para que puedan comunicarse", "C) Identificar a los pasajeros", "D) Medir la presión de las ruedas"],
                "respuestaCorrecta": "B",
                "explicacion": "La gran mayoría de sistemas modernos (vídeo, voz, datos) utilizan redes IP, donde cada dispositivo tiene una dirección IP para ser localizado."
            },
            {
                "pregunta": "¿Qué es un 'cortafuegos' o 'firewall' en la red ferroviaria?",
                "opciones": ["A) Una puerta que resiste al fuego", "B) Un dispositivo de seguridad que controla el tráfico entre redes, bloqueando accesos no autorizados", "C) Un operario que apaga incendios", "D) Un tipo de antivirus"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un elemento clave de la ciberseguridad, que se sitúa en el perímetro de las redes para proteger los sistemas internos de ataques externos."
            },
            {
                "pregunta": "La 'latencia' en una red de comunicaciones es:",
                "opciones": ["A) La cantidad de datos que se pueden enviar", "B) La potencia de la señal", "C) El tiempo que tarda un paquete de datos en ir de un punto a otro", "D) El número de errores en la red"],
                "respuestaCorrecta": "C",
                "explicacion": "Para sistemas en tiempo real como la señalización, es crucial tener una latencia muy baja y predecible."
            },
            {
                "pregunta": "El 'ancho de banda' de una red se refiere a:",
                "opciones": ["A) El ancho físico del cable", "B) La cantidad máxima de datos que se pueden transmitir en un período de tiempo", "C) La distancia que cubre la red", "D) El número de usuarios conectados"],
                "respuestaCorrecta": "B",
                "explicacion": "La fibra óptica se elige por su enorme ancho de banda, capaz de soportar simultáneamente los datos de señalización, vídeo, voz y muchos otros servicios."
            },
            {
                "pregunta": "El 'Centro de Control de Comunicaciones' se encarga de:",
                "opciones": ["A) Atender las llamadas de los pasajeros", "B) Gestionar y supervisar el estado de las redes de fibra, GSM-R y datos", "C) Reparar los teléfonos móviles", "D) Escribir los comunicados de prensa"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el núcleo de la operación de las telecomunicaciones, desde donde se gestionan las incidencias y se mantiene la salud de la red."
            },
            {
                "pregunta": "La 'numeración funcional' en GSM-R permite al maquinista llamar:",
                "opciones": ["A) A un número de teléfono normal", "B) A una función (ej. 'Controlador de Tráfico') sin necesidad de saber quién es la persona", "C) Solo a números de emergencias", "D) A su familia"],
                "respuestaCorrecta": "B",
                "explicacion": "El maquinista marca la función, y la red encamina la llamada a la persona que esté desempeñando ese rol en ese momento, lo que es muy práctico y eficiente."
            },
            {
                "pregunta": "Un 'patch panel' o 'panel de parcheo' en un armario de comunicaciones sirve para:",
                "opciones": ["A) Poner parches a los cables rotos", "B) Organizar y conectar de forma ordenada los cables de la red", "C) Enfriar los equipos", "D) Proteger contra subidas de tensión"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un panel con muchos conectores que permite una gestión limpia y flexible del cableado, facilitando las conexiones y los cambios."
            },
            {
                "pregunta": "¿Qué es la 'redundancia geográfica' en un centro de control?",
                "opciones": ["A) Tener mapas de diferentes zonas geográficas", "B) Tener un centro de control de respaldo en otra ubicación física", "C) Que el centro de control esté en una montaña", "D) Tener varios operadores de la misma región"],
                "respuestaCorrecta": "B",
                "explicacion": "Para garantizar la continuidad del servicio ante un desastre mayor (incendio, inundación), se dispone de un centro gemelo en otra ciudad que puede tomar el control."
            }
        ],
        "Instalaciones de Seguridad": [
            {
                "pregunta": "¿Qué es un 'enclavamiento'?",
                "opciones": ["A) Un tipo de candado para las vías", "B) El sistema hardware y software que impide movimientos de trenes o desvíos que puedan ser peligrosos", "C) La acción de unir dos trenes", "D) El edificio donde trabajan los controladores"],
                "respuestaCorrecta": "B",
                "explicacion": "El enclavamiento es el corazón de la seguridad. Garantiza, por ejemplo, que un desvío no se mueva bajo un tren o que una señal no dé vía libre hacia una vía ocupada."
            },
            {
                "pregunta": "Según el principio de 'seguridad intrínseca' o 'fail-safe', ¿qué sucede si un relé de ocupación de un circuito de vía deja de recibir tensión por un fusible fundido?",
                "opciones": ["A) El sistema interpreta que el circuito de vía está libre", "B) El relé 'cae' por gravedad y el sistema interpreta que el circuito de vía está ocupado", "C) Se envía un aviso al maquinista pero la señal sigue en verde", "D) El sistema se reinicia automáticamente"],
                "respuestaCorrecta": "B",
                "explicacion": "El diseño 'fail-safe' asegura que, ante un fallo como la pérdida de alimentación, el sistema deriva a su estado más restrictivo y seguro, que es considerar el tramo como ocupado."
            },
            {
                "pregunta": "En un enclavamiento eléctrico, ¿qué función cumple la 'protección de flanco'?",
                "opciones": ["A) Proteger el lateral del tren de golpes", "B) Asegurar que ningún tren pueda invadir una ruta establecida desde un desvío lateral, enclavando la aguja de dicho desvío en posición contraria", "C) Proteger los equipos de subidas de tensión", "D) Es un sistema de seguridad para los operarios que trabajan en el flanco de la vía"],
                "respuestaCorrecta": "B",
                "explicacion": "La protección de flanco es una función de seguridad vital que evita colisiones laterales, garantizando que todas las agujas que dan acceso a una ruta queden inmovilizadas en una posición segura."
            },
            {
                "pregunta": "La arquitectura de un enclavamiento electrónico de alta disponibilidad '2 de 3' (2oo3) se caracteriza por:",
                "opciones": ["A) Tener dos procesadores y si uno falla, el sistema se detiene", "B) Tener tres procesadores que 'votan'; si uno falla, los otros dos lo desconectan y el sistema sigue operando", "C) Usar un procesador activo y dos en reserva (stand-by)", "D) Necesitar tres operarios para su manejo"],
                "respuestaCorrecta": "B",
                "explicacion": "El sistema 2 de 3 ofrece una alta disponibilidad. Al comparar permanentemente la salida de los tres canales, puede identificar y aislar un canal defectuoso sin interrumpir el servicio."
            },
            {
                "pregunta": "¿Cuál es la principal diferencia entre un bloqueo 'descentralizado' y uno 'centralizado'?",
                "opciones": ["A) El descentralizado usa más cables", "B) En el descentralizado, la lógica de cada señal está en un armario junto a ella; en el centralizado, la lógica de un tramo se concentra en los enclavamientos de las estaciones colaterales", "C) El descentralizado es más moderno", "D) No hay diferencias funcionales"],
                "respuestaCorrecta": "B",
                "explicacion": "Los bloqueos centralizados son una evolución para concentrar los equipos en las estaciones, facilitando el mantenimiento y protegiéndolos de actos vandálicos."
            },
            {
                "pregunta": "¿Qué es un 'diferímetro' en un enclavamiento?",
                "opciones": ["A) Un aparato que mide diferencias de tensión", "B) Un temporizador que retrasa el desenclavado de una ruta si una señal ha sido rebasada o si se cancela con un tren en aproximación", "C) Un relé especial para desvíos", "D) Un detector de velocidad de trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "El diferímetro es un elemento de seguridad que garantiza que, aunque se anule una ruta, los elementos (agujas) permanezcan bloqueados un tiempo por si el maquinista ya ha visto un aspecto permisivo y no puede detenerse a tiempo."
            },
            {
                "pregunta": "En un paso a nivel de Semibarreras Automáticas (S.B.A.), ¿qué elemento inicia el proceso de cierre al aproximarse un tren?",
                "opciones": ["A) El maquinista pulsando un botón", "B) El operador del CTC", "C) Los pedales direccionales de aviso de proximidad de tren", "D) La ocupación del circuito de vía de la estación más cercana"],
                "respuestaCorrecta": "C",
                "explicacion": "Las S.B.A. funcionan de forma autónoma. Los pedales de aviso, situados a la distancia necesaria, detectan el paso del tren y desencadenan la secuencia de protección del paso."
            },
            {
                "pregunta": "En un paso a nivel de Semibarreras Enclavadas (S.B.E.), el cierre y la apertura están regulados por:",
                "opciones": ["A) El enclavamiento de la estación, como parte de la formación de una ruta", "B) Un operario con un mando local", "C) Un temporizador que se activa a una hora fija", "D) Los propios trenes de forma automática"],
                "respuestaCorrecta": "A",
                "explicacion": "A diferencia de las S.B.A., las S.B.E. no son autónomas y su protección es una condición indispensable que el enclavamiento debe verificar antes de autorizar una ruta que afecte al paso."
            },
            {
                "pregunta": "El mnemónico 'RCLA' en los planos de un enclavamiento eléctrico se refiere a:",
                "opciones": ["A) Relé de Circuito de Larga Aceptación", "B) Relé de Comprobación de Lámpara Amarilla", "C) Ruta Central Larga Autorizada", "D) Repetidor de Cierre de Lámpara Auxiliar"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el relé encargado de verificar que la lámpara amarilla de una señal está luciendo correctamente, como parte de la cadena de seguridad."
            },
            {
                "pregunta": "¿Qué indica el 'Aspa de San Andrés' (aspa amarilla a destellos) en una señal de paso a nivel para el maquinista?",
                "opciones": ["A) Que el paso a nivel está protegido y puede pasar a velocidad normal", "B) Que el paso a nivel está desprotegido o averiado, debiendo tomar precauciones", "C) Que debe detener el tren inmediatamente", "D) Que el tren siguiente viene muy cerca"],
                "respuestaCorrecta": "B",
                "explicacion": "El aspa amarilla a destellos es la señal de alarma grave que informa al maquinista de que el paso a nivel no funciona correctamente y debe actuar con la máxima precaución."
            },
            {
                "pregunta": "¿Qué es el 'shunt límite' de un circuito de vía?",
                "opciones": ["A) La máxima velocidad a la que un tren puede pasar", "B) El máximo valor de resistencia eléctrica del eje de un tren que garantiza la detección (ocupación)", "C) El límite de balasto que puede tener la vía", "D) La tensión mínima para que funcione el relé"],
                "respuestaCorrecta": "B",
                "explicacion": "Un shunt límite alto es más seguro (detecta ejes con mal contacto), pero más inestable (puede ocuparse por humedad en el balasto). Se busca un equilibrio entre seguridad y disponibilidad."
            },
            {
                "pregunta": "En los circuitos de vía de 50 Hz, ¿por qué los circuitos adyacentes deben trabajar en 'oposición de fase' (desfasados 180°)?",
                "opciones": ["A) Para ahorrar energía", "B) Es una medida de seguridad para que, si falla una junta aislante, no pueda llegar tensión de un circuito al relé del circuito contiguo", "C) Para que los trenes circulen más rápido", "D) Para facilitar la localización de averías"],
                "respuestaCorrecta": "B",
                "explicacion": "Si una junta se perfora, la tensión de un circuito anularía a la del otro en el receptor, provocando la caída segura del relé y evitando una falsa indicación de 'vía libre'."
            },
            {
                "pregunta": "Un sistema de detección por 'Contadores de Ejes' determina que un cantón está libre cuando:",
                "opciones": ["A) Un temporizador llega a cero", "B) El número de ejes que han entrado en el cantón es exactamente igual al número de ejes que han salido", "C) El maquinista avisa por radio", "D) El circuito de vía está en verde"],
                "respuestaCorrecta": "B",
                "explicacion": "El sistema se basa en un principio simple de contabilidad: si la cuenta de ejes no es cero, asume que queda un vehículo en el interior del cantón."
            },
            {
                "pregunta": "En un enclavamiento electrónico Westrace, la prueba de desconexión del OPCR se realiza para:",
                "opciones": ["A) Comprobar el funcionamiento de la fuente de alimentación", "B) Observar si lucen correctamente las lámparas testigo de posición del relé", "C) Medir la tensión de rizado", "D) Actualizar el software del enclavamiento"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una prueba de mantenimiento preventivo para verificar la correcta indicación visual del estado de los relés, un elemento clave para el diagnóstico de averías."
            },
            {
                "pregunta": "¿Qué es la 'búsqueda dicotómica' durante la localización de una avería en una cadena de relés?",
                "opciones": ["A) Preguntar a dos técnicos distintos", "B) Ir comprobando la tensión en el punto medio de la cadena sospechosa para descartar la mitad del circuito en cada paso", "C) Revisar los relés de dos en dos", "D) Usar un diccionario técnico"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una técnica sistemática y eficiente para acotar rápidamente el punto exacto de una interrupción en un circuito eléctrico serie."
            },
            {
                "pregunta": "Un sistema detector de obstáculos en un paso a nivel tipo DOCAVA utiliza:",
                "opciones": ["A) Un lazo magnético bajo el asfalto", "B) Sensores de infrarrojos", "C) Cámaras de visión artificial y procesado de imagen", "D) Un operario que vigila el cruce"],
                "respuestaCorrecta": "C",
                "explicacion": "El sistema DOCAVA (Detección de Obstáculos mediante Cámaras de Visión Artificial) analiza las imágenes de vídeo para detectar vehículos o personas detenidas en la zona de peligro."
            },
            {
                "pregunta": "En un Bloqueo Automático en Vía Doble (BAD), si la señal de un cantón está en rojo, la señal del cantón anterior estará en:",
                "opciones": ["A) Verde (Vía Libre)", "B) Rojo (Parada)", "C) Amarillo (Anuncio de Parada)", "D) Apagada"],
                "respuestaCorrecta": "C",
                "explicacion": "El sistema de bloqueo automático garantiza la distancia de frenado informando con antelación. La luz amarilla advierte al maquinista que la siguiente señal que encontrará está en rojo."
            },
            {
                "pregunta": "El 'fusible mecánico' de la pluma de una semibarrera sirve para:",
                "opciones": ["A) Proteger el circuito eléctrico de sobrecargas", "B) Que la pluma se parta de forma controlada si un vehículo la golpea, evitando daños mayores en el accionamiento", "C) Bloquear la barrera en posición cerrada", "D) Conectar la alimentación del motor"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un punto de rotura diseñado para que, en caso de impacto, el fusible (un tornillo de latón) se rompa y la pluma bascule, minimizando los daños."
            },
            {
                "pregunta": "La funcionalidad del sistema ASFA se basa en la transmisión de información a través de:",
                "opciones": ["A) Un cable de fibra óptica", "B) La catenaria", "C) Un sistema de radio GSM-R", "D) Balizas situadas en la vía que son 'leídas' por un captador en el tren"],
                "respuestaCorrecta": "D",
                "explicacion": "El ASFA es un sistema de transmisión puntual. La información del estado de la señal se carga en una baliza y el tren la recoge al pasar sobre ella."
            },
            {
                "pregunta": "En un enclavamiento geográfico, el mantenimiento se simplifica porque:",
                "opciones": ["A) Utiliza menos relés que uno de cableado libre", "B) La lógica está encapsulada en módulos o grupos estandarizados que se pueden sustituir fácilmente", "C) No necesita alimentación eléctrica", "D) Se repara solo"],
                "respuestaCorrecta": "B",
                "explicacion": "La arquitectura modular tipo 'caja negra' permite que, ante una avería interna, el técnico pueda sustituir un grupo completo sin necesidad de analizar el circuito relé a relé."
            },
            {
                "pregunta": "En el sistema de bloqueo telefónico, la seguridad para evitar la circulación de dos trenes en el mismo cantón se basa en:",
                "opciones": ["A) Un complejo sistema de relés", "B) La comunicación verbal y el registro en un libro de telefonemas entre los jefes de circulación de las estaciones colaterales", "C) La detección automática por circuitos de vía", "D) El uso de un único testigo (bastón) para todo el tramo"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el sistema de bloqueo más elemental, donde la seguridad depende enteramente del cumplimiento estricto del procedimiento por parte del personal de circulación."
            },
            {
                "pregunta": "¿Qué es el Registrador Jurídico o JRU en un sistema ERTMS?",
                "opciones": ["A) Un sistema que graba las conversaciones del maquinista", "B) Una 'caja negra' que registra de forma segura toda la información relevante del movimiento del tren y las acciones del maquinista", "C) El libro de reclamaciones del tren", "D) Un abogado especialista en temas ferroviarios"],
                "respuestaCorrecta": "B",
                "explicacion": "El JRU es un elemento de seguridad fundamental que proporciona pruebas objetivas sobre las causas de un accidente o incidencia al registrar todos los datos y comandos."
            },
            {
                "pregunta": "Un sistema de protección de paso a nivel S.L.A. (Señalización Luminosa y Acústica) se diferencia de un S.B.A. en que:",
                "opciones": ["A) El S.L.A. no tiene señales luminosas", "B) El S.L.A. no dispone de semibarreras físicas", "C) El S.L.A. es de accionamiento manual", "D) El S.L.A. no tiene avisador acústico"],
                "respuestaCorrecta": "B",
                "explicacion": "El S.L.A. protege el paso únicamente con señales luminosas y acústicas, sin la barrera física que sí tienen los sistemas S.B.A. (Semibarreras Automáticas)."
            },
            {
                "pregunta": "¿Qué permite un 'bloqueo automático banalizado' (BAB) en una línea de vía doble?",
                "opciones": ["A) Que los trenes puedan circular en ambos sentidos por cualquiera de las dos vías", "B) Que solo puedan circular trenes de mercancías", "C) Que las vías no necesiten balasto", "D) Que el bloqueo funcione sin señales"],
                "respuestaCorrecta": "A",
                "explicacion": "La banalización dota a la línea de una gran flexibilidad operativa, ya que ambas vías están equipadas con señalización para circular en los dos sentidos, como si fueran dos vías únicas paralelas."
            },
            {
                "pregunta": "¿Qué es una 'junta inductiva'?",
                "opciones": ["A) Una reunión de ingenieros inductivos", "B) Una junta de carril que aísla de la corriente alterna del circuito de vía pero permite el paso de la corriente continua de tracción", "C) Un tipo de soldadura especial", "D) El punto de unión entre dos traviesas"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un filtro que permite compatibilizar la necesidad de seccionar la vía para los circuitos de señalización con la necesidad de continuidad para el retorno de la corriente de tracción."
            },
            {
                "pregunta": "La función 'Cierre por cola' en una línea de telemando punto a punto sirve para:",
                "opciones": ["A) Asegurar que el último tren del día llega a su destino", "B) En caso de avería de un módulo, permitir que la comunicación siga funcionando con los módulos que se encuentran antes del punto de fallo", "C) Cerrar la comunicación al final del día", "D) Permitir que la comunicación siga funcionando en los módulos posteriores a un fallo si se dispone de una segunda línea"],
                "respuestaCorrecta": "D",
                "explicacion": "Es un sistema de redundancia. Si la línea principal se corta, los módulos posteriores al fallo pueden seguir comunicándose con el puesto central a través de la línea de respaldo o 'cola'."
            },
            {
                "pregunta": "En un sistema ATP como EBICAB 900, las balizas pueden ser 'controladas' o 'no controladas'. La diferencia es que:",
                "opciones": ["A) Las no controladas no necesitan mantenimiento", "B) Las controladas pueden variar la información que transmiten según el estado de las señales, mientras que las no controladas siempre envían la misma información", "C) Las controladas son para alta velocidad y las no controladas para convencional", "D) Las no controladas no están conectadas al carril"],
                "respuestaCorrecta": "B",
                "explicacion": "Las balizas no controladas informan de puntos fijos (inicio de una limitación de velocidad), mientras que las controladas se asocian a señales y su telegrama depende del aspecto de ésta."
            },
            {
                "pregunta": "Si al realizar el mantenimiento de un accionamiento de aguja se introduce una galga de 5 mm entre la aguja y la contra-aguja, ¿qué debe ocurrir?",
                "opciones": ["A) El motor debe hacer más fuerza para cerrar completamente", "B) El embrague debe actuar y la protección eléctrica debe cortar la alimentación del motor en un tiempo de 5 a 12 segundos", "C) La aguja debe cortar la galga y cerrar normalmente", "D) El enclavamiento debe autorizar el movimiento igualmente"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la prueba de obstrucción. Simula un obstáculo en el cambio para verificar que los sistemas de protección del motor (embrague mecánico y protección térmica/temporizada) funcionan correctamente."
            },
            {
                "pregunta": "¿Cuál es la función del 'módulo destellador' en la caseta de un paso a nivel?",
                "opciones": ["A) Controlar el motor de las barreras", "B) Hacer lucir de forma alternada los focos rojos de las señales de carretera y detectar si hay lámparas fundidas", "C) Generar el aviso acústico", "D) Comunicarse con el enclavamiento"],
                "respuestaCorrecta": "B",
                "explicacion": "Este módulo es el responsable de la señalización luminosa hacia la carretera. Supervisa el estado de las lámparas y envía una alarma si detecta alguna fundida."
            },
            {
                "pregunta": "Un sistema de 'cantón móvil' (como en ERTMS Nivel 3) aumenta la capacidad de una línea porque:",
                "opciones": ["A) Los cantones se mueven físicamente", "B) Elimina los cantones fijos y la distancia de seguridad se basa en la posición exacta y la velocidad de los trenes, permitiendo que circulen más juntos", "C) Los trenes son más rápidos", "D) Las señales son más fáciles de ver"],
                "respuestaCorrecta": "B",
                "explicacion": "El cantón móvil es una 'burbuja' de seguridad que se mueve con el tren, permitiendo optimizar al máximo la separación entre circulaciones y, por tanto, aumentar la capacidad de la línea."
            },
            {
                "pregunta": "El 'pedal de rearme' en un paso a nivel automático se sitúa después del cruce y sirve para:",
                "opciones": ["A) Avisar de la llegada del tren", "B) Indicar al sistema que el tren ya ha pasado completamente el cruce para iniciar la secuencia de apertura", "C) Frenar el tren si el paso está ocupado", "D) Rearmar la alimentación eléctrica del paso"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el punto de detección que confirma que la cola del tren ha liberado el paso a nivel, permitiendo que el sistema inicie el proceso para reanudar el tráfico por carretera de forma segura."
            },
            
            {
                "pregunta": "Una señal lateral con una luz roja fija significa:",
                "opciones": ["A) Parada absoluta ante la señal", "B) Anuncio de precaución", "C) Se puede rebasar a baja velocidad", "D) Fallo en la señal"],
                "respuestaCorrecta": "A",
                "explicacion": "El rojo es la indicación más restrictiva y significa 'parada obligatoria'. Rebasarla sin autorización es una de las faltas más graves."
            },
            {
                "pregunta": "¿Qué detecta un 'circuito de vía'?",
                "opciones": ["A) La velocidad del tren", "B) La presencia de un tren en un tramo de vía mediante un cortocircuito entre los carriles", "C) La temperatura del carril", "D) El tipo de tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el sistema de detección de ocupación más clásico. El eje metálico del tren une eléctricamente los dos carriles, y esa detección se usa en el enclavamiento."
            },
            {
                "pregunta": "Un 'contador de ejes' funciona:",
                "opciones": ["A) Pesando los ejes", "B) Contando los ejes que entran y salen de un cantón; si el número coincide, el tramo está libre", "C) Midiendo el diámetro de los ejes", "D) Mediante una cámara que cuenta los ejes"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una alternativa moderna al circuito de vía, especialmente útil en zonas con mal aislamiento eléctrico de los carriles (túneles húmedos, etc.)."
            },
            {
                "pregunta": "Una 'señal de avanzada' es la primera señal que un maquinista encuentra al aproximarse a:",
                "opciones": ["A) El final de la línea", "B) Una estación o bifurcación", "C) Un túnel", "D) Un puente"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la señal que protege la entrada a una estación. Su indicación informa al maquinista sobre el estado de las señales siguientes (entrada y salida)."
            },
            {
                "pregunta": "Un semáforo bajo con 3 luces blancas formando un triángulo (señal de maniobras) autoriza:",
                "opciones": ["A) La salida a la línea principal", "B) Un movimiento de maniobra dentro de una estación", "C) La parada inmediata", "D) Un movimiento marcha atrás"],
                "respuestaCorrecta": "B",
                "explicacion": "Estas señales, llamadas 'indicadores de dirección' o 'jorobas', se usan en las zonas de maniobras para autorizar movimientos controlados a baja velocidad."
            },
            {
                "pregunta": "¿Cuál es la función principal de un enclavamiento de tipo 'geográfico' o de módulos?",
                "opciones": ["A) Utilizar relés más grandes que los de cableado libre", "B) Simplificar el diseño y mantenimiento al usar módulos estandarizados por cada elemento de campo (señal, desvío, etc.)", "C) Funcionar exclusivamente con GPS", "D) Ser controlado únicamente desde un Puesto de Mando geográficamente lejano"],
                "respuestaCorrecta": "B",
                "explicacion": "Los enclavamientos geográficos o de módulos abstraen la complejidad del cableado libre, permitiendo añadir o quitar elementos de forma modular, lo que simplifica enormemente el diseño y el mantenimiento."
            },
            {
                "pregunta": "En un accionamiento de aguja electromecánico, ¿qué indica que la protección temporizada de 8 segundos ha actuado?",
                "opciones": ["A) Que el movimiento se ha realizado con éxito y en tiempo récord", "B) Que el motor no ha podido completar el recorrido, probablemente por un obstáculo, y el enclavamiento le ha retirado la tensión para evitar daños", "C) Que el motor necesita una revisión de aceite", "D) Que la tensión de alimentación es demasiado alta"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una protección de seguridad que evita que el motor se queme si el movimiento de los espadines queda obstaculizado. Si en unos 8 segundos no se completa la maniobra, se corta la orden."
            },
            {
                "pregunta": "Si durante el mantenimiento se mide una tensión de 20V en la entrada de un módulo destellador que funciona a 24Vcc (±20%), ¿qué se debe esperar que haga el módulo?",
                "opciones": ["A) Que funcione con normalidad, ya que está dentro de tolerancia", "B) Que se apague por baja tensión", "C) Que los destellos vayan más lentos", "D) Que se active una alarma pero siga funcionando"],
                "respuestaCorrecta": "A",
                "explicacion": "Una tensión de 24Vcc con una tolerancia de ±20% admite un rango de entre 19.2V y 28.8V. Por lo tanto, 20V está dentro del rango de funcionamiento normal del equipo."
            },
            {
                "pregunta": "En un sistema de bloqueo automático, ¿cuál es el propósito de un 'cantón'?",
                "opciones": ["A) Ser una zona de descanso para maquinistas", "B) Ser un tramo de vía protegido por señales en el que solo puede haber un tren a la vez para garantizar la distancia de seguridad", "C) Indicar la distancia kilométrica de la línea", "D) Ser el lugar donde se guardan las herramientas de mantenimiento"],
                "respuestaCorrecta": "B",
                "explicacion": "La división de la vía en cantones es el principio fundamental del bloqueo automático, impidiendo que un tren alcance a otro al asegurar que siempre haya al menos un cantón libre entre ellos."
            },
            {
                "pregunta": "En el sistema LZB, la comunicación continua entre la central y el tren se realiza a través de:",
                "opciones": ["A) Balizas ERTMS", "B) La catenaria", "C) Un cable o lazo inductivo tendido entre los carriles", "D) Una red de radio GSM-R"],
                "respuestaCorrecta": "C",
                "explicacion": "El LZB se basa en un cable-antena tendido a lo largo de la vía que permite un intercambio constante de información con el tren, a diferencia de los sistemas de balizas que son puntuales."
            },
            {
                "pregunta": "¿Qué es un 'circuito de vía de audiofrecuencia'?",
                "opciones": ["A) Un circuito que emite música para los pasajeros", "B) Un sistema de detección de tren que no necesita juntas aislantes mecánicas, ya que delimita los cantones mediante 'juntas eléctricas' sintonizadas a diferentes frecuencias", "C) Un interfono para hablar con el maquinista", "D) Un circuito de vía que solo funciona de noche"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos circuitos eliminan el gran problema de mantenimiento de las juntas aislantes, utilizando frecuencias de audio para separar los circuitos de forma electrónica."
            },
            {
                "pregunta": "Cuando se instala un detector de obstáculos en un paso a nivel con semibarreras (S.B.A.), y el detector informa de la presencia de un vehículo, ¿qué acción realiza la señal ferroviaria?",
                "opciones": ["A) Se pone en verde para que el tren despeje el paso rápidamente", "B) Se mantiene en indicación de 'paso a nivel sin protección' (aspa amarilla) y no autoriza el paso al tren", "C) Muestra una indicación especial de 'obstáculo en vía'", "D) No se ve afectada, la responsabilidad es del maquinista"],
                "respuestaCorrecta": "B",
                "explicacion": "La seguridad es lo primero. Si el detector informa de una ocupación, la señal al ferrocarril no se abrirá, imponiendo la parada al tren hasta que el obstáculo sea retirado."
            },
            {
                "pregunta": "¿Cuál es la función del 'software de sistema' en un enclavamiento electrónico?",
                "opciones": ["A) Definir la geografía y las rutas específicas de una estación concreta", "B) Proporcionar las funciones básicas de operación, similar al sistema operativo de un ordenador, siendo idéntico para todos los enclavamientos de la misma tecnología", "C) Es el antivirus del enclavamiento", "D) Gestionar la venta de billetes"],
                "respuestaCorrecta": "B",
                "explicacion": "El software de sistema es la base genérica y validada, sobre la que corre el 'software de aplicación', que es el que contiene la lógica específica de cada estación."
            },
            {
                "pregunta": "Una 'pérdida intempestiva de supervisión' en un desvío es una avería en la que:",
                "opciones": ["A) El desvío se mueve solo sin recibir una orden", "B) El desvío, estando en reposo, pierde momentáneamente la comprobación de su posición, a menudo por vibraciones al paso de un tren", "C) El operario se olvida de supervisar el desvío", "D) La supervisión del desvío tarda más de lo normal en llegar"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un fallo intermitente, a menudo causado por un ajuste mecánico demasiado crítico o falsos contactos, que provoca que el enclavamiento deje de 'ver' la posición correcta del desvío."
            },
            {
                "pregunta": "En un sistema de protección S.L.A., ¿qué indica la señal 'OTRO TREN'?",
                "opciones": ["A) Que el tren que se acerca es de otra compañía", "B) Que se ha detectado la llegada de un segundo tren mientras el paso a nivel ya estaba activado por un primero", "C) Que el maquinista debe cambiar de tren", "D) Que el tren es demasiado largo"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un aviso de seguridad para los vehículos de carretera, indicando que, aunque un tren ya haya pasado, otro se aproxima y las protecciones van a seguir activadas."
            },
            {
                "pregunta": "Un enclavamiento eléctrico 'de cableado libre' se caracteriza por:",
                "opciones": ["A) No utilizar cables para funcionar", "B) Basar su lógica de seguridad exclusivamente en el diseño eléctrico y el cableado relé a relé, sin elementos modulares", "C) Ser el tipo de enclavamiento más moderno que existe", "D) Ser programable mediante software"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la primera generación de enclavamientos eléctricos, donde cada condición de seguridad se implementa con cadenas de contactos de relés cableadas individualmente, lo que los hace complejos de diseñar y modificar."
            },
            {
                "pregunta": "¿Qué es la 'malla de trenes' que utiliza un regulador en un Puesto de Mando?",
                "opciones": ["A) La red de cables que alimenta el Puesto de Mando", "B) El plan horario gráfico que describe los trenes que van a circular, sus horarios y sus cruces/adelantamientos previstos", "C) Una red para atrapar trenes que se saltan una señal", "D) El uniforme del regulador"],
                "respuestaCorrecta": "B",
                "explicacion": "La 'malla' o gráfico de circulación es la herramienta fundamental con la que el regulador gestiona el tráfico para cumplir los horarios con la mayor exactitud posible."
            },
            {
                "pregunta": "El 'tiempo de aviso' mínimo de 6 segundos en un paso a nivel automático sirve para:",
                "opciones": ["A) Dar tiempo al maquinista a frenar", "B) Asegurar que las señales luminosas y acústicas actúan un tiempo suficiente para que los conductores se detengan antes de que las barreras empiecen a bajar", "C) Dar tiempo a que el sistema se rearme", "D) Realizar una comprobación de las lámparas"],
                "respuestaCorrecta": "B",
                "explicacion": "Este preaviso es una garantía de seguridad para que los vehículos tengan tiempo de reaccionar y detenerse antes del descenso de las barreras."
            },
            {
                "pregunta": "El sistema ATP (Automatic Train Protection) se diferencia del ASFA en que:",
                "opciones": ["A) El ATP no utiliza balizas", "B) Los sistemas ATP controlan continuamente la velocidad del tren, generando una curva de frenado, mientras que el ASFA es una supervisión puntual en la señal", "C) El ASFA es más moderno que el ATP", "D) El ATP no puede frenar el tren"],
                "respuestaCorrecta": "B",
                "explicacion": "El ATP (como ERTMS o EBICAB) ofrece un nivel de seguridad superior, ya que no solo actúa ante el rebase de una señal, sino que supervisa permanentemente que el tren circule por debajo de una curva de velocidad segura."
            },
            {
                "pregunta": "¿Por qué un enclavamiento electrónico necesita un 'software de aplicación' específico para cada instalación?",
                "opciones": ["A) Porque el software de sistema caduca cada año", "B) Porque el software de aplicación contiene la lógica y los datos únicos de esa estación (mapa de vías, rutas permitidas, etc.)", "C) Para que sea compatible con el idioma del operador local", "D) No es necesario, todos usan el mismo software"],
                "respuestaCorrecta": "B",
                "explicacion": "Mientras el 'software de sistema' es el motor genérico, el de 'aplicación' es el traje a medida que define las reglas de funcionamiento concretas para una playa de vías determinada."
            },
            {
                "pregunta": "¿Qué problema resuelve la configuración en 'cascada' de varios circuitos de vía?",
                "opciones": ["A) El exceso de agua en la vía", "B) La necesidad de supervisar un tramo de vía más largo que la longitud máxima de un solo circuito", "C) La falta de tensión en la línea", "D) El ruido de los trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "Cuando un cantón es muy largo, se divide en varios sub-circuitos. Luego, un 'totalizador' suma las informaciones para que el enclavamiento reciba un único estado de libre/ocupado para todo el tramo."
            },
            {
                "pregunta": "Un 'fallo de mando' en un accionamiento de aguja ocurre cuando:",
                "opciones": ["A) El motor recibe la orden de movimiento pero no llega a iniciarlo, o se detiene a mitad de recorrido", "B) El mando del operador del CTC no funciona", "C) La aguja se mueve en dirección contraria a la ordenada", "D) La aguja pierde la supervisión una vez que ya está en su posición final"],
                "respuestaCorrecta": "A",
                "explicacion": "Se diferencia del fallo de supervisión en que el problema ocurre durante la maniobra, impidiendo que esta se complete con éxito."
            },
            {
                "pregunta": "El 'módulo de mando electrónico' es considerado el 'cerebro' de un paso a nivel porque:",
                "opciones": ["A) Es el componente más grande", "B) Contiene la lógica programada para interpretar las señales de los detectores de tren y controlar todos los periféricos (barreras, señales, etc.)", "C) Emite un sonido similar a un cerebro", "D) Está ubicado en la parte más alta de la caseta"],
                "respuestaCorrecta": "B",
                "explicacion": "Este módulo centraliza toda la operación del paso a nivel, tomando las decisiones de abrir o cerrar en función de la información que recibe de la vía y de su configuración."
            },
            {
                "pregunta": "En el mantenimiento de un enclavamiento de cableado libre, ¿por qué es crítico comprobar el 'apriete de bornas'?",
                "opciones": ["A) Porque las bornas flojas hacen mucho ruido", "B) Porque una borna floja puede crear una alta resistencia, calentamiento o un falso contacto, provocando fallos intermitentes muy difíciles de localizar", "C) Para pasar una auditoría de calidad", "D) Para que el cableado quede estéticamente mejor"],
                "respuestaCorrecta": "B",
                "explicacion": "Muchísimas averías en sistemas eléctricos tienen su origen en un mal conexionado. El apriete de bornas es una tarea de mantenimiento preventivo básica y fundamental."
            },
            {
                "pregunta": "En una arquitectura de telemando, la 'máquina de interfaces externos' (MIE) sirve para:",
                "opciones": ["A) Conectar las pantallas del operador", "B) Proporcionar información del estado de la circulación a sistemas externos como otros CTCs o el Sistema de Información al Viajero (SIV)", "C) Gestionar el correo electrónico del Puesto de Mando", "D) Controlar el sistema de aire acondicionado"],
                "respuestaCorrecta": "B",
                "explicacion": "La MIE actúa como una pasarela segura para intercambiar datos con otros sistemas, permitiendo por ejemplo que un tren 'pase' de forma transparente de un telemando a otro contiguo."
            },
            {
                "pregunta": "La principal ventaja de la señalización en cabina (ERTMS Nivel 2) frente a la lateral es que:",
                "opciones": ["A) Permite eliminar las señales físicas (semáforos) de la vía, ya que el maquinista recibe las órdenes directamente en una pantalla", "B) Las pantallas de cabina tienen más colores que los semáforos", "C) Requiere menos mantenimiento para el maquinista", "D) Es más barata de instalar"],
                "respuestaCorrecta": "A",
                "explicacion": "La señalización en cabina es indispensable para la alta velocidad, ya que la visibilidad de las señales laterales se degrada. Además, permite una supervisión continua y no solo puntual."
            },
            {
                "pregunta": "Si un paso a nivel automático queda cerrado por 'tiempo de cierre excesivo' (ej. 10 minutos), ¿qué hace el sistema?",
                "opciones": ["A) Envía una alarma al Puesto de Mando pero permanece cerrado indefinidamente", "B) Llama automáticamente a la policía de tráfico", "C) Ordena la apertura automática de las semibarreras y presenta una indicación de fallo leve al próximo tren", "D) Provoca una bajada de tensión en toda la línea"],
                "respuestaCorrecta": "C",
                "explicacion": "Es una medida de seguridad para no bloquear indefinidamente el tráfico de carretera por una avería. El sistema se normaliza y avisa al siguiente tren de la incidencia para que extreme las precauciones."
            },
            {
                "pregunta": "Un sistema 'hot-standby' en los servidores de un CTC significa que:",
                "opciones": ["A) Los servidores se calientan mucho y necesitan refrigeración especial", "B) Hay dos servidores idénticos funcionando en paralelo; si el 'activo' falla, el 'pasivo' ('en caliente') toma el control de forma inmediata y automática", "C) El segundo servidor está apagado y hay que encenderlo manualmente si el primero falla", "D) Los datos se guardan en la nube"],
                "respuestaCorrecta": "B",
                "explicacion": "Esta arquitectura de redundancia es clave para garantizar la alta disponibilidad de un sistema crítico como el CTC, permitiendo una conmutación casi instantánea en caso de fallo."
            },
            {
                "pregunta": "En un circuito de vía 'monocarril', la corriente de señalización circula por:",
                "opciones": ["A) Los dos carriles por igual", "B) Un solo carril (carril señalizado), mientras que el otro se usa exclusivamente para el retorno de la corriente de tracción", "C) El balasto", "D) Un cable aéreo paralelo a la vía"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una configuración que se usa para simplificar la instalación en zonas con tracción eléctrica, aunque presenta más problemas de interferencias y de detección de rotura de carril."
            },
            {
                "pregunta": "El 'módulo de protección peatonal' de un paso a nivel controla:",
                "opciones": ["A) La velocidad de los peatones", "B) Las señales acústicas y luminosas específicas para el cruce de peatones", "C) La apertura y cierre de la estación", "D) Las máquinas de venta de billetes"],
                "respuestaCorrecta": "B",
                "explicacion": "En pasos a nivel con mucho tránsito peatonal, se instalan señales adicionales (siluetas de peatón, etc.) cuyo funcionamiento es gobernado por este módulo específico."
            },
            {
                "pregunta": "¿Cuál es la función del 'módulo convertidor' asociado a las señales ferroviarias de un paso a nivel?",
                "opciones": ["A) Convertir la corriente alterna en continua", "B) Encender las lámparas de las señales al ferrocarril (aspa y doble flecha), controlando su aspecto fijo o intermitente", "C) Adaptar los enchufes de la caseta", "D) Convertir los telegramas ERTMS a ASFA"],
                "respuestaCorrecta": "B",
                "explicacion": "Este módulo recibe las órdenes del módulo de mando y las traduce en la alimentación eléctrica necesaria para encender el aspecto que corresponda en la señal que ve el maquinista."
            },
            {
                "pregunta": "La 'localización de averías' en un enclavamiento electrónico es generalmente más fácil que en uno eléctrico porque:",
                "opciones": ["A) Los componentes electrónicos nunca fallan", "B) Los sistemas electrónicos disponen de herramientas de diagnóstico por software, registros de eventos (logs) e indicaciones visuales (LEDs) que ayudan a identificar el fallo", "C) Siempre hay un informático en la estación", "D) Se pueden reparar con un reinicio"],
                "respuestaCorrecta": "B",
                "explicacion": "Mientras que en un enclavamiento eléctrico la avería hay que buscarla midiendo en las cadenas de relés, en uno electrónico el propio sistema suele ofrecer un diagnóstico mucho más preciso."
            },
            {
                "pregunta": "En el sistema EBICAB 900, un 'Punto de Información de Señal' consta de dos balizas. ¿Por qué motivo?",
                "opciones": ["A) Una es de repuesto por si la otra falla", "B) La primera es controlada (su información depende de la señal) y la segunda es no controlada (informa de la posición y características fijas)", "C) Para poder detectar trenes en ambos sentidos", "D) Para medir la velocidad del tren por el tiempo que tarda en pasar entre ellas"],
                "respuestaCorrecta": "B",
                "explicacion": "Esta combinación de balizas permite al tren recibir tanto la información variable (el aspecto de la señal) como la información fija (punto kilométrico, gradientes, etc.) en un mismo punto."
            },
            {
                "pregunta": "¿Qué información crucial proporciona un 'relé de caída diferida'?",
                "opciones": ["A) Asegura que una condición de seguridad ha estado presente durante un tiempo mínimo antes de confirmarla", "B) Retrasa la caída de la tensión de la catenaria", "C) Mide el tiempo que tarda un tren en frenar", "D) Indica cuándo va a llover"],
                "respuestaCorrecta": "A",
                "explicacion": "Se usa para evitar micro-cortes o señales espurias. El relé solo se activa o desactiva si la condición de entrada (tensión) se mantiene de forma estable durante el tiempo de retardo para el que está diseñado, filtrando así los fallos breves."
            },
            {
                "pregunta": "Una 'cerradura eléctrica' o 'cerrojo eléctrico' gobernado por un enclavamiento se utiliza para:",
                "opciones": ["A) Cerrar las puertas de la estación por la noche", "B) Bloquear un elemento de vía (ej. una aguja de maniobra manual) e informar de su estado al enclavamiento", "C) Asegurar los armarios de relés", "D) Dar una descarga eléctrica de seguridad"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite integrar elementos manuales en la lógica de seguridad. El enclavamiento no liberará la cerradura para que se mueva la aguja si no se dan las condiciones de seguridad, y viceversa."
            },
            {
                "pregunta": "En un sistema de señalización, ¿qué es un 'circuito de vía de audiofrecuencia'?",
                "opciones": ["A) Un circuito que emite música para los pasajeros", "B) Un sistema de detección de tren que no necesita juntas aislantes mecánicas, ya que delimita los cantones mediante 'juntas eléctricas' sintonizadas a diferentes frecuencias", "C) Un interfono para hablar con el maquinista", "D) Un circuito de vía que solo funciona de noche"],
                "respuestaCorrecta": "B",
                "explicacion": "Estos circuitos eliminan el gran problema de mantenimiento de las juntas aislantes, utilizando frecuencias de audio para separar los circuitos de forma electrónica."
            },
            {
                "pregunta": "¿Qué función tiene un 'detector de cajas calientes'?",
                "opciones": ["A) Detectar si la calefacción del tren funciona", "B) Medir la temperatura de los rodamientos de los ejes al pasar el tren para prevenir incendios o roturas", "C) Medir la temperatura ambiente", "D) Calentar la comida del maquinista"],
                "respuestaCorrecta": "B",
                "explicacion": "Un rodamiento sobrecalentado (caja caliente) es un síntoma de una avería grave que puede llevar al bloqueo del eje y al descarrilamiento."
            },
            {
                "pregunta": "Una 'Limitación Temporal de Velocidad' (LTV) se señaliza en la vía mediante:",
                "opciones": ["A) Una llamada por radio", "B) Señales portátiles de 'Anuncio', 'Inicio' y 'Fin' de la limitación", "C) Un operario con una bandera", "D) No se señaliza, se avisa en el parte del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Se usan señales de forma romboidal (amarillo) y cuadrada (verde) para advertir e indicar el punto exacto de inicio y fin de una limitación por obras, por ejemplo."
            },
            {
                "pregunta": "¿Qué es un 'edificio técnico' o 'caseta de enclavamiento'?",
                "opciones": ["A) Un museo de tecnología", "B) El edificio seguro que alberga el enclavamiento electrónico y otros equipos de señalización", "C) La taquilla de la estación", "D) Un taller de reparaciones"],
                "respuestaCorrecta": "B",
                "explicacion": "Son construcciones robustas y climatizadas que protegen el 'cerebro' y el 'corazón' de los sistemas de seguridad de una estación o tramo de línea."
            },
            {
                "pregunta": "Una señal de 'Anuncio de Precaución' (luz amarilla parpadeante) indica al maquinista que:",
                "opciones": ["A) La siguiente señal está en rojo (parada)", "B) No debe exceder una cierta velocidad al pasar por la siguiente señal", "C) Hay niebla densa", "D) El sistema de señales funciona correctamente"],
                "respuestaCorrecta": "B",
                "explicacion": "Advierte de que la siguiente señal presenta una limitación de velocidad, por ejemplo, al tomar un desvío."
            },
            {
                "pregunta": "El principio de 'Fail-Safe' en señalización significa que:",
                "opciones": ["A) El sistema nunca falla", "B) Si el sistema falla, lo hace de un modo seguro (ej. todas las señales a rojo)", "C) Los fallos son seguros para el personal de mantenimiento", "D) El sistema es seguro contra ciberataques"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el principio fundamental del diseño en seguridad. Ante cualquier avería (un cable cortado, un relé fundido), el sistema debe derivar a un estado que garantice la seguridad, como una parada."
            },
            {
                "pregunta": "Un 'paso a nivel' con barreras automáticas se activa mediante:",
                "opciones": ["A) Un operario que pulsa un botón", "B) La detección del tren aproximándose, a través de circuitos de vía o contadores de ejes", "C) Un horario fijo", "D) Sensores de movimiento de los coches"],
                "respuestaCorrecta": "B",
                "explicacion": "El propio sistema de detección de trenes 'avisa' al paso a nivel de la llegada del tren con la antelación suficiente para bajar las barreras."
            },
            {
                "pregunta": "En el sistema ERTMS, ¿qué es una 'baliza'?",
                "opciones": ["A) Una luz intermitente en la vía", "B) Un dispositivo pasivo en la vía que transmite paquetes de datos al tren", "C) La antena de radio del tren", "D) Una señal manual"],
                "respuestaCorrecta": "B",
                "explicacion": "Son 'transpondedores' que se 'despiertan' con el campo magnético del tren y le transmiten información vital (posición, pendientes, limitaciones, etc.)."
            },
            {
                "pregunta": "Las 'agujas de un desvío se dicen que están 'acerrojadas' cuando:",
                "opciones": ["A) Están oxidadas", "B) Están bloqueadas mecánicamente en una posición, impidiendo su movimiento", "C) Están cubiertas de nieve", "D) Están recién pintadas"],
                "respuestaCorrecta": "B",
                "explicacion": "El acerrojamiento es un mecanismo de seguridad que asegura físicamente que la aguja no se moverá mientras un tren pasa por ella, incluso si falla el motor."
            },
            {
                "pregunta": "Una señal con una pantalla alfanumérica que muestra un número (ej. '80') indica:",
                "opciones": ["A) El número de la línea", "B) El número de tren", "C) Una limitación de velocidad máxima en km/h", "D) La distancia a la próxima estación"],
                "respuestaCorrecta": "C",
                "explicacion": "Estas pantallas complementan las señales luminosas para indicar velocidades específicas que el tren no debe superar."
            },
            {
                "pregunta": "El sistema 'ASFA Digital' es un sistema de ayuda a la conducción que:",
                "opciones": ["A) Conduce el tren automáticamente", "B) Supervisa que el maquinista reconoce las señales y frena el tren si no lo hace", "C) Muestra la televisión digital en el tren", "D) Digitaliza los billetes de tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Anuncia en cabina el estado de la siguiente señal. Si el maquinista no pulsa un botón para confirmar que la ha visto, el sistema aplica el freno de emergencia."
            },
            {
                "pregunta": "Un 'detector de caída de objetos' se instala en:",
                "opciones": ["A) Los andenes de la estación", "B) Las bocas de los túneles y viaductos para detectar desprendimientos", "C) El interior de los vagones de mercancías", "D) El techo de los trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "Suelen ser barreras de fibra óptica o láser. Si un objeto (roca, árbol) las rompe, automáticamente ponen las señales de la zona en rojo."
            },
            {
                "pregunta": "¿Qué es un 'cantón' ferroviario?",
                "opciones": ["A) La esquina de una estación", "B) Un tramo de vía entre dos señales en el que, por seguridad, solo puede haber un tren a la vez", "C) La cafetería de la estación", "D) Un tipo de traviesa"],
                "respuestaCorrecta": "B",
                "explicacion": "La división de la línea en cantones es el principio básico del bloqueo, que impide que los trenes colisionen por alcance."
            },
            {
                "pregunta": "Un 'enclavamiento de relés' es una versión más antigua de enclavamiento que usa:",
                "opciones": ["A) Ordenadores", "B) Lógica electromecánica basada en relés, sin software", "C) Palancas manuales", "D) Engranajes y cables"],
                "respuestaCorrecta": "B",
                "explicacion": "Antes de los ordenadores, la lógica de seguridad se implementaba con complejos circuitos de relés. Muchos siguen funcionando de forma muy fiable hoy en día."
            },
            {
                "pregunta": "Un 'detector de viento lateral' es un sistema de seguridad crucial en alta velocidad que:",
                "opciones": ["A) Avisa a los pasajeros para que cierren las ventanas", "B) Mide la velocidad del viento e impone limitaciones de velocidad al tren si es muy fuerte", "C) Despliega barreras contra el viento", "D) Ajusta la aerodinámica del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Vientos laterales fuertes pueden ser peligrosos para la estabilidad de un tren ligero de alta velocidad, por lo que se monitorizan y gestionan activamente."
            },
            {
                "pregunta": "Una 'baliza de pre-inicio' de ERTMS se coloca:",
                "opciones": ["A) Al final de la zona ERTMS", "B) Justo antes del punto de inicio de una zona ERTMS para que el tren se 'prepare'", "C) En medio de la zona ERTMS", "D) En la estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Permite que el sistema de a bordo del tren sepa que está a punto de entrar en una zona gobernada por ERTMS, iniciando los protocolos de transición."
            },
            {
                "pregunta": "¿Qué es una 'ruta' en el contexto de un enclavamiento?",
                "opciones": ["A) El camino que sigue un operario", "B) Un itinerario seguro establecido y bloqueado a través de la estación para un tren", "C) El horario del tren", "D) Un mapa de la línea"],
                "respuestaCorrecta": "B",
                "explicacion": "El establecimiento de una ruta implica mover los desvíos a la posición correcta, comprobar que el camino está libre y poner la señal correspondiente en vía libre."
            },
            {
                "pregunta": "Las 'agujas calentadas' son una instalación de seguridad para:",
                "opciones": ["A) Mantener caliente al personal", "B) Evitar que el hielo y la nieve impidan el movimiento del desvío en invierno", "C) Acelerar el movimiento del desvío", "D) Secar la vía después de llover"],
                "respuestaCorrecta": "B",
                "explicacion": "Mediante resistencias eléctricas, se calienta la zona crítica de las agujas para garantizar su disponibilidad en condiciones meteorológicas adversas."
            },
            {
                "pregunta": "Un 'detector de ejes descarrilados' o 'pesacarriles' es un dispositivo que:",
                "opciones": ["A) Pesa los carriles", "B) Detecta si una rueda se ha salido del carril y pone las señales en rojo", "C) Cuenta el número de ejes", "D) Guía al tren para que no descarrile"],
                "respuestaCorrecta": "B",
                "explicacion": "Suele ser una barra o elemento frágil instalado junto al carril. Si una rueda descarrilada lo golpea, su rotura activa una alarma inmediata."
            },
            {
                "pregunta": "Las 'pantallas de protección' en los andenes de algunas estaciones (puertas de andén) sirven para:",
                "opciones": ["A) Proyectar publicidad", "B) Evitar caídas de personas a la vía y mejorar la climatización de la estación", "C) Indicar la hora", "D) Proteger del sol"],
                "respuestaCorrecta": "B",
                "explicacion": "Aumentan enormemente la seguridad al crear una barrera física entre el andén y la vía, y solo se abren cuando el tren está detenido y alineado."
            },
            {
                "pregunta": "Un 'enclavamiento geográfico' es un tipo de enclavamiento electrónico donde el software:",
                "opciones": ["A) Se basa en la geografía de la zona", "B) Representa la playa de vías de forma gráfica, facilitando la programación", "C) Solo funciona en ciertas regiones", "D) Usa GPS para localizar los trenes"],
                "respuestaCorrecta": "B",
                "explicacion": "La configuración se realiza sobre un plano esquemático de la estación, lo que simplifica y hace más intuitiva la labor de ingeniería de software."
            },
            {
                "pregunta": "La 'señal de retroceso autorizado' permite a un tren:",
                "opciones": ["A) Moverse en sentido contrario a la marcha normal de forma controlada", "B) Dar la vuelta completa", "C) Ir a la estación anterior", "D) Activar una marcha atrás super-rápida"],
                "respuestaCorrecta": "A",
                "explicacion": "Normalmente, moverse hacia atrás está prohibido. Esta señal, cuando se ordena, autoriza un movimiento de retroceso dentro de una zona protegida."
            },
            {
                "pregunta": "¿Qué es la 'cantonera' de un circuito de vía?",
                "opciones": ["A) El final del cantón", "B) La junta aislante que separa eléctricamente un circuito de vía del siguiente", "C) La caja de conexiones del circuito", "D) El operario encargado del cantón"],
                "respuestaCorrecta": "B",
                "explicacion": "Son juntas especiales en el carril, a menudo de material plástico o composite, que impiden que la corriente de un circuito de vía pase al contiguo."
            },
            {
                "pregunta": "La 'supervisión de velocidad' es una función de los sistemas ATP (como ERTMS) que:",
                "opciones": ["A) Advierte al maquinista si excede la velocidad", "B) Advierte y, si el maquinista no actúa, aplica el freno automáticamente", "C) Solo registra las velocidades para un informe posterior", "D) Ajusta la velocidad del tren automáticamente"],
                "respuestaCorrecta": "B",
                "explicacion": "El sistema no solo informa. Compara constantemente la velocidad real con la permitida y, si se supera el umbral, interviene activando el freno de servicio o de emergencia."
            }
        ],
        "Material Rodante": [
            {
                "pregunta": "El AVE Serie 100, el primero en llegar a España, fue fabricado por:",
                "opciones": ["A) Siemens", "B) Talgo", "C) Alstom", "D) CAF"],
                "respuestaCorrecta": "C",
                "explicacion": "El AVE S-100 es una derivación del TGV Atlantique francés, fabricado por Alstom. Fue el tren que inauguró la alta velocidad en España en 1992."
            },
            {
                "pregunta": "¿Cuál es el apodo del tren de alta velocidad Serie 102 de Renfe, fabricado por Talgo y Bombardier?",
                "opciones": ["A) El Pato", "B) La Bala", "C) El Delfín", "D) El Tiburón"],
                "respuestaCorrecta": "A",
                "explicacion": "Su característico testero aerodinámico, diseñado para reducir el efecto del viento lateral, le ha valido el apodo de 'Pato'."
            },
            {
                "pregunta": "¿Qué es un 'bogie' en un tren?",
                "opciones": ["A) La cabina del maquinista", "B) El sistema de enganche entre vagones", "C) El 'carrito' con las ruedas, ejes y suspensión bajo cada vagón", "D) El motor principal del tren"],
                "respuestaCorrecta": "C",
                "explicacion": "El bogie es el conjunto giratorio que soporta la caja del vehículo, guía el tren en la vía y aloja los sistemas de suspensión y, a menudo, los motores."
            },
            {
                "pregunta": "La tecnología de 'rodadura desplazable' es una innovación característica del fabricante:",
                "opciones": ["A) Siemens", "B) Alstom", "C) CAF", "D) Talgo"],
                "respuestaCorrecta": "D",
                "explicacion": "Talgo es mundialmente conocido por su sistema que permite a los trenes cambiar de ancho de vía (ej. de ibérico a UIC) sin detenerse."
            },
            {
                "pregunta": "Un tren 'autopropulsado' o 'unidad de tren' se diferencia de uno convencional en que:",
                "opciones": ["A) No tiene maquinista", "B) Los motores están distribuidos a lo largo del tren en vez de en una locomotora separada", "C) Es más lento", "D) Solo puede circular en una dirección"],
                "respuestaCorrecta": "B",
                "explicacion": "En trenes como los AVE o Cercanías, los equipos de tracción están integrados en los propios coches (cabezas motoras o bajo el piso), en lugar de tener una locomotora que tira o empuja."
            },
            {
                "pregunta": "El tren 'Velaro E', conocido en España como AVE S-103, es un producto del fabricante alemán:",
                "opciones": ["A) BMW", "B) Alstom", "C) Siemens", "D) Vossloh"],
                "respuestaCorrecta": "C",
                "explicacion": "La plataforma Velaro de Siemens es la base de muchos trenes de alta velocidad en el mundo, incluyendo el S-103 de Renfe y los ICE 3 alemanes."
            },
            {
                "pregunta": "¿Qué función tiene la 'suspensión primaria' en un bogie?",
                "opciones": ["A) Aislar al pasajero del ruido", "B) Conectar las cajas de grasa de los ejes con el bastidor del bogie", "C) Evitar que el tren descarrile", "D) Frenar el tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la primera etapa de suspensión (muelles, amortiguadores) y se encarga de absorber las vibraciones de alta frecuencia directamente de la interacción rueda-carril."
            },
            {
                "pregunta": "¿Qué significa que un tren es 'bitensión'?",
                "opciones": ["A) Que genera mucha tensión entre los pasajeros", "B) Que puede operar bajo dos voltajes de catenaria diferentes (ej. 3 kV DC y 25 kV AC)", "C) Que tiene dos maquinistas", "D) Que tiene el doble de potencia"],
                "respuestaCorrecta": "B",
                "explicacion": "Esto permite a un mismo tren circular por líneas con sistemas de electrificación distintos, como las líneas convencionales y las de alta velocidad en España."
            },
            {
                "pregunta": "Los trenes Alvia S-130 o S-730 (híbrido) son conocidos por su versatilidad al ser:",
                "opciones": ["A) Los más rápidos de Renfe", "B) De dos pisos", "C) De ancho variable y bitensión (o híbridos diésel/eléctricos)", "D) Exclusivamente para mercancías"],
                "respuestaCorrecta": "C",
                "explicacion": "Su capacidad para cambiar de ancho y de tipo de alimentación les permite conectar ciudades a través de la red de alta velocidad y la red convencional."
            },
            {
                "pregunta": "¿Qué es la 'Tara' de un vagón?",
                "opciones": ["A) El peso máximo que puede transportar", "B) La velocidad máxima del vagón", "C) El peso del vagón completamente vacío", "D) Un defecto de fabricación"],
                "respuestaCorrecta": "C",
                "explicacion": "La Tara es el peso en vacío. El Peso Máximo es la Tara más la carga que puede transportar. Es un dato fundamental para la logística."
            },
            {
                "pregunta": "La Serie 112 de Renfe es una evolución del:",
                "opciones": ["A) AVE S-100 (Alstom)", "B) Talgo 200", "C) AVE S-102 'Pato' (Talgo)", "D) Alvia S-120 (CAF)"],
                "respuestaCorrecta": "C",
                "explicacion": "El S-112 es esencialmente un 'Pato' de segunda generación, compartiendo la misma plataforma tecnológica pero con mayor capacidad de plazas."
            },
            {
                "pregunta": "¿Qué es el 'freno reostático'?",
                "opciones": ["A) Un freno que funciona con agua", "B) Un sistema donde la energía del frenado se disipa en forma de calor en grandes resistencias", "C) El freno de estacionamiento", "D) Un freno que funciona con aire"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un tipo de freno eléctrico. En lugar de devolver la energía a la catenaria (regenerativo), los motores actúan como generadores y la energía se 'quema' en resistencias."
            },
            {
                "pregunta": "CAF (Construcciones y Auxiliar de Ferrocarriles) es un importante fabricante de material rodante de origen:",
                "opciones": ["A) Alemán", "B) Francés", "C) Español", "D) Italiano"],
                "respuestaCorrecta": "C",
                "explicacion": "Con sede en Beasain (País Vasco), CAF es uno de los grandes fabricantes ferroviarios a nivel mundial, produciendo desde tranvías hasta trenes de alta velocidad."
            },
            {
                "pregunta": "El 'arenero' es un dispositivo del tren que libera arena sobre el carril para:",
                "opciones": ["A) Limpiar la vía", "B) Aumentar la adherencia en condiciones de patinaje o deslizamiento", "C) Enfriar las ruedas", "D) Pesar más y tener más tracción"],
                "respuestaCorrecta": "B",
                "explicacion": "En condiciones de lluvia o con hojas en la vía, la adherencia rueda-carril disminuye. La arena aumenta la fricción y mejora la tracción y el frenado."
            },
            {
                "pregunta": "Un tren es considerado 'articulado' (como los Talgo) cuando:",
                "opciones": ["A) Tiene muchas puertas", "B) Los vagones comparten un bogie o sistema de rodadura intermedio", "C) Puede hablar", "D) Se puede doblar por la mitad"],
                "respuestaCorrecta": "B",
                "explicacion": "En vez de que cada coche tenga dos bogies, los coches se apoyan en el sistema de rodadura del siguiente, formando un conjunto articulado y más ligero."
            },
            {
                "pregunta": "¿Qué significa la 'potencia nominal' de un tren?",
                "opciones": ["A) La potencia máxima que puede dar en un instante", "B) La potencia máxima que puede sostener de forma continua sin sobrecalentarse", "C) La potencia que consume con la calefacción encendida", "D) Es un valor teórico sin importancia práctica"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la potencia de trabajo para la que el tren ha sido diseñado. Puede dar picos de potencia mayores, pero solo durante breves periodos."
            },
            {
                "pregunta": "El Shinkansen Serie 0, el primer 'tren bala', es reconocible por:",
                "opciones": ["A) Su color amarillo brillante", "B) Su morro redondeado similar a la nariz de un avión", "C) Ser de dos pisos", "D) No tener ventanas"],
                "respuestaCorrecta": "B",
                "explicacion": "Su icónico diseño aerodinámico, inspirado en la aviación, se convirtió en el símbolo de la alta velocidad japonesa en 1964."
            },
            {
                "pregunta": "¿Qué es la 'caja' o 'casco' de un vagón?",
                "opciones": ["A) La estructura metálica principal que aloja a los pasajeros o la mercancía", "B) El bogie", "C) El techo del vagón", "D) El chasis inferior"],
                "respuestaCorrecta": "A",
                "explicacion": "Es el cuerpo del vehículo, la estructura autoportante que se apoya sobre los bogies y conforma el espacio útil del tren."
            },
            {
                "pregunta": "Las locomotoras diésel-eléctricas generan movimiento...",
                "opciones": ["A) Conectando directamente el motor diésel a las ruedas", "B) Quemando diésel para mover un generador que produce electricidad para los motores eléctricos de las ruedas", "C) Usando el diésel para calentar vapor", "D) Alternando entre motor diésel y eléctrico"],
                "respuestaCorrecta": "B",
                "explicacion": "La mayoría de locomotoras diésel no tienen una transmisión mecánica. El motor diésel es una central eléctrica a bordo que alimenta los motores de tracción eléctricos."
            },
            {
                "pregunta": "¿Qué es el sistema 'DMI' (Driver Machine Interface) en una cabina moderna?",
                "opciones": ["A) El volante del tren", "B) El conjunto de pantallas que muestran al maquinista la velocidad, estado de sistemas y órdenes de señalización", "C) El asiento del maquinista", "D) La radio de comunicación"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la interfaz principal entre el maquinista y el tren, especialmente en sistemas como el ERTMS, donde sustituye a las señales laterales."
            },
            {
                "pregunta": "El tren AGV de Alstom (luego Avelia) fue innovador por ser:",
                "opciones": ["A) Un tren de vapor de alta velocidad", "B) Un tren articulado con tracción distribuida", "C) El primer tren de dos pisos de alta velocidad", "D) Un tren anfibio"],
                "respuestaCorrecta": "B",
                "explicacion": "Combinó la arquitectura articulada (típica de los TGV) con la tracción distribuida (motores bajo los coches, como los Velaro), en lugar de cabezas motoras."
            },
            {
                "pregunta": "¿Cuál es la función del 'amortiguador antilazo' o 'de guiñada' en un bogie de alta velocidad?",
                "opciones": ["A) Evitar que el bogie se mueva lateralmente de forma brusca a alta velocidad", "B) Amortiguar el ruido", "C) Frenar el tren", "D) Servir de lazo para unir vagones"],
                "respuestaCorrecta": "A",
                "explicacion": "Este amortiguador horizontal controla el 'movimiento de lazo', una oscilación lateral del bogie que puede aparecer a altas velocidades, garantizando la estabilidad."
            },
            {
                "pregunta": "Los trenes de mercancías utilizan un sistema de freno:",
                "opciones": ["A) Eléctrico exclusivamente", "B) Neumático de aire comprimido que recorre todo el tren", "C) Manual en cada vagón", "D) No utilizan frenos"],
                "respuestaCorrecta": "B",
                "explicacion": "El sistema UIC de freno neumático, controlado por una tubería general, es el estándar que permite acoplar vagones de diferentes tipos y nacionalidades."
            },
            {
                "pregunta": "El 'perfil de la rueda' ferroviaria es cónico para:",
                "opciones": ["A) Reducir el ruido", "B) Poder inscribirse en las curvas de forma natural y mantenerse centrado en la vía", "C) Verse más elegante", "D) Ahorrar material"],
                "respuestaCorrecta": "B",
                "explicacion": "La conicidad hace que, en una curva, la rueda exterior recorra más distancia que la interior, permitiendo que el eje gire sin deslizar. También ayuda al autocentrado en recta."
            },
            {
                "pregunta": "¿Qué significa 'composición simple' y 'composición múltiple'?",
                "opciones": ["A) Un tren fácil y uno difícil de conducir", "B) Un tren con una sola unidad autopropulsada o varias unidades acopladas y controladas a la vez", "C) Un billete de ida y uno de ida y vuelta", "D) Un tren de pasajeros y uno de mercancías"],
                "respuestaCorrecta": "B",
                "explicacion": "Un AVE S-102 circulando solo es una composición simple. Si se le acopla otra unidad S-102 detrás, forman una composición múltiple con el doble de plazas."
            },
            {
                "pregunta": "La 'masa no suspendida' de un bogie es un parámetro crítico. Se busca que sea:",
                "opciones": ["A) Lo más alta posible", "B) Lo más baja posible", "C) De un valor intermedio", "D) No tiene importancia"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la masa que no está soportada por la suspensión (ruedas, ejes). Cuanto menor sea, menor es el impacto y la agresión sobre la vía, algo vital en alta velocidad."
            },
            {
                "pregunta": "El tren 'Frecciarossa 1000' italiano, también conocido como ETR 1000, es un producto de:",
                "opciones": ["A) Ferrari y Lamborghini", "B) Alstom y Fiat Ferroviaria", "C) Hitachi y Bombardier", "D) Siemens y Talgo"],
                "respuestaCorrecta": "C",
                "explicacion": "Este tren, uno de los más rápidos de Europa, fue desarrollado conjuntamente por Hitachi Rail (antes AnsaldoBreda) y Bombardier (ahora parte de Alstom)."
            },
            {
                "pregunta": "¿Qué es la 'pestaña' de la rueda?",
                "opciones": ["A) Un adorno de la rueda", "B) El resalte interior de la rueda que evita que el tren se salga del carril", "C) La parte que está en contacto con el carril", "D) Un sensor en la rueda"],
                "respuestaCorrecta": "B",
                "explicacion": "La pestaña es el elemento de seguridad final que guía al tren, especialmente en los desvíos, e impide el descarrilamiento."
            },
            {
                "pregunta": "Los trenes de dos pisos, como algunos TGV Duplex, se diseñan para:",
                "opciones": ["A) Ofrecer mejores vistas", "B) Aumentar la capacidad de pasajeros sin alargar el tren", "C) Ser más aerodinámicos", "D) Soportar más peso"],
                "respuestaCorrecta": "B",
                "explicacion": "En líneas de muy alta demanda, los trenes de dos pisos pueden transportar hasta un 40% más de pasajeros con la misma longitud de tren, optimizando el uso de la infraestructura."
            },
            {
                "pregunta": "¿De qué material suelen estar hechas las 'pletinas de contacto' del pantógrafo?",
                "opciones": ["A) Cobre", "B) Acero", "C) Carbono o grafito", "D) Plástico"],
                "respuestaCorrecta": "C",
                "explicacion": "Se usa carbono porque es un buen conductor eléctrico y, a la vez, es más blando que el hilo de contacto, asegurando que el desgaste se produzca en la pletina (que es reemplazable) y no en la catenaria."
            }
        ],
        "LAV ESTE": [
            {
                "pregunta": "¿En qué año se inauguró el tramo de alta velocidad Madrid - Valencia?",
                "opciones": ["A) 1992", "B) 2005", "C) 2010", "D) 2015"],
                "respuestaCorrecta": "C",
                "explicacion": "La Línea de Alta Velocidad (LAV) Madrid-Valencia se inauguró oficialmente en diciembre de 2010, conectando ambas ciudades en aproximadamente 95 minutos."
            },
            {
                "pregunta": "¿Qué sistema de señalización y seguridad es el estándar en la LAV Levante?",
                "opciones": ["A) ASFA convencional", "B) LZB", "C) ERTMS Nivel 1 y Nivel 2", "D) Bloqueo Telefónico"],
                "respuestaCorrecta": "C",
                "explicacion": "La línea utiliza principalmente ERTMS Nivel 1, con tramos preparados para Nivel 2, el estándar europeo que permite la interoperabilidad y la supervisión continua de la velocidad."
            },
            {
                "pregunta": "¿Cómo se llama la estación de alta velocidad de Cuenca, una parada clave en la línea?",
                "opciones": ["A) Cuenca Central", "B) Cuenca del Huécar", "C) Fernando Zóbel", "D) Alfonso VIII"],
                "respuestaCorrecta": "C",
                "explicacion": "La estación, ubicada a las afueras de la ciudad, fue nombrada en honor al pintor abstracto español Fernando Zóbel, muy vinculado a Cuenca."
            },
            {
                "pregunta": "El Viaducto de Contreras, una de las obras más espectaculares de la línea, ostenta un récord. ¿Cuál es?",
                "opciones": ["A) Ser el más largo de España", "B) Ser el puente con el mayor arco de hormigón para ferrocarril de Europa", "C) Ser el más alto de España", "D) Estar construido con un solo pilar"],
                "respuestaCorrecta": "B",
                "explicacion": "El arco del Viaducto de Contreras, con sus 261 metros de luz, fue en su momento el mayor de Europa para uso ferroviario, una proeza de la ingeniería."
            },
            {
                "pregunta": "¿Qué estación es la principal terminal de los trenes de alta velocidad en Valencia?",
                "opciones": ["A) València Nord", "B) València Cabanyal", "C) València Font de Sant Lluís", "D) València Joaquín Sorolla"],
                "respuestaCorrecta": "D",
                "explicacion": "La estación de Joaquín Sorolla se construyó como una terminal provisional para la llegada del AVE, a la espera de la futura Estación Central subterránea."
            },
            {
                "pregunta": "La conexión de alta velocidad con Alicante se completó en 2013, ¿desde qué punto de la línea principal se ramifica?",
                "opciones": ["A) Cerca de Cuenca", "B) En la bifurcación de Albacete", "C) A las afueras de Valencia", "D) Directamente desde Madrid"],
                "respuestaCorrecta": "B",
                "explicacion": "La línea se diseñó con un tronco común Madrid-Albacete. En la bifurcación de Albacete, la línea se divide en dos ramales: uno hacia Valencia y otro hacia Alicante/Murcia."
            },
            {
                "pregunta": "¿Qué serie de trenes de Renfe, apodados 'Pato', son los más habituales en el servicio AVE de esta línea?",
                "opciones": ["A) Serie 100", "B) Serie 103 'Velaro'", "C) Serie 130 'Patito'", "D) Serie 102/112"],
                "respuestaCorrecta": "D",
                "explicacion": "Los trenes de las series 102 y su evolución, la 112, fabricados por Talgo-Bombardier, son la imagen característica de este corredor por su particular diseño aerodinámico."
            },
            {
                "pregunta": "Además de Renfe (AVE/Avlo), ¿qué otros dos operadores privados compiten en la ruta Madrid-Valencia?",
                "opciones": ["A) Alsa y Avanza", "B) SNCF y Trenitalia", "C) Ouigo e Iryo", "D) Euskotren y FGC"],
                "respuestaCorrecta": "C",
                "explicacion": "Tras la liberalización, la francesa Ouigo (con trenes de dos pisos) y la hispano-italiana Iryo (con los trenes 'Frecciarossa') operan en esta línea, aumentando la oferta y la competencia."
            },
            {
                "pregunta": "¿Cuál es la única estación intermedia en el trayecto directo de la LAV entre Madrid y Valencia?",
                "opciones": ["A) Cuenca Fernando Zóbel", "B) Albacete-Los Llanos", "C) Requena-Utiel", "D) No hay ninguna"],
                "respuestaCorrecta": "C",
                "explicacion": "En el ramal directo a Valencia, las únicas paradas son Cuenca y Requena-Utiel. Albacete se encuentra en el ramal que se desvía hacia Alicante."
            },
            {
                "pregunta": "¿Qué tensión y tipo de corriente utiliza la catenaria de la LAV Levante?",
                "opciones": ["A) 3.000 V en Corriente Continua", "B) 1.500 V en Corriente Continua", "C) 25.000 V en Corriente Alterna", "D) 50.000 V en Corriente Alterna"],
                "respuestaCorrecta": "C",
                "explicacion": "Como todas las líneas de alta velocidad de España, utiliza 25 kV (25.000 voltios) a 50 Hz en corriente alterna, el estándar europeo."
            },
            {
                "pregunta": "El túnel más largo de la línea es el de La Cabrera, con más de 7 km. ¿Entre qué dos provincias se encuentra?",
                "opciones": ["A) Madrid y Toledo", "B) Madrid y Cuenca", "C) Cuenca y Valencia", "D) Valencia y Castellón"],
                "respuestaCorrecta": "B",
                "explicacion": "El túnel de La Cabrera es una de las infraestructuras clave del primer tramo de la línea, perforando la Sierra de Altomira entre las provincias de Madrid y Cuenca."
            },
            {
                "pregunta": "El servicio de bajo coste de Renfe en esta línea se llama Avlo. ¿Qué color corporativo lo caracteriza?",
                "opciones": ["A) Rojo", "B) Verde", "C) Morado", "D) Amarillo"],
                "respuestaCorrecta": "C",
                "explicacion": "Los trenes Avlo, que son unidades de la serie 112 reformadas con más asientos, se distinguen fácilmente por su llamativa decoración en color morado."
            },
            {
                "pregunta": "¿Qué ancho de vía se utiliza en la LAV Madrid-Levante?",
                "opciones": ["A) Ancho Ibérico (1668 mm)", "B) Ancho Internacional o UIC (1435 mm)", "C) Ancho Métrico (1000 mm)", "D) Ancho Mixto"],
                "respuestaCorrecta": "B",
                "explicacion": "Se utiliza el ancho estándar (UIC) para permitir la interoperabilidad con la red europea y el uso de material rodante estándar de alta velocidad."
            },
            {
                "pregunta": "Los trenes de Ouigo que operan en esta línea tienen una característica distintiva. ¿Cuál es?",
                "opciones": ["A) Son híbridos (diésel/eléctricos)", "B) Son de dos pisos", "C) Tienen bogies de ancho variable", "D) Son los más cortos"],
                "respuestaCorrecta": "B",
                "explicacion": "Ouigo utiliza los trenes Alstom Euroduplex, derivados del TGV, que son los únicos de dos pisos que circulan por esta línea, ofreciendo una gran capacidad de pasajeros."
            },
            {
                "pregunta": "¿Qué importante infraestructura permite a los trenes AVE llegar desde Atocha hasta Chamartín en Madrid para continuar viaje al norte?",
                "opciones": ["A) La M-30", "B) Un cambiador de ancho", "C) El nuevo túnel de alta velocidad Atocha-Chamartín", "D) La línea de Cercanías C-5"],
                "respuestaCorrecta": "C",
                "explicacion": "El tercer túnel de la risa, exclusivo para alta velocidad, permite la conexión directa entre las dos grandes estaciones de Madrid, creando un eje pasante Norte-Sur."
            },
            {
                "pregunta": "Los trenes 'Frecciarossa 1000' del operador Iryo son de fabricación:",
                "opciones": ["A) Alemana (Siemens)", "B) Española (Talgo)", "C) Francesa (Alstom)", "D) Italiana (Hitachi/Bombardier)"],
                "respuestaCorrecta": "D",
                "explicacion": "Estos trenes, conocidos como 'Flecha Roja' en Italia, son el buque insignia de la alta velocidad italiana y han sido adaptados para operar en la red española."
            },
            {
                "pregunta": "Para la construcción de los túneles de la línea, ¿qué tipo de maquinaria pesada se utilizó principalmente?",
                "opciones": ["A) Excavadoras convencionales", "B) Explosivos (método tradicional)", "C) Tuneladoras (TBM)", "D) Martillos hidráulicos gigantes"],
                "respuestaCorrecta": "C",
                "explicacion": "Se utilizaron varias tuneladoras (TBM), apodadas 'topos', máquinas que perforan la sección completa del túnel y colocan el revestimiento de hormigón a medida que avanzan."
            },
            {
                "pregunta": "¿Cuál es la velocidad comercial máxima a la que los trenes están autorizados a circular en la mayor parte de la LAV Levante?",
                "opciones": ["A) 250 km/h", "B) 270 km/h", "C) 300 km/h", "D) 350 km/h"],
                "respuestaCorrecta": "C",
                "explicacion": "La línea está diseñada y equipada para una velocidad máxima sostenida de 300 km/h, aunque técnicamente la infraestructura podría soportar velocidades superiores."
            },
            {
                "pregunta": "Además de Valencia y Alicante, la LAV Levante también da servicio de alta velocidad a la Región de:",
                "opciones": ["A) Extremadura", "B) Asturias", "C) Murcia", "D) Galicia"],
                "respuestaCorrecta": "C",
                "explicacion": "El ramal de Alicante se extiende hasta la Región de Murcia, con la llegada del AVE a la capital murciana a finales de 2022."
            },
            {
                "pregunta": "La estación de Alicante Terminal recibió el AVE adaptando sus vías. ¿Qué tuvo que hacer Adif para ello?",
                "opciones": ["A) Construir una estación completamente nueva", "B) Cambiar vías de ancho ibérico a ancho internacional", "C) Electrificar la estación por primera vez", "D) Añadir un tercer piso a la estación"],
                "respuestaCorrecta": "B",
                "explicacion": "Para la llegada del AVE, se tuvieron que adaptar varias vías de la estación, cambiando el tradicional ancho ibérico al ancho estándar (UIC) que usa la alta velocidad."
            },
            {
                "pregunta": "¿Qué significa el acrónimo LAV?",
                "opciones": ["A) Larga Vía", "B) Locomotora a Vapor", "C) Límite Autorizado de Velocidad", "D) Línea de Alta Velocidad"],
                "respuestaCorrecta": "D",
                "explicacion": "LAV es el término técnico que Adif utiliza para referirse a las Líneas de Alta Velocidad que componen la red ferroviaria española."
            },
            {
                "pregunta": "El viaje inaugural Madrid-Valencia fue protagonizado por un tren de la serie 112. ¿Quiénes fueron unos de sus primeros pasajeros?",
                "opciones": ["A) Futbolistas del Madrid y Valencia", "B) Los entonces Reyes de España y el Presidente del Gobierno", "C) Un grupo de turistas elegidos por sorteo", "D) Solo personal ferroviario"],
                "respuestaCorrecta": "B",
                "explicacion": "Como es tradición en las grandes obras públicas, el viaje inaugural contó con la presencia de las más altas autoridades del Estado."
            },
            {
                "pregunta": "La orografía entre Cuenca y Valencia es muy compleja. ¿Qué tipo de obra de ingeniería predomina en este tramo?",
                "opciones": ["A) Largas rectas a nivel del suelo", "B) Una sucesión de túneles y viaductos", "C) Vías que bordean un río", "D) Un único y larguísimo túnel"],
                "respuestaCorrecta": "B",
                "explicacion": "Para salvar las hoces y montañas de la Serranía de Cuenca, el trazado es una continua sucesión de túneles y viaductos para mantener un perfil suave."
            },
            {
                "pregunta": "¿Qué empresa pública es la propietaria y gestora de la infraestructura (vías, estaciones, catenaria) de la LAV Levante?",
                "opciones": ["A) Renfe", "B) Iryo", "C) El Ministerio de Fomento", "D) Adif AV (Alta Velocidad)"],
                "respuestaCorrecta": "D",
                "explicacion": "Adif (Administrador de Infraestructuras Ferroviarias) es la empresa estatal que construye y gestiona la red, cobrando un canon a los operadores (Renfe, Ouigo, Iryo) por su uso."
            },
            {
                "pregunta": "¿Cuál fue uno de los principales objetivos socioeconómicos de la construcción de esta línea?",
                "opciones": ["A) Fomentar el uso de la bicicleta", "B) Conectar la capital con la tercera ciudad más grande de España y un importante eje turístico", "C) Facilitar el transporte de mercancías pesadas", "D) Probar una nueva tecnología de levitación"],
                "respuestaCorrecta": "B",
                "explicacion": "La línea buscaba una mejor vertebración territorial, uniendo de forma rápida y eficiente el centro político y económico con la potente Comunidad Valenciana."
            },
            {
                "pregunta": "Algunos trenes Alvia que usan esta línea hacia la costa mediterránea necesitan una instalación especial. ¿Cuál?",
                "opciones": ["A) Un surtidor de diésel", "B) Un cambiador de ancho de vía", "C) Un túnel de lavado especial", "D) Un muelle para barcos"],
                "respuestaCorrecta": "B",
                "explicacion": "Los Alvia usan la LAV hasta Valencia y luego continúan por vía convencional (ancho ibérico) hacia otros destinos. Para ello, deben pasar por un cambiador de ancho."
            },
            {
                "pregunta": "El tiempo de viaje entre Madrid y Valencia (aprox. 1h 40m) es significativamente menor que el viaje en coche (aprox. 3h 30m), esto es un ejemplo de:",
                "opciones": ["A) Competitividad intermodal del ferrocarril", "B) Magia", "C) Un error en los horarios", "D) El tráfico lento de los coches"],
                "respuestaCorrecta": "A",
                "explicacion": "La alta velocidad compite directamente con otros modos de transporte (coche, avión). Su éxito en esta línea demuestra su alta competitividad en tiempo y comodidad."
            },
            {
                "pregunta": "La estación de Requena-Utiel, a pesar de estar en la línea de alta velocidad, se encuentra:",
                "opciones": ["A) En el centro de Requena", "B) A varios kilómetros de ambas poblaciones", "C) Bajo tierra", "D) Dentro de una bodega de vino"],
                "respuestaCorrecta": "B",
                "explicacion": "Como muchas estaciones de alta velocidad construidas para trazados nuevos, se ubica fuera de los núcleos urbanos para permitir un paso a alta velocidad y dar servicio a toda la comarca."
            },
            {
                "pregunta": "El futuro de la línea en Valencia pasa por una obra faraónica. ¿Cuál es?",
                "opciones": ["A) Convertirla en una línea de levitación magnética", "B) Cubrir toda la playa de vías con un parque", "C) El soterramiento de las vías y la construcción de una Estación Central subterránea", "D) Añadir dos vías más en superficie"],
                "respuestaCorrecta": "C",
                "explicacion": "El gran proyecto a largo plazo es la creación del Canal de Acceso y la Estación Central subterránea, eliminando la barrera ferroviaria que divide la ciudad."
            },
            {
                "pregunta": "La liberalización de la línea Madrid-Valencia ha provocado un efecto notable en el mercado. ¿Cuál?",
                "opciones": ["A) Un aumento significativo de los precios", "B) Una drástica bajada de los precios medios y un aumento de la oferta", "C) La desaparición de los trenes de Renfe", "D) Que solo se pueda viajar en primera clase"],
                "respuestaCorrecta": "B",
                "explicacion": "La entrada de Ouigo e Iryo generó una fuerte competencia que resultó en una notable reducción del precio medio de los billetes y un incremento masivo en el número de trenes diarios."
            }
        ],
        "Operación y Circulación": [
            {
                "pregunta": "¿Qué es un 'Puesto de Mando' o 'CTC' (Control de Tráfico Centralizado)?",
                "opciones": ["A) La cabina principal de un tren", "B) La oficina del director de la estación", "C) El centro neurálgico desde donde se gestiona la circulación de una línea o un área", "D) Un simulador de conducción"],
                "respuestaCorrecta": "C",
                "explicacion": "Desde el Puesto de Mando, los Responsables de Circulación monitorizan y controlan las señales, desvíos y el movimiento de todos los trenes en tiempo real."
            },
            {
                "pregunta": "El 'Responsable de Circulación' (a veces llamado 'jefe de circulación') es la persona que:",
                "opciones": ["A) Conduce el tren", "B) Vende los billetes", "C) Gestiona y autoriza los movimientos de los trenes en su área de control", "D) Repara las vías"],
                "respuestaCorrecta": "C",
                "explicacion": "Es la máxima autoridad en materia de circulación, responsable de garantizar que los trenes se mueven de forma segura y eficiente."
            },
            {
                "pregunta": "¿Qué es un 'surco' ferroviario?",
                "opciones": ["A) Un desgaste en el carril", "B) El derecho de paso de un tren específico en un tramo, a una hora determinada", "C) Un tipo de billete con descuento", "D) El sonido que hace el tren"],
                "respuestaCorrecta": "B",
                "explicacion": "Es la 'franja horaria' que una operadora (Renfe, Ouigo, Iryo) solicita al administrador (Adif) para poder circular. La gestión de surcos es la base de la planificación horaria."
            },
            {
                "pregunta": "En el 'Reglamento General de Circulación' (RGC), ¿qué significa la orden 'Marche a la Vista'?",
                "opciones": ["A) Circular a máxima velocidad", "B) Conducir de forma que se pueda parar ante cualquier obstáculo en la mitad del campo de visión libre", "C) Seguir visualmente al tren de delante", "D) Poner las luces largas"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una orden de máxima precaución que se da cuando no hay garantía total de que la vía esté libre, por ejemplo, al entrar en una vía ocupada ('Pleno Ocupado')."
            },
            {
                "pregunta": "¿Qué es un 'gráfico de circulación'?",
                "opciones": ["A) Un dibujo del tren", "B) Una representación gráfica de los horarios de los trenes en un eje espacio-tiempo", "C) El mapa de la red ferroviaria", "D) Un gráfico de las ventas de billetes"],
                "respuestaCorrecta": "B",
                "explicacion": "En este gráfico se representan las líneas (surcos) de cada tren. Los cruces entre líneas indican los puntos donde los trenes se cruzan o se adelantan."
            },
            {
                "pregunta": "Un 'Bloqueo por Señalización Lateral' significa que la seguridad entre trenes se basa en:",
                "opciones": ["A) La comunicación por radio", "B) Las señales luminosas instaladas a los lados de la vía", "C) La distancia de seguridad que mantiene el maquinista", "D) Un sistema GPS"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el sistema de bloqueo clásico, donde el maquinista conduce según las indicaciones que le dan las señales (semáforos) que va encontrando."
            },
            {
                "pregunta": "En ERTMS Nivel 2, el 'Bloqueo Móvil' se basa en:",
                "opciones": ["A) La posición exacta del tren, permitiendo acercar los trenes mucho más", "B) Bloques de hormigón que se mueven", "C) Señales móviles transportadas por operarios", "D) El teléfono móvil del maquinista"],
                "respuestaCorrecta": "A",
                "explicacion": "Al saber la posición real y la velocidad de cada tren, el sistema crea un 'cantón móvil' o una 'burbuja de seguridad' detrás de cada uno, optimizando la capacidad de la línea."
            },
            {
                "pregunta": "¿Qué es una 'maniobra' en terminología ferroviaria?",
                "opciones": ["A) Un truco de magia hecho en el tren", "B) Cualquier movimiento que no sea parte de la marcha normal de un tren, como formar o segregar una composición", "C) Un adelantamiento a otro tren", "D) Una frenada de emergencia"],
                "respuestaCorrecta": "B",
                "explicacion": "Las maniobras son los movimientos controlados dentro de las estaciones o terminales para posicionar vehículos, cambiar la composición, etc."
            },
            {
                "pregunta": "El 'Libro de Horarios' de un tren contiene:",
                "opciones": ["A) Los horarios de todos los trenes del país", "B) La 'marcha tipo' del tren, con las horas de paso teóricas por cada punto kilométrico", "C) El horario de trabajo del maquinista", "D) Un listado de relojes famosos"],
                "respuestaCorrecta": "B",
                "explicacion": "Es el documento oficial que detalla la planificación horaria de un tren específico, incluyendo velocidades máximas y tiempos de paso."
            },
            {
                "pregunta": "Una 'parada técnica' es aquella que se realiza para:",
                "opciones": ["A) Que los pasajeros tomen un café", "B) Fines operativos, como el cruce con otro tren o el cambio de maquinista, sin subida ni bajada de viajeros", "C) Reparar una avería en el tren", "D) Esperar a que pase una tormenta"],
                "respuestaCorrecta": "B",
                "explicacion": "Son paradas programadas en el horario pero que no tienen un propósito comercial, sino que son necesarias para la gestión de la circulación."
            },
            {
                "pregunta": "¿Qué significa 'dar punto de toma' en la jerga de circulación?",
                "opciones": ["A) Dar la hora exacta", "B) La acción del Responsable de Circulación de confirmar que ha recibido y anotado una comunicación del maquinista", "C) Poner una chincheta en un mapa", "D) Iniciar una conversación"],
                "respuestaCorrecta": "B",
                "explicacion": "Es un procedimiento de seguridad en las comunicaciones verbales para asegurar que los mensajes importantes han sido recibidos y registrados correctamente."
            },
            {
                "pregunta": "El 'Agente de Maniobras' es el especialista encargado de:",
                "opciones": ["A) Dirigir los movimientos de maniobras desde tierra, comunicándose con el maquinista", "B) Conducir los trenes de maniobras", "C) Limpiar las vías de la estación", "D) Vender billetes para grupos"],
                "respuestaCorrecta": "A",
                "explicacion": "Es el 'director de orquesta' en las operaciones de formación de trenes, guiando al maquinista y operando los enganches y desenganches."
            },
            {
                "pregunta": "Cuando un tren circula con 'retraso', el Puesto de Mando puede:",
                "opciones": ["A) Pedirle que acelere por encima de la velocidad máxima", "B) Alterar la prioridad de otros trenes para minimizar el impacto del retraso", "C) Cancelar el tren inmediatamente", "D) No puede hacer nada, solo observar"],
                "respuestaCorrecta": "B",
                "explicacion": "La gestión de incidencias implica tomar decisiones complejas, como retrasar ligeramente un tren puntual para dar paso a uno muy retrasado, para optimizar la red."
            },
            {
                "pregunta": "La 'publicación de horarios' se realiza con meses de antelación para:",
                "opciones": ["A) Que los maquinistas puedan planificar sus vacaciones", "B) Permitir a las operadoras vender billetes y a Adif organizar la capacidad de la red", "C) Imprimir los libros de horarios", "D) Es una tradición sin motivo práctico"],
                "respuestaCorrecta": "B",
                "explicacion": "La planificación ferroviaria es un proceso a largo plazo que requiere coordinar las necesidades de todas las empresas que usan la infraestructura."
            },
            {
                "pregunta": "Un 'Boletín de Órdenes e Informaciones' es un documento que el Puesto de Mando entrega al maquinista para:",
                "opciones": ["A) Felicitarle por su trabajo", "B) Notificarle prescripciones o incidencias temporales que afectan a su tren y no están en los horarios", "C) Pedirle que compre algo en la siguiente estación", "D) Informarle de las noticias del día"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una herramienta formal para comunicar información crítica y temporal, como una nueva limitación de velocidad o el estado de un paso a nivel."
            },
            {
                "pregunta": "El 'conocimiento de línea' es un requisito que obliga a un maquinista a:",
                "opciones": ["A) Haber memorizado todo el mapa ferroviario", "B) Haber recorrido y estudiado una línea específica antes de poder circular por ella con pasajeros", "C) Conocer a todos los jefes de estación de la línea", "D) Tener un título en geografía"],
                "respuestaCorrecta": "B",
                "explicacion": "Antes de operar en una ruta, el maquinista debe familiarizarse con su perfil, señalización, puntos singulares, etc., para poder anticiparse y conducir de forma segura."
            },
            {
                "pregunta": "El 'despacho' de un tren es:",
                "opciones": ["A) La oficina del maquinista", "B) La orden de salida que el Responsable de Circulación da al maquinista, normalmente mediante la apertura de la señal de salida", "C) Enviar el tren por correo", "D) El último vagón del tren"],
                "respuestaCorrecta": "B",
                "explicacion": "El tren no puede iniciar su marcha hasta que no ha sido 'despachado', es decir, hasta que no tiene la autorización de circulación pertinente."
            },
            {
                "pregunta": "Una 'vía de apartado' en una estación sirve para:",
                "opciones": ["A) Apartar a los pasajeros que se portan mal", "B) Estacionar un tren para que sea adelantado por otro o para realizar un cruce", "C) Una vía que no se usa", "D) Exponer trenes antiguos"],
                "respuestaCorrecta": "B",
                "explicacion": "Son vías esenciales para la flexibilidad de la explotación, permitiendo que trenes más rápidos (AVE) adelanten a otros más lentos (Cercanías, Mercancías)."
            },
            {
                "pregunta": "La 'Capacidad' de una línea ferroviaria se mide en:",
                "opciones": ["A) El número de pasajeros que puede transportar", "B) El número máximo de trenes que pueden circular por ella en un día", "C) La anchura de la línea", "D) El peso total que soporta"],
                "respuestaCorrecta": "B",
                "explicacion": "La gestión de la capacidad es el arte de optimizar los surcos para permitir el paso del mayor número de trenes posible de forma segura."
            },
            {
                "pregunta": "La 'composición del tren' es un documento o información que detalla:",
                "opciones": ["A) Los ingredientes de la comida del vagón restaurante", "B) El número, tipo y orden de los vehículos que forman el tren, así como su peso y longitud", "C) La música que suena en el tren", "D) La decoración de los vagones"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una información vital para el maquinista y el centro de control, ya que afecta a la distancia de frenado y al comportamiento del tren."
            },
            {
                "pregunta": "Un 'cruce' de trenes es una operación que ocurre en:",
                "opciones": ["A) Vías dobles", "B) Vías únicas, donde un tren espera en una estación al paso del que viene en sentido contrario", "C) Pasos a nivel", "D) Autopistas"],
                "respuestaCorrecta": "B",
                "explicacion": "En líneas de vía única, la planificación de los puntos de cruce en las estaciones es el aspecto más crítico de la gestión de la circulación."
            },
            {
                "pregunta": "El 'Agente de Acompañamiento' es el personal a bordo (interventor/supervisor) cuya máxima responsabilidad, además de la comercial, es:",
                "opciones": ["A) La seguridad de los pasajeros", "B) Vender refrescos", "C) Poner películas", "D) Contar chistes"],
                "respuestaCorrecta": "A",
                "explicacion": "Es el responsable de la evacuación en caso de emergencia, del confort y de la seguridad general de todas las personas a bordo del tren."
            },
            {
                "pregunta": "Un 'teleindicador' en una estación es:",
                "opciones": ["A) Un teléfono para llamar al director", "B) La pantalla que muestra las próximas salidas y llegadas, la vía y el andén", "C) Un indicador de la temperatura", "D) Un mapa de la ciudad"],
                "respuestaCorrecta": "B",
                "explicacion": "Son los paneles electrónicos que proporcionan la información esencial al viajero para que sepa a qué andén debe dirigirse."
            },
            {
                "pregunta": "El 'sentido par' e 'impar' de circulación se usa para:",
                "opciones": ["A) Distinguir los trenes que suben de los que bajan", "B) Asignar un número a cada tren; normalmente impar si se aleja de Madrid y par si se acerca", "C) Saber si el número de pasajeros es par o impar", "D) Es una distinción sin uso práctico"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una convención para la numeración de trenes. En líneas radiales, los que se alejan del 'kilómetro cero' (Madrid) son impares, y los que se acercan, pares."
            },
            {
                "pregunta": "La 'liberalización' del transporte ferroviario en Europa significa que:",
                "opciones": ["A) Los viajes en tren son gratis", "B) Múltiples empresas (Renfe, Ouigo, Iryo) pueden competir operando trenes sobre la misma red", "C) No hay normas de seguridad", "D) Los trenes pueden circular por donde quieran"],
                "respuestaCorrecta": "B",
                "explicacion": "Separa al administrador de la infraestructura (Adif) de los operadores, permitiendo la competencia en el transporte de pasajeros y mercancías."
            },
            {
                "pregunta": "Un 'adelantamiento' se produce cuando:",
                "opciones": ["A) Un tren más rápido pasa a otro más lento que ha sido apartado en una estación", "B) Dos trenes circulan en paralelo", "C) Un tren llega antes de su hora", "D) Un tren se salta una estación"],
                "respuestaCorrecta": "A",
                "explicacion": "Es una maniobra de circulación planificada que requiere que el tren más lento se detenga en una vía de apartado para no obstaculizar al tren con mayor prioridad."
            },
            {
                "pregunta": "¿Qué es la 'marcha a la deriva'?",
                "opciones": ["A) Conducir sin rumbo fijo", "B) Circular con los motores apagados o al ralentí, aprovechando la inercia o una pendiente favorable para ahorrar energía", "C) Cuando un tren se avería y se mueve sin control", "D) Una técnica de conducción prohibida"],
                "respuestaCorrecta": "B",
                "explicacion": "Es una técnica de conducción eficiente que los maquinistas utilizan para optimizar el consumo de energía sin perder el horario previsto."
            },
            {
                "pregunta": "Si un maquinista debe rebasar una señal de parada, necesita:",
                "opciones": ["A) Acelerar mucho", "B) Una 'Orden de Rebase' verbal y/o por escrito del Responsable de Circulación", "C) Simplemente puede pasar si no viene nadie", "D) Pedir permiso a los pasajeros"],
                "respuestaCorrecta": "B",
                "explicacion": "Rebasar una señal en rojo sin autorización es extremadamente peligroso. Solo se puede hacer bajo una orden explícita y registrada del Puesto de Mando."
            },
            {
                "pregunta": "La 'puntualidad' de un tren se mide oficialmente si llega a su destino final con un retraso inferior a:",
                "opciones": ["A) Un minuto", "B) Treinta minutos", "C) Cinco minutos (generalmente)", "D) Una hora"],
                "respuestaCorrecta": "C",
                "explicacion": "Aunque varía ligeramente, el estándar comúnmente aceptado para considerar un tren puntual es que su retraso en destino no supere los 5 minutos sobre la hora programada."
            }
        ]
       
    }
}